// creating an array and passing the number, questions, options, and answers
let questions = [

    // 1
    {
      numb: 1,
      question:"النظام بصفة عامة هو مجموعة من الاجزاء او العناصر المترابطة,التي تتفاعل مع بعضها وفقا لأجراءات محددة,لتحقيق هدف معين او مجموعة من الاهداف",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 2
    {
      numb: 2,
      question:"يقوم نظام المعلومات المحاسبي بتجميع وتسجيل وتبويب وتلخيص بيانات العمليات المالية التي تجريها الوحدة الاقتصادية خلال الفترة المحاسبية بهدف توفير معلومات مفيدة للمستخدمين من داخل او خارج المنشأة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 3
    {
      numb: 3,
      question:"تعتبر البيانات المواد الخام التي يتم استخدامها كمدخلات لنظام المعلومات,وهي تعتبر غير مفيدة بحالتها وتحتاج لعمليات تشغيل ومعالجة حتي يتم تحويلها الي معلومات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 4
    {
      numb: 4,
      question:"يعتبر المستثمرين والمقرضين من اهم انواع المستخدمين الداخليين للمعلومات التي ينتجها نظام المعلومات المحاسبي",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 5
    {
      numb: 5,
      question:"يتكون نظام المعلومات المحاسبي من ثلاث عناصر هي المدخلات,عمليات التشغيل,المخرجات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 6
    {
      numb: 6,
      question:"تلتزم الشركة بنشر اربعة قوائم هي قائمة المركز المالي,قائمة الدخل,قائمة التدفقات النقدية,قائمة التغير في حقوق الملكية بالاضافة الي الايضاحات المتممة للقوائم المالية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 7
    {
      numb: 7,
      question:"المحاسبة الادارية هي احد فروع المحاسبة وتهدف لتوفير معلومات لمناسبة للأدارة لمساعدتها في القيام بوظائف التخطيط والرقابة واتخاذ القرارات بهدف بقاء المنظمة ونموها",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 8
    {
      numb: 8,
      question:"محاسبة التكاليف توفر معلومات لمتخذي القرارات من خارج الشركة بينما توفر المحاسبة المالية معلومات لمتخذي القرارات من داخل الشركة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 9
    {
      numb: 9,
      question:"تعتبر الاصول والالتزامات من عناصر قائمة المركز المالي , بينما تعتبر الايرادات والمصروفات من عناصر قائمة الدخل",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 10
    {
      numb: 10,
      question:"تتكون قائمة المركز المالي من ثلاثة عناصر أساسية:الأصول , الالتزامات , الايرادات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 11
    {
      numb: 11,
      question:"تعتبر حسابات الاصول وحسابات الالتزامات من امثلة الحسابات الاسمية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 12
    {
      numb: 12,
      question:"يعتبر الملاك والادارة من اهم أنواع المستخدمين الداخليين للمعلومات التي ينتجها نظام المعلومات المحاسبي",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 13
    {
      numb: 13,
      question:"تنقسم خصائص جودة المعلومات المحاسبية الي خصائص رئسية مثل الثبات القابلية للمقارنة , وخصائص أخري ثانوية مثل الموثوقية والملائمة.",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 14
    {
      numb: 14,
      question:"تتحقق خاصية ملائمة المعلومات المحاسبية عن طريق توافر بعض الخصائص الفرعية مثل التعبير الصادق والحياد القابلية للتحقق",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 15
    {
      numb: 15,
      question:"تتحقق خاصية موثوقية المعلومات المحاسبية عن طريق توافر بعض الخصائص الفرعية مثل التعبير الصادق والحياد والقابلية للتحقق",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 16
    {
      numb: 16,
      question:"يقصد بملائمة المعلومات المحاسبية ان تكون خالية من الاخطاء الجوهرية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 17
    {
      numb: 17,
      question:"يقصد بالتعبير الصادق للمعلومات المحاسبية اعتماد هذه المعلومات علي قواعد قياس موضوعية يمكن التحقق منها بواسطة أدلة ومستندات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 18
    {
      numb: 18,
      question:"تكون المعلومات المحاسبية ذات قيمة رقابية اذا ساعدت في تحسين قدرة متخذ القرار علي التنبؤ بالنتائج المتوقعة في المستقبل",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 19
    {
      numb: 19,
      question:"يوفر الثبات والاستمرار في استخدام نفس السياسات المحاسبية امكانية اجراء المقارنات بين نتائج الفترات المالية لنفس المنشأة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 20
    {
      numb: 20,
      question:"هدف النظام هو الذي يحدد طبيعة مكونات النظام واجراءات تحليله وتصميمه وتقييمه",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 21
    {
      numb: 21,
      question:"تعتبر حماية الاموال الوحدة الاقتصادية وممتلكاتها والرقابة عليها احد أهداف نظام المعلومات المحاسبي",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 22
    {
      numb: 22,
      question:"يمكن تصميم نظام محاسبي معياري يصلح للتطبيق في كافة الوحدات علي اختلاف أنواعها وانشتطها واحجامها",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 23
    {
      numb: 23,
      question:"النظام قد يشمل في داخله عدد من الانظمة الفرعية المكونة له, كما يعتبر في نفس الوقت نظاما فرعيا من نظام اخر اكثر شمولا",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 24
    {
      numb: 24,
      question:"فعالية النظام يقصد بها مدي تحقيق النظام للأهداف المحددة له",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 25
    {
      numb: 25,
      question:"فعالية النظام يقصد بها كافة استغلال الموارد المتاحة للنظام, بمعني تحقيق اهداف النظام وتوفير المخرجات المطلوبة منه باستخدام أقل قدر ممكن من المدخلات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 26
    {
      numb: 26,
      question:"تقسيم النظم من حيث طبيعتها الي نظم مفتوحة ونظم مغلقة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 27
    {
      numb: 27,
      question:"يمكن تقسيم النظم من حيث طبيعتها الي نظم طبيعية ونظم صناعية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 28
    {
      numb: 28,
      question:"يمكن تقسيم النظم من حيث علاقتها بالبيئة المحيطة الي نظم مفتوحة ونظم مغلقة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 29
    {
      numb: 29,
      question:"يمكن تقسيم النظم من حيث تركيبها الي نظم معقدة ونظم بسيطة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    // 30
    {
      numb: 30,
      question:"النظم الطبيعية هي نظم تعمل بصورة تلقائية ولا دخل للأنسان في وجودها أو تشغيلها",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },

     // 31
     {
      numb: 31,
      question:"تعتبر الشركات والمصانع والمستشفيات والمدارس من امثلة النظم الطبيعة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 32
     {
      numb: 32,
      question:"النظم المفتوحة هي نظم تستمد من البيئة مدخلات محددة وتمدها بمخرجات متجانسة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 33
     {
      numb: 33,
      question:"النظم المغلقة هي نظم تستمد من البيئة مدخلات معينة وتمدها بمخرجات مختلفة غير متجانسة من فترة لأخري",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 34
     {
      numb: 34,
      question:"النظم المعقدة تتكون من عدد كبير من النظم الفرعية التي تتشابك العلاقات فيما بينها",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 35
     {
      numb: 35,
      question:"النظم البسيطة لا تشتمل علي نظم فرعية أو يكون عدد النظم الفرعية بها قليل نسبيا",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 36
     {
      numb: 36,
      question:"يصنف المدخل التقليدي نظم المعلومات الي نظم معلومات محسابية ونظم معلومات أدارية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 37
     {
      numb: 37,
      question:"يختص نظام المعلومات المحاسبي بتشغيل بيانات الصفقات المالية مثل بيع وشراء البضاعة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 38
     {
      numb: 38,
      question:"يعتبر تسجيل البيانات صنف جديد في سجلات المخزون بالشركة ضمن الصفقات المالية التي يقوم نظام المعلومات المحاسبي بتوفير معلومات عنها",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 39
     {
      numb: 39,
      question:"وفقا للمدخل الحديث في تبويب نظم المعلومات , يعتبر نظام المعلومات المحاسبي بمكوناته نظاما فرعيا من نظم المعلومات الادارية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 40
     {
      numb: 40,
      question:"تستخدم نظم دعم القرار في اتخاذ القرارات الروتينية المتكررة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 41
     {
      numb: 41,
      question:"تستخدم نظم دعم القرار لأتخاذ القرارات شبه وغير الهيكلية التي تخدم الادارة الوسطي والعليا",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 42
     {
      numb: 42,
      question:"توفر نظم المعلومات الادارية المعلومات اللازمة لمساعدة الادارة في ممارسة وظائفها الاساسية مثل الانتاج , التسويق , الشراء , التخزين , ادارة الموارد البشرية , الادارة المالية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 43
     {
      numb: 43,
      question:"يقوم دليل الحسابات بتويب الحسابات في مجموعة متجانسة علي أساس هرمي",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 44
     {
      numb:44,
      question:"وفقا للدليل المحاسبي يبدأ ترميز حسابات الاصول برقم 2 من اليسار الي اليمين",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 45
     {
      numb: 45,
      question:"وفقا للدليل المحاسبي يبدأ ترميز حسابات الاصول برقم 3 من اليسار الي اليمين",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 46
     {
      numb: 46,
      question:"دليل الحسابات أكثر أهمية في نظم المعلومات المحاسبية الالكترونية عنه في النظم اليدوية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 47
     {
      numb: 47,
      question:"",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 31
     {
      numb: 31,
      question:"",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 31
     {
      numb: 31,
      question:"",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
     // 31
     {
      numb: 31,
      question:"",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },

    
  ];
  
  
  // Shuffle questions array
  questions.sort(function () {
    return 0.5 - Math.random();
  });
  
  // Select the first 30 questions
  // questions = questions.slice(0, 30);
  
