// creating an array and passing the number, questions, options, and answers
let questions = [

  // 1
  {
    numb: 1,
    question:"المراجعة بصفة عامة هي عملية منظمة يقوم بها المراجع لجمع وتقييم أدلة اثبات كافية وملائمة لإبداء رأية الفني المحايد بخصوص موضوع المراجعة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },

  {
    numb: 2,
    question:"المراجعة الالزامية هي المراجعة التي يحتم القانون القيام بها حيث يلتزم المشروع بضرورة تعيين مراجع داخلي لمراجعة حساباته واعتماد القوائم المالية الختامية له",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 3,
    question:"المراجعة الجزئية هي المراجعة التي تتضمن وضع بعض القيود على نطاق او مجال المراجعة بحيث يقتصر عمل المراجع على بعض العمليات دون غيرها",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 4,
    question:"وجود المراجعة الداخلية بشركات المساهمة يغني عن تكليف المراجع الخارجي بفحص ومراجعة حسابات الشركة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 5,
    question:"يمكن تصنيف المراجعة من حيث الهدف الى المراجعة المالية والمراجعة الاجتماعية والمراجعة الادارية والمراجعة البيئية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 6,
    question:"تهدف مراجعة الفعالية الى التحقق من أن النتائج المطلوبة أو المنافع المتوقعة من أداء النشاط أو الخدمة قد تحققت بأقل تكلفة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 7,
    question:"تهدف مراجعة الكفاءة الى التحقق من أن الوحدة الاقتصادية قد حصلت على الموارد بطريقة اقتصادية وأن استخدام هذة الموارد تم بكفاءة للحصول على أكبر قدر ممكن من المخرجات",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 8,
    question:"خدمات التاكيد هي خدمات مهنية مستقلة تهدف الى تحسين جودة المعلومات أو أسلوب عرضها وتقديمها للمستخدم ، ويقوم بها المراجع الداخلي المعين من جانب الادارة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 9,
    question:"الفرق الأساسي بين خدمات التاكيد وباقي أنواع الخدمات الاستشارية الأخرى كونها تهدف الى تحسين جودة المعلومات المالية وغير المالية التاريخية والمستقبلية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 10,
    question:"خدمات التصديق هي عبارة عن ارتباط يتعهد فية المراجع باصدار تقرير مكتوب يتضمن رأيه بخصوص بند معين يعتبر مسؤولية طرف آخر تعتبر خدمات التصديق أكثر شمولا واتساعا مقارنة بخدمة المراجعة التقليدية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 11,
    question:"خدمات الثقة في النظم الالكترونية يقوم بها المراجع من خلال تقييم مدى توافر معايير الثقة في النظم والتي تتمثل في سهولة التواصل مع النظام وسرية وأمن بياناتة وتكامل العمليات",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 12,
    question:"خدمات الثقة في المواقع الالكترونية يقوم بها المراجع من خلال تقييم مدى توافق خصائص ومكونات مواقع التجارة الالكترونية مع المعايير التي تتمثل في تكامل العمليات، الخصوصية، أمن وسرية البيانات",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 13,
    question:"خدمات الثقة في المواقع الالكترونية التي يقدمها المراجع لا تمثل بالضرورة ضمانا لأمان وسرية البيانات الشخصية للعملاء ومعاملاتهم المالية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 14,
    question:"خدمة المراجعة التقليدية كافية لتخفيض مخاطر المعلومات وتخفيض مخاطر الأعمال",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 15,
    question:"التطور الكبير في تكنولوجيا المعلومات والاتصالات وسهولة الدخول الى القواعد البيانات للشركات يفرض مسؤولية على مراجعة حسابات لتوفير تأكيدات بخصوص مدى إمكانية الاعتماد على هذه المعلومات",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 16,
    question:"في ظل استخدام الحاسب الإلكتروني فإن مسار المراجعة سوف يزول ولا يعد له وجود",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 17,
    question:"لا تؤثر الطريقة المتبعة في تجهيز البيانات سواء كانت يدوية أو آلية على تصميم المستندات، وبالتالي لا يوجد تغيير في أساليب المراجعة المستخدمة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 18,
    question:"يتأثر أسلوب المراجعة التقليدية نتيجة لتطبيق نظام التشغيل الإلكتروني للبيانات",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 19,
    question:"توفر خدمة المراجعة التقليدية تأكيدات بشأن المعلومات غير المالية والمعلومات المستقبلية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 20,
    question:"تعتبر خدمة تقييم مدى ملائمة مقاييس الأداء التي تستخدمها المنشأة أحد أنواع خدمات التصديق التي يوفرها المراجع",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 21,
    question:"تختلف أهداف مراجعة نظم المحاسبة الإلكترونية عنها في مراجعة نظم المحاسبة اليدوية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 22,
    question:"تتميز النظم الإلكترونية بصعوبة الغش والتلاعب في البيانات",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 23,
    question:"تعتمد دورة العمل في النظم الإلكترونية على مبدأ تقسيم العمل بين العاملين",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 24,
    question:"تتكون دورة عملية المراجعة من ثلاثة مراحل وهي تخطيط عملية المراجعة ، تنفيذ عملية المراجعة ، ثم إصدار تقرير المراجعة النهائي",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 25,
    question:"توجد ثلاث مداخل للمراجعة في ظل النظم الإلكترونية ، وهي المراجعة حول الحاسب الآلي، والمراجعة من خلال الحاسب الآلي والمراجعة باستخدام الحاسب الآلي",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 26,
    question:"يتم إجراء الاختبارات في المراجعة التقليدية بشكل متتابع، بينما في المراجعة المستمرة تتم بشكل متوازي",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 27,
    question:"تركز المراجعة المستمرة على اختبارات مدى الالتزام واختبارات التحقق من تفاصيل العمليات والأرصدة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 28,
    question:"تركز المراجعة المستمرة على المعاينة الإحصائية أي استخدام عينة من المجتمع محل الفحص ، بينما تعتمد المراجعة التقليدية على الفحص الشامل للمجتمع",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 29,
    question:"تعتبر المراجعة التقليدية مراجعة لاحقة ، بينما تعتبر المراجعة المستمرة مراجعة فورية لكل عملية على مدار السنة المالية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 30,
    question:"تتم المراجعة المستمرة بشكل إلكتروني بالكامل وتعمل بصورة أوتوماتيكية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 31,
    question:"لا يوجد فرق بين أساليب المراجعة وأدوات المراجعة المعتمدة على الحاسب الآلي",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 32,
    question:"لا يوجد فرق بين خطر المراجعة وخطر أعمال العميل",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb:33,
    question:"كلما زادات الأهمية النسبية لعنصر ما من عناصر القوائم المالية ، كلما احتاج المراجع إلى كمية أكبر ، أدلة الاثبات ، للتحقق من عدم وجود تحريفات جوهرية في قيمة هذا العنصر",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 34,
    question:"يستخدم تقدير الأهمية النسبية فقط في تخطيط عملية المراجعة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 35,
    question:"يوجد اختلاف بين أهداف اختبارات مدى الالتزام بالرقابة الداخلية للنظم اليدوية عن النظم الإلكترونية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 36,
    question:"لا تختلف الوسائل المستخدمة لتنفيذ اختبارات مدى الالتزام بالرقابة الداخلية في النظم الالكترونية عنها في النظم اليدوية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 37,
    question:"يعتمد تنفيذ اختبارات مدى الالتزام بالرقابة الداخلية على أسلوب المعاينة الاحصائية ، بينما يعتمد تنفيذ الاختبارات الأساسية على أسلوب الفحص الشامل",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 38,
    question:"تستخدم الاجراءات التحليلية فقط في تخطيط أعمال المراجعة",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 39,
    question:"لا تختلف أنواع التقارير التي يعدها المراجع عند مراجعة النظم اليدوية عنها عند مراجعة النظم الالكترونية",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 40,
    question:"خطر المراجعة = الخطر الملازم + خطر الرقابة الداخلية + خطر الاكتشاف",
    answer: "صح",
    options: [
      "صح",
      "خطأ",
      
    ],
  },
  {
    numb: 1,
    question:"تنقسم المراجعة من حيث الإلزام القانوني الى :",
    answer: "",
    options: [
      "المراجعة الالزامية والمراجعة الاختيارية",
      "المراجعة الكاملة والمراجعة الاختبارية",
      "المراجعة النهائية والمراجعة المستمرة",
      "كل ما سبق صحيح",
      
    ],
  },
  {
    numb: 2,
    question:"تنقسم المراجعة من حيث حجم الاختبارات التي يقوم بها المراجع الى :",
    answer: "",
    options: [
      "مراجعة شاملة تفصيلية ومراجعة اختبارية",
      "المراجعة الكاملة والمراجعة الاختبارية",
      "المراجعة النهائية والمراجعة المستمرة",
      "لا شئ مما سبق",
      
    ],
  },
  {
    numb: 3,
    question:"تصنف المراجعة من حيث القائم بممارستها والقيام بها الى :",
    answer: "",
    options: [
      "المراجعة الداخلية والمراجعة الخارجية",
      "المراجعة الكاملة والمراجعة الاختبارية",
      "كل ما سبق صحيح",
      "لا شئ مما سبق",
      
    ],
  },
  {
    numb: 4,
    question:"تهدف ........ الى إبداء رأي فني محايد عن مدى دلالة القوائم المالية الختامية عن حقيقة نتائج الاعمال والمركز المالي للمنشاة في نهاية الفترة المالية",
    answer: "",
    options: [
      "المراجعة المالية التقليدية",
      "المراجعة الإدارية",
      "المراجعة البيئية",
      "المراجعة الاجتماعية",
      
    ],
  },
  {
    numb: 5,
    question:"تهدف ....... الى التحقق من أن الوحدة الاقتصادية قد حصلت على الموارد النادرة بطريقة اقتصادية وان استخدام هذة الموارد قد تم بكفاءة للحصول على أكبر قدر ممكن من المخرجات",
    answer: "",
    options: [
      "مراجعة الكفاءة",
      "مراجعة الفعالية",
      "لاشئ مما سبق",
      " كل ما سبق",
      
    ],
  },
  {
    numb: 6,
    question:".....خدمات التأكيد هي خدمات مهنية مستقلة",
    answer: "",
    options: [
      "تهدف الى تحسين جودة المعلومات وأسلوب عرضها",
      "تعتمد على التقدير الشخصي للمراجع",
      "تعمل على تخفيض مخاطر المعلومات",
      "كل ما سبق صحيح",
      
    ],
  },
  {
    numb: 7,
    question:"يهدف تطوير خدمات التاكيد الى توسيع نطاق البنود التي يقوم المراجع بمنح تأكيد بشأنها لتشمل",
    answer: "",
    options: [
      "المعلومات المستقبلية",
      "المعلومات غير المالية",
      "تقييم كفاءة النظم والعمليات",
      "كل ما سبق",
      
    ],
  },
  {
    numb: 8,
    question:"تشتمل خدمات التاكيد بمفهومها الواسع ثلاثة أنواع رئيسية :",
    answer: "",
    options: [
      "الرقابة الداخلية وتنبؤات الادارة ومراجعة الالتزام",
      "المراجعة المالية وخدمات التصديق",
      "خدمات تقييم المخاطر وملائمة مقاييس الاداء",
      "ب ، ج معا",
      
    ],
  },
  {
    numb: 9,
    question:"تشتمل خدمات التصديق مجموعة من الخدمات اهمها :",
    answer: "",
    options: [
      "التصديق على فعالية هيكل الرقابة الداخلية وتنبؤات الادارة ومراجعة الالتزام",
      "المراجعة المالية وخدمات التصديق وخدمات تقييم المخاطر",
      "لاشئ مما سبق",
      "ا ، ب معا",
      
      
    ],
  },
  {
    numb: 10,
    question:"خدمات الثقة في النظم الالكترونية يقوم بها المراجع من خلال تقييم مدى توافر معايير الثقة في النظم مثل",
    answer: "",
    options: [
      "سهولة التواصل مع النظام",
      "سرية وأمن البيانات",
      "تكامل العمليات",
      "كل ما سبق",
      
    ],
  },
  {
    numb: 11,
    question:"مخاطر الاعمال هي المخاطر المرتبطة بـ :",
    answer: "",
    options: [
      "طبيعة نشاط المنشاة وظروف الصناعة وطبيعة البيئة الاقتصادية السائدة",
      "تنشأ نتيجة احتمال ان تكون المعلومات المستخدمة غير دقيقة",
      "تتضمن احتمال ان تكون القوائم المالية تحوي أخطاء أو انحرافات جوهرية",
      "كل ما سبق",
      
    ],
  },
  {
    numb: 12,
    question:"مخاطر المعلومات هي المخاطر المرتبطة بـ :",
    answer: "",
    options: [
      "طبيعة نشاط المنشاة وظروف الصناعة وطبيعة البيئة الاقتصادية السائدة",
      "تنشأ نتيجة احتمال ان تكون المعلومات المستخدمة غير دقيقة",
      "ب ، ج معا",
      
    ],
  },
  {
    numb: 13,
    question:"من اهم الاسباب التي ادت الى ظهور انواع مختلفة من خدمات التاكيد بجانب المراجعة التقليدية",
    answer: "",
    options: [
      "زيادة حدة المنافسة",
      "زيادة الافصاح الاختياري عن المعلومات غير المالية",
      "حدوث تغيير في أساليب جمع وتخزين وعرض البيانات والحصول عليها",
      "كل ما سبق صحيح",
      
    ],
  },
  {
    numb: 14,
    question:"المراجعة الكاملة:",
    answer: "",
    options: [
      "يقصد بها مراجعة كل تفاصيل كل العمليات",
      "يقصد بها مراجعة بعض تفاصيل كل العمليات",
      "تعنى المراجعة الكاملة مراجعة كل تفاصيل بعض العمليات",
      "المراجعة الكاملة لا تعنى مراجعة كل تفاصيل كل العمليات",
      
    ],
  },
  {
    numb: 15,
    question:"المراجعة الإدارية:",
    answer: "",
    options: [
      "تقيم مدى التزام الشركة بأداء مسئولياتها تجاه المجتمع",
      "تهتم بكفاءة الأداء وفعاليته",
      "تتضمن مراجعة معلومات التلوث والمؤثرات البيئية",
      "تقيم مدى التزام الشركة بالقوانين واللوائح والتعليمات",
      
    ],
  },
  {
    numb: 16,
    question:"يقصد بفقدان التوثيق :",
    answer: "",
    options: [
      "اختفاء مسار المراجعة ",
      "سهولة الغش والتلاعب",
      "عدم وجود مستندات مؤيدة للعمليات المالية",
      "كل ما سبق",
      
    ],
  },
  {
    numb: 17,
    question:"معيار التأهيل العملي والعلمي للمراجع يعتبر من معايير :",
    answer: "",
    options: [
      "عداد التقرير",
      "معايير العمل الميداني",
      "المعايير العامة",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 18,
    question:" معيار استقلال المراجع يعتبر من معايير :",
    answer: "",
    options: [
      "عداد التقرير",
      "بمعايير العمل الميداني",
      "المعايير العامة",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 19,
    question:"معيار جمع أدلة الإثبات يعتبر من معايير :",
    answer: "",
    options: [
      "اعداد التقرير",
      "معايير العمل الميداني",
      "المعايير العامة ",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 21,
    question:"معيار التخطيط السليم لأعمال المراجعة يعتبر من معايير :",
    answer: "",
    options: [
      "اعداد التقرير",
      "معايير العمل الميداني",
      "المعايير العامة ",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 22,
    question:"معيار الافصاح الكافي يعتبر من معايير :",
    answer: "",
    options: [
      "أعداد التقرير",
      "معايير العمل الميداني",
      "المعايير العامة",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 23,
    question:"معيار جمع أدلة الإثبات يعتبر من معايير :",
    answer: "",
    options: [
      "اعداد التقرير",
      "معايير العمل الميداني",
      "المعايير العامة",
      "المعايير الشخصية",
      
    ],
  },
  {
    numb: 24,
    question:"أولى مراحل وإجراءات المراجعة الإلكترونية :",
    answer: "",
    options: [
      "مرحلة تخطيط عملية المراجعة",
      "مرحلة القيام باختبارات المراجعة",
      "مرحلة قبول التعاقد",
      "مرحلة اعداد التقرير",
      
    ],
  },
  {
    numb: 25,
    question:"أخر مرحلة من مراحل وإجراءات المراجعة الإلكترونية :",
    answer: "",
    options: [
      "مرحلة تخطيط عملية المراجعة",
      "بمرحلة قبول التعاقد",
      "مرحلة القيام باختبارات المراجعة",
      "مرحلة اعداد التقارير",
      
    ],
  },
  {
    numb: 26,
    question:"المراجعة حول الحاسب تعنى :",
    answer: "",
    options: [
      "استخدام الحاسب في أعمال المراجعة",
      "عدم استخدام الحاسب في أعمال المراجعة",
      "قيام المراجع بالتحقق من صحة البرامج المستخدمة في التشغيل ، وصحة النظم الرقابية المرتبطة بعمليات التشغيل",
      "اعتماد المراجع على استخدام الحاسب الآلي وبرامجه كأداة من أدوات عملية المراجعة",
      
    ],
  },
  {
    numb: 27,
    question:"المراجعة من خلال الحاسب تعنى :",
    answer: "",
    options: [
      "استخدام الحاسب في أعمال المراجعة",
      "عدم استخدام الحاسب في أعمال المراجعة",
      "قيام المراجع بالتحقق من صحة البرامج المستخدمة في التشغيل ، وصحة النظم الرقابية المرتبطة بعمليات التشغيل",
      "اعتماد المراجع على استخدام الحاسب الآلي وبرامجه كأداة من أدوات عملية المراجعة",
      
    ],
  },
  {
    numb: 28,
    question:"المراجعة باستخدام الحاسب تعنى :",
    answer: "",
    options: [
      "استخدام الحاسب في أعمال المراجعة",
      "عدم استخدام الحاسب في أعمال المراجعة",
      "قيام المراجع بالتحقق من صحة البرامج المستخدمة في التشغيل ، وصحة النظم الرقابية المرتبطة بعمليات التشغيل",
      "اعتماد المراجع على استخدام الحاسب الآلي وبرامجه كأداة من أدوات عملية المراجعة",
      
    ],
  },
  {
    numb: 29,
    question:"يؤدى إلى نتائج غير كاملة لعملية المراجعة ، حيث أنه يركز بشكل أكبر على فحص ومراجعة عمليات التشغيل ، ويعطى تركيز أقل لمراجعة المدخلات والمخرجات",
    answer: "",
    options: [
      " مدخل المراجعة حول الحاسب",
      " مدخل المراجعة باستخدام الحاسب",
      " مدخل المراجعة من خلال الحاسب",
      " جميع ما سبق",
      
    ],
  },
  {
    numb: 30,
    question:"لا يقدم ...... تأكيدات فورية على المعلومات المحاسبية ، كما لا يوفر تأكيداً على سلامة عمليات النظام الداخلية",
    answer: "",
    options: [
      "مدخل المراجعة حول الحاسب",
      "مدخل المراجعة من خلال الحاسب",
      "مدخل المراجعة باستخدام الحاسب",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 31,
    question:"من الأساليب المساعدة في تحليل برامج العميل :",
    answer: "",
    options: [
      "أسلوب خرائط التدفق",
      "أسلوب المحاكاة المتوازية",
      "أسلوب البيانات الاختبارية",
      "أسلوب التنقيب في البيانات",
      
    ],
  },
  {
    numb: 32,
    question:"تستخدم جميع الأساليب التالية في إجراء اختبارات المراجعة الدورية ، ما عدا",
    answer: "",
    options: [
      "أسلوب خرائط التدفق",
      "أسلوب البيانات الاختبارية",
      "أسلوب المحاكاة المتوازية  ",
      "أسلوب التنقيب في البيانات",
      
    ],
  },
  {
    numb: 33,
    question:"من معوقات استخدام تكنولوجيا المعلومات في المراجعة :",
    answer: "",
    options: [
      "تكاليف تبنى واستخدام تكنولوجيا المعلومات",
      "المخاطر الملازمة لاستخدام تكنولوجيا المعلومات",
      "التأهيل غير الكافي لمراجعي الحسابات",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 34,
    question:"يعتمد على تشغيل بيانات فعلية للمنشأة باستخدام برامج اختبارية",
    answer: "",
    options: [
      "أسلوب البيانات الاختبارية",
      "أسلوب التشغيل تحت رقابة المراجع",
      "أسلوب المحاكاة المتوازية",
      "أسلوب التنقيب في البيانات",
      
    ],
  },
  {
    numb: 35,
    question:"يعتمد على تشغيل بيانات اختبارية باستخدام البرامج الحقيقية للمنشأة",
    answer: "",
    options: [
      "أسلوب التشغيل تحت رقابة المراجع",
      "أسلوب البيانات الاختبارية",
      "أسلوب المحاكاة المتوازية",
      "أسلوب التنقيب في البيانات",
      
    ],
  },
  {
    numb: 36,
    question:"يعتمد على تشغيل البيانات الفعلية باستخدام البرامج الحقيقية للمنشأة",
    answer: "",
    options: [
      "أسلوب البيانات الاختبارية",
      "أسلوب التشغيل تحت رقابة المراجع",
      " أسلوب المحاكاة المتوازية",
      " أسلوب التنقيب في البيانات",
      
    ],
  },
  {
    numb: 37,
    question:"يستخدم في تحديد البنود عالية المخاطر ويساعد في اكتشاف الغش",
    answer: "",
    options: [
      "أسلوب البيانات الاختبارية",
      "أسلوب التشغيل تحت رقابة المراجع",
      "أسلوب المحاكاة المتوازية",
      "أسلوب التنقيب في البيانات",
      
    ],
  },
  {
    numb: 38,
    question:"يستخدم أسلوب مراجعة ملف الرقابة على النظام في :",
    answer: "",
    options: [
      " تنفيذ اختبارات المراجعة المستمرة",
      "  اجراء اختبارات المراجعة الدورية",
      " تحليل برامج العميل",
      " جميع ما سبق",
      
    ],
  },
  {
    numb: 39,
    question:"تعتبر برامج الجداول الالكترونية وبرامج ادارة قواعد البيانات من :",
    answer: "",
    options: [
      "البرامج المتخصصة في المراجعة",
      "البرامج والأدوات المساعدة في المراجعة",
      "جميع ما سبق",
      "لا شئ مما سبق",
      
    ],
  },
  {
    numb: 40,
    question:"هي البرامج التي تستخدم في توثيق أعمال المراجعة ، وحفظ المراسلات والملاحظات وتقارير الفحص السابقة",
    answer: "",
    options: [
      "برامج المراجعة العامة",
      "البرامج الإلكترونية لأوراق عمل المراجعة",
      "برامج تخطيط عملية المراجعة",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 41,
    question:"هي البرامج التي تستخدم في وضع خطط وبرامج المراجعة ، وتوزيع مهام عمليةالمراجعة على فريق العمل وتخطيط العمل في منشآت المراجعة الكبرى",
    answer: "",
    options: [
      "برامج المراجعة العامة",
      "البرامج الإلكترونية لأوراق عمل المراجعة",
      "برامج تخطيط عملية المراجعة",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 42,
    question:"تشمل مرحلة قبول التعاقد على أداء عملية المراجعة :",
    answer: "",
    options: [
      " أتقييم نزاهة إدارة منشأة العميل محل المراجعة",
      "تقييم مخاطر الارتباط بعميل المراجعة",
      "تقييم مدى توافر الكفاءة الفنية لأداء عملية المراجعة",
      "جميع ماسبق",
      
    ],
  },
  {
    numb: 43,
    question:"تشمل عملية التخطيط للمراجعة :",
    answer: "",
    options: [
      " وضع حدود الأهمية النسبية وتقدير خطر المراجعة",
      " تفهم ودراسة نظام الرقابة الداخلية ، وتقدير خطر الرقابة",
      "تقدير مخاطر الغش",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 44,
    question:"من المؤشرات التي تدل على عدم نزاهة إدارة منشأة عميل المراجعة :",
    answer: "",
    options: [
      "استقالة أحد أعضاء مجلس الإدارة أو المسئولين عن الحوكمة دون سبب معروف",
      "وجود هيكل تنظيمي معقد وغير واضح ، و وجود صفقات كبيرة في نهاية السنة المالية",
      " معدل دوران مرتفع للمسئولين عن المراكز الرئيسية",
      " جميع ماسبق",
      
    ],
  },
  {
    numb: 45,
    question:"من المؤشرات التي تستخدم في تقييم مخاطر عميل المراجعة :",
    answer: "",
    options: [
      " طبيعة نشاط المنشأة محل المراجعة",
      " طبيعة النظم الإلكترونية للمنشأة محل المراجعة",
      " سياسات وقواعد وإجراءات حوكمة تكنولوجيا المعومات ، وأمن المعلومات للمنشاة محل المراجعة  ",
      " جميع ما سبق",
      
    ],
  },
  {
    numb: 46,
    question:"من العناصر التي يجب تحديدها والاتفاق عليها مع الادارة فى حالة قبول عملية المراجعة :",
    answer: "",
    options: [
      "تحديد الهدف من مراجعة القوائم المالية",
      "بتحديد واضح للقوائم المالية محل المراجعة ، ومسئولية الإدارة عن إعدادها",
      " تحديد نطاق المراجعة",
      " جميع ما سبق",
      
    ],
  },
  {
    numb: 47,
    question:"تستخدم إجراءات الفحص التحليلي في :",
    answer: "",
    options: [
      "تخطيط أعمال المراجعة ",
      "تفهم طبيعة نشاط العميل ",
      "تقدير خطر الغش",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 48,
    question:"من الأدوات التي يتم الاعتماد عليها في إجراء الفحص التحليلي :",
    answer: "",
    options: [
      "التحليل الأفقي للقوائم المالية",
      " التحليل الرأسي للقوائم المالية",
      "حساب الأهمية النسبية لبنود القوائم المالية",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 49,
    question:"اذا حدد المراجع مستوى الخطر المقبول للمراجعة عند 5% ، وحدد من خلال فحص نظام الرقابة الداخلية مستوى خطر الرقابة %60 ثم حدد مستوى الخطر الحتمي عند 80% ، فإن خطر الاكتشاف",
    answer: "",
    options: [
      "%10",
      "12%",
      "15%",
      "لا شئ مما سبق",
      
    ],
  },
  {
    numb: 50,
    question:"اذا كان خطر الاكتشاف المخطط قد تم تقديره بدرجة مرتفعة ، فإن المراجع يمكنه أن :",
    answer: "",
    options: [
      "يختار عينات فحص صغيرة الحجم",
      "يستطيع تأدية إجراءات المراجعة خلال السنة دون انتظار إعداد القوائم المالية",
      "يستطيع المراجع اختيار إجراءات مراجعة توفر أدلة الاثبات ذات حجية أقل تكاليف منخفضة",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 51,
    question:"الخطر الذى يستطيع المراجع التحكم فيه هو :",
    answer: "",
    options: [
      "الخطر الحتمي ",
      "خطر الرقابة",
      "خطر الاكتشاف",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 52,
    question:"........ هو الخطر الذى يرتبط بطبيعة نشاط المنشأة ، ولا يستطيع المراجع التحكم فيه :",
    answer: "",
    options: [
      "الخطر الحتمي ",
      "خطر الرقابة",
      "خطر الاكتشاف",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 53,
    question:"تشمل الرقابة الداخلية ، الرقابة على :..........",
    answer: "",
    options: [
      "المدخلات",
      "عمليات تشغيل البيانات",
      "المخرجات",
      "جميع ما سبق",
      
    ],
  },
  {
    numb: 54,
    question:"تشمل اختبارات المراجعة الأساسية :",
    answer: "",
    options: [
      "اجراءات الفحص التحليلي",
      "اختبارات التحقق من فعالية نظم الرقابة الداخلية",
      "اختبارات تفاصيل العمليات والأرصدة",
      "ب ، ج معا .",
      
    ],
  },
  {
    numb:55,
    question:"تطبق اختبارات تفاصيل العمليات والأرصدة على :",
    answer: "",
    options: [
      "قائمة الدخل",
      "قائمة المركز المالي",
      "القوائم المالية الأخرى",
      "جميع ما سبق",
      
    ],
  },

];


// Shuffle questions array
questions.sort(function () {
  return 0.5 - Math.random();
});

// Select the first 30 questions
// questions = questions.slice(0, 50);

