
// creating an array and passing the number, questions, options, and answers
let questions = [
  // SHEET(1)

  // 1
  {
    numb: 1,
    question: "امن المعلومات هو حماية المعلومات لمنع وصول الاشخاص الغير مسموح لهم الوصول للمعلومات",
    options: [
      "صح",
      "خطأ",
    
    ]
  },

// 2
  {
  numb: 2,
  question:"المعلومات او البيانات السرية الخاصة بالافراد او الشركات او المنظمات هي المعلومات المراد حمايتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 3
  {
  numb: 3,
  question:"امن الاتصالات طبقا لتعريف وكالة الامن القومي الامريكي هو المعايير و الاجراءت المتخذه لمنع وصول المعلومات الي اي اشخاص غير مخونين عبر الاتصالات لضمان اصالة وصحة هذه الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb: 4,
  question:"يحتاج الامن الفيزيائي الي مراقبة باستخدام الكاميرات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 5
{
  numb: 5,
  question:"يشمل الامن الفيزيائي حماية المكونات المادية لأجهزة الاتصالات ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 6
{
  numb: 6,
  question:"عند الاختراق احد الاجهزة التي تحتوي علي بيانات هامه فيمكن اصدار اشاره مضاده للأشارات الغربية داخل الجهاز",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 7
{
  numb: 7,
  question:"تقوم الاشارات المضادة بمحو الاشارات الغريبه او اضعافها بحيث ينعدم تأثيرها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 8
{
  numb: 8,
  question:"يعتبر اجهزة الانذار من السرقة والموجودة في الاماكن المختلفة مثال علي الامن الفيزيائي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 9
{
  numb: 9,
  question:"تعتبر انظمة توفير الطاقة المستخدمة في المنازل الذكية مثال علي الامن الفيزيائي و صيانة الاجهزة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 10
{
  numb: 10,
  question:"يمكن استخدام الاجهزة الذكية في تحقيق الامن الفيزيائي وامن المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 11
{
  numb: 11,
  question:"يعتبر(Smart Home) تطبيقا علي الامن الفيزيائي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 1
{
  numb: 12,
  question:"من امثلة البيانات المراد حمايتها مايلي.......",
  answer:"كل ماسبق",
  options: [
    "حسابات العملاء في البنوك",
    "نتائج الطلاب",
    "البيانات العسكرية",
    "كل ماسبق",
  
  ]
},
// 2
{
  numb: 13,
  question:"تشمل النشاطات المحددة لأمن الاتصالات مايلي......",
  answer:"كل ماسبق",
  options: [
    "امن التشفير",
    "امن النقل",
    "امن الفيزيائي",
    "كل ماسبق",
  
  ]
},
// 3
{
  numb: 14,
  question:"تشمل النشاطات المحددة لأمن الاتصالات مايلي......",
  answer:"كل ماسبق",
  options: [
    "امن الشعاع",
    "امن الفيزيائي",
    "كل ماسبق",
    "لا شئ مماسبق",
  
  ]
},
// 4
{
  numb: 15,
  question:"يشمل الامن السحابي الحسابيه مايلي.......",
  answer:"كل ماسبق",
  options: [
    "امن النقل",
    "امن الفيزيائي",
    "امن التشفير",
    "كل ماسبق",
  
  ]
},
// 5
{
  numb: 16,
  question:"من انواع الامن الفيزيائي او الطرق المستخدمة فس الامن الفيزيائي مايلي......",
  answer:"كل ماسبق",
  options: [
    "المراقبة بالكاميرات",
    "افراد الامن ",
    "حساسات الحريق",
    "كل ماسبق",
  
  ]
},
// 6
{
  numb: 17,
  question:"من الطرق المستخدمة في حماية الاشارات مايلي......",
  answer:"كل ماسبق",
  options: [
    "jamming",
    "Anti-jamming",
    "كل ماسبق",
    "لا شئ مماسبق",
  
  ]
},

// SHEET(2)
// 1
{
  numb: 18,
  question:"يعتبر التحقق من الهوية احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 2
{
  numb: 19,
  question:"تعتبر خاصية الكمال من احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 3
{
  numb: 20,
  question:"يعتبر التوفر احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb: 21,
  question:"تعتبر مسؤلية مكافحة الانكار احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 5
{
  numb: 22,
  question:"السرية هي التأكد بأن المعلومات لم يتصل لأشخاص او اجهزة غير مخونين للحصول علي هذه المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 6
{
  numb: 23,
  question:"المقصود بالكمال هو وصول البيانات من المرسل الي المستقبل كما هي تماما دون اي فقد او تغيير",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 7
{
  numb: 24,
  question:"يعكس خاصية الكمال جوده نظم المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 8
{
  numb: 25,
  question:"تؤثر خاصية الكمال مدي صحة موثوقية البيانات داخل نظام المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 9
{
  numb: 26,
  question:"يجب ان يكون هناك ضمان بان تحقيق الاتصال بين طرفين لا يؤثر سلبا علي الطرف الثالث",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 10
{
  numb: 27,
  question:"امن الحاسب هو المعايير والاجراءت التي تضمن سرية وكمال وتوفر مكونات أنظمة المعلومات بما في ذلك المكونات والبرمجيات والمعلومات والبيانات التي يتم معالجتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 1
{
  numb: 28,
  question:"من خصائص امن الاتصالات مايلي.......",
  answer:"السريه",
  options: [
    "السريه",
    "اجهزة الحاسب الالي",
    "الشبكات",
    "قواعد البيانات",
  
  ]
},
// 2
{
  numb: 29,
  question:"خصائص امن الاتصالات مايلي.....",
  answer:"كل ماسبق",
  options: [
    "مكافحة الانكار",
    "الكمال",
    "التوافر",
    "كل ماسبق",
  
  ]
},
// 3
{
  numb: 30,
  question:"السرية هي الحماية من......المعلومات",
  answer:"لاشئ مماسبق",
  options: [
    "التشفير",
    "افشاء",
    "المعالجة",
    "لاشئ مماسبق",
  
  ]
},
// 4
{
  numb: 31,
  question:"يعتبر.....التحقق من الهوية اجراء امني للتأكد من صلاحية",
  answer:"كل ماسبق",
  options: [
    "الاتصال",
    "المصدر",
    "الرساله",
    "كل ماسبق",
  
  ]
},
// 5
{
  numb: 32,
  question:".....هو وصول البيانات من المرسل الي المستقبل كما هي تماما دون فقد او تغيير",
  answer:"الكمال",
  options: [
    "الكمال",
    "السريه",
    "مكافحة الانكار",
    "التوفر",
  
  ]
},
// 6
{
  numb: 33,
  question:".......هو الوصول الموثوق الي البيانات والمعلومات عند الحاجة اليها من قبل الاشخاص المخونين لذلك",
  answer:"التوفر",
  options: [
    "التوفر",
    "الكمال",
    "التحقق من الهويه",
    "مكافحة الانكار",
  
  ]
},
// 7
{
  numb: 34,
  question:"....هو التأكيد بأن مرسل البيانات قد حصل علي أثبات بوصول البيانات الي المرسل اليه وبما ان المستقبل قد حصل اثبات لشخصية المرسل ممايمنع انكار اي من الطرفين بانه قد تعاملا مع هذه البيانات",
  answer:"مكافحة الانكار",
  options: [
    "السريه",
    "التوفر",
    "مكافحة الانكار",
    "لا شئ مماسبق",
  
  ]
},
// 8
{
  numb: 35,
  question:"يتضمن مفهوم امن انظمة المعلومات",
  answer:"كل ماسبق",
  options: [
    "السريه",
    "الكمال",
    "التحقق من الهوية",
    "كل ماسبق",
  
  ]
},
// 9
{
  numb: 36,
  question:"يتضمن مفهوم امن انظمة المعلومات",
  answer:"كل ماسبق",
  options: [
    "التوفر",
    "مكافحة الانكار",
    "كل ماسبق",
    "لا شئ مماسبق",
  
  ]
},
// 10
{
  numb: 37,
  question:"يشمل امن نظام المعلومات مايلي......",
  answer:"كل ماسبق",
  options: [
    "الاتصالات",
    "امن الحاسب",
    "امن شبكات الحاسب",
    "كل ماسبق",
  
  ]
},
// 11
{
  numb: 38,
  question:"من انظمة المعلومات هو......",
  answer:"information system security",
  options: [
    "information system security",
    "information smart security",
    "intelligent system security",
    "كل ماسبق",
  
  ]
},

//SHEET(3)

// 1
{
  numb: 39,
  question:"يجب ان تحدد المؤسسات بالتفصيل الموظفين الذين يحق لهم الوصول الي كل نوع من انواع  الخدمة التي تقدمها الانترنت",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 2
{
  numb: 40,
  question:"يجب علي الشركات تحديد صلاحيات كل موظف داخل الشركة وانشاء حساب خاص لكل واحد منهم",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 3
{
  numb: 41,
  question:"يجب تحديد المجالات التي ستتفق فيها اموال المؤسسة للحفاظ علي امن معلوماتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb: 42,
  question:"قد يكون من المفيد ان تقوم الشركة بتوظيف مستشار من الحاسب الالي وذلك بضمان امن معلوماتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 5
{
  numb:43,
  question:"من السياسات الامنية التي يجب ان تقوم الشركة هي وضع اجهزة التحقق من بصمة الشخص علي اجهزة البيانات المهمة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 7
{
  numb:44,
  question:"يجب ان تركز الشركات علي وجود سياسة امنية شاملة وتطوير السياسة الامنية الحالية بحيث تأخذ في الاعتبار الربط مع......",
  answer:"الانترنت",
  options: [
    "حول العالم",
    "الانترنت",
    "الحكومات",
    "لا شئ مماسبق",
  
  ]
},
// 8
{
  numb:45,
  question:"يجب تحديد الاجراءت التي ستقوم بها المؤسسة في الحالات حدوث.....للخطة الامنية الخاصة بها",
  answer:"اختراق",
  options: [
    "شراء",
    "انفاق",
    "اختراق",
    "كل ماسبق",
  
  ]
},
// 9
{
  numb:46,
  question:"يجب اجراء تقويم للعمليات الامنية علي فترات زمنية محددة",
  answer:"كل ماسبق",
  options: [
    "التحقق من المستخدم",
    "برامج الجدران النارية",
    "التشفير",
    "كل ماسبق",
  
  ]
},
// 10
{
  numb:47,
  question:"من السياسات الامنية التي تقوم بها الشركة مايلي.....",
  answer:"كل ماسبق",
  options: [
    "استخدام الجهاز الخاص بالشركة والانترنت فقط",
    "مسح حساب الخاص بالموظف منتهي العقد",
    "وضع حساسات المياه في كل اجهزة تخزين البيانات",
    "كل ماسبق",
  
  ]
},
// 11
{
  numb:48,
  question:"من السياسات الامنية التي تقوم بها الشركة مايلي....",
  answer:"كل ماسبق",
  options: [
    "عدم تبادل الرسائل الخاصة داخل الشركة",
    "تحديد صلاحيات كل مستخدم علي البيانات الموجودة في قاعدة البيانات",
    "الدخول للشركة عن طريق البطاقة الخاصة بكل موظف",
    "كل ماسبق",
  
  ]
},

// SHEET(4)
// 1
{
  numb:49,
  question:"هجوم الأيقاف هو تقنية رفض الخدمة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 2
{
  numb:50,
  question:"يعتبر أرسال العديد من الرسائل المتتالية الي صندوق البريد لأحد الأشخاص ملئ السعه التخزينية لهذا الصندوق مثالا علي هجوم الايقاف",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 3
{
  numb:51,
  question:"عندما يتدخل المهاجم بين المرسل والمستقبل ويقوم بتغيير محتوي الرسالة من ثم لأرسالها الي المستقبل بهجوم التعديل في محتوي الرسالة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb:52,
  question:"عندما يرسل المهاجم رسالة تفيد بأنه صديق الضحية ويطلب منه معلومات سرية خاصه بالشركلا فأن ذلك يسمي بالهجوم المزور",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 1
{
  numb:53,
  question:"من انواع الهجوم......",
  answer:"كل ماسبق",
  options: [
    "هجوم التصنت علي الرسائل",
    "هجوم الايقاف",
    "هجوم التعديل في محتوي الرسائل",
    "كل ماسبق",
  
  ]
},
// 2
{
  numb:54,
  question:"من انواع الهجوم......",
  answer:"كل ماسبق",
  options: [
    "هجوم التصنت علي الرسائل",
    "هجوم الايقاف",
    "هجوم المزور",
    "كل ماسبق",
  
  ]
},
// 3
{
  numb:55,
  question:"عندما يقوم المهاجم بمراقبة الاتصال بين المرسل والمستقبل للحصول علي المعلومات السرية فأن ذلك يسمي......",
  answer: "هجوم التصنت علي الرسائل",
  options: [
    "هجوم التصنت علي الرسائل",
    "هجوم الايقاف",
    "هجوم التعديل في محتوي الرسائل",
    "لا شئ مما سبق",
  
  ]
},
// 4
{
  numb:56,
  question:"عندما يقوم المهاجم بقطع قناة الاتصال لأيقاف الرسائل ومنعها من الوصول الي المستقبل يسمي......",
  answer:"هجوم الايقاف",
  options: [
    "هجوم التصنت علي الرسائل",
    "هجوم الايقاف",
    "هجوم التعديل في محتوي الرسائل",
    "لا شئ مما سبق",
  
  ]
},

// 5
{
  numb:57,
  question:"هجوم التصنت علي الرسائل يسمي......",
  answer:"Interception Attacks",
  options: [
    "Interception Attacks",
    "Interruption Attacks",
    "Modification Attacks",
    "fabrication Attacks",
  
  ]
},
// 6
{
  numb:58,
  question:"هجوم الايقاف يسمي.....",
  answer:"Interruption Attacks",
  options: [
    "Interception Attacks",
    "Interruption Attacks",
    "Modification Attacks",
    "fabrication Attacks",
  
  ]
},
// 7
{
  numb:59,
  question:"هجوم التعديل في محتوي الرسائل يسمي.....",
  answer:"Modification Attacks",
  options: [
    "Interception Attacks",
    "Interruption Attacks",
    "Modification Attacks",
    "fabrication Attacks",
  
  ]
},
// 8
{
  numb:60,
  question:"هجوم المزور يسمي......",
  answer:"fabrication Attacks",
  options: [
    "Interception Attacks",
    "Interruption Attacks",
    "Modification Attacks",
    "fabrication Attacks",
  
  ]
},

// SHEET(5)

// 1
{
  numb:61,
  question:"الخطر هو أنه يوجد علي الارجح تهديد يمكن استغلاله",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 2
{
  numb:62,
  question:"الثغرة اذا تم استغلال تهديد فأن ذلك يسمي بالثغرة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 3
{
  numb:63,
  question:"التهديد هو عملية المحاولة الي الوصول الي المعلومات السرية الخاصة بالشركة او المنظمة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 4
{
  numb:64,
  question:"الثغرات هو أنه يوجد نقطة ضعف او اكثر في نظام الحماية ويستطيع المهاجم الدخول الي نظام من خلالها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 5
{
  numb:65,
  question:"الثغرات التقنية تحدث اذا كان التحصين ضعيفا وتم استغلال هذا الضعف من المهاجم",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 6
{
  numb:66,
  question:"من امثلة التحصين الضعيف عدم وجود برامج مضادة للفيروسات علي اجهزة الحاسب الالي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 7
{
  numb:67,
  question:"من امثلة الهجوم غير تقني عندما يقوم شخص بالاتصال علي مدير نظام ويدعي بأنه رئيس القسم وأنه نسي كلمة السر الخاصة به ويطلب من مدير نظام أرسال كلمة السر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 8
{
  numb:68,
  question:"تكون التحصينات الضعيفة سهلة الاستغلال حيث يمكن كتابة كود برمجي لأستغلال الثغرة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 9
{
  numb:69,
  question:"التحصينات القوية صعبة الأختراق وتتطلب وقت طويل علي المهاجم حتي يتمكن من اختراقها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 10
{
  numb:70,
  question:"الهدف هو المعلومات الخاصة بالمنظمة المستهدفة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 12
{
  numb:71,
  question:"يمكن للمهاجم التأثير علي سلامة المعلومات حيث يمكن تغيير المعلومات الخاصة بالمنظمة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 11
{
  numb:72,
  question:"يمكن للمهاجم اختراق الخصوصية وذلك عن طريق الحصول علي المعلومات السرية للأخرين",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 13
{
  numb:73,
  question:"يمكن للمهاجم التأثير علي التواجد وذلك من خلال رفض الخدمة وقطعها عن المستخدم",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 14
{
  numb:74,
  question:"قابلية حسابات المهاجم مهمته اخفاء الكود لكي لا يحاسب المهاجم",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 15
{
  numb:75,
  question:"يعتبر اخفاء الاثر من اصعب الاعمال التي يقوم بها المهاجم",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 16
{
  numb:76,
  question:"من امثلة اخفاء المهاجم قيام المهاجم بتغيير كل سجلات الاحداث",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 17
{
  numb:77,
  question:"يلجأ المهاجم الي تغيير رقم IP وذلك بأخفاء الأثر عند اختراق احد الاجهزة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 18
{
  numb:78,
  question:"في حالة الوصول المباشر فأن المهاجم يكون له حساب علي نظام",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 19
{
  numb:79,
  question:"في حالة الوصول الغير مباشر يقوم المهاجم بالوصول من خلال وسيط",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 20
{
  numb:80,
  question:"تكون الاحداث بطرق عديدة من اهمها اساءة الدخول المخول او غير المخول لنظام المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 21
{
  numb:81,
  question:"تكون اساءة الدخول بوضع الاكواد خبيثة في المنظمة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 22
{
  numb:82,
  question:"اذا كان هناك ثغرة امنية في الانظمة فأنها تمثل تهديد",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 23
{
  numb:83,
  question:"عملية redirect هي عملية سهلة تكون عندما تدخل موقعا فيتم تحويلك الي موقع اخر وضعه شخص اخر",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 24
{
  numb:84,
  question:"تعتبر مضاعفة انظمة التحكم للمستخدم احد امثلة الاجراءت المضادة للتهديد",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},
// 25
{
  numb:85,
  question:"يعتبر التدريب الجيد للموظفين علي انظمة الحماية مثالا علي الاجراءت المضادة للتهديد",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  ]
},

// 1
{
  numb:86,
  question:"من انواع الثغرات.......",
  answer:"كل ماسبق",
  options: [
    "ثغرات تقنية",
    "ثغرات غير تقنية",
    "كل ماسبق",
    "لا شئ مماسبق",
  ]
},

// 2
{
  numb:87,
  question:"يسمي الهجوم الغير التقني ب......",
  answer:"هجوم الهندسة الاجتماعية",
  options: [
    "هجوم الهندسة الوراثية",
    "هجوم الهندسة الاجتماعية",
    "هجوم الهندسة الكهربائية",
    "هجوم الهندسة الكيميائي",
  ]
},
// 3
{
  numb:88,
  question:"تنقسم التحصينات الي.......",
  answer:"كل ماسبق",
  options: [
    "تحصينات ضعيفة",
    "تحصينات قوية",
    "كل ماسبق",
    "لا شئ مماسبق",
  ]
},
// 4
{
  numb:89,
  question:"يتكون التهديد من التالي......",
  answer:"كل ماسبق",
  options: [
    "الهدف",
    "الطريقة او العميل",
    "الحدث",
    "كل ماسبق",
  ]
},
// 5
{
  numb:90,
  question:"تتوقف طريقة الاختراق الي التالي......",
  answer:"كل ماسبق",
  options: [
    "الدوافع واسباب الهجوم",
    "المعلومات المتوفرة عن الضحية",
    "الوصول الي الهدف مباشرة او غير مباشر",
    "كل ماسبق",
  ]
},
// 6
{
  numb:91,
  question:"من امثلة الاجراءت المضادة للتهديد.......",
  answer:"كل ماسبق",
  options: [
    "استخدام برامج مكافحة الفيروسات",
    "التحكم في الدخول",
    "وضع جدران نارية",
    "كل ماسبق",
  ]
},

];

// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});



// Select the first 30 questions
questions = questions.slice(0, 30);

