// creating an array and passing the number, questions, options, and answers
let questions = [

  // // 1
  // {
  //   numb: 1,
  //   question:"النظام بصفة عامة هو مجموعة من الاجزاء او العناصر المترابطة,التي تتفاعل مع بعضها وفقا لأجراءات محددة,لتحقيق هدف معين او مجموعة من الاهداف",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 2
  // {
  //   numb: 2,
  //   question:"يقوم نظام المعلومات المحاسبي بتجميع وتسجيل وتبويب وتلخيص بيانات العمليات المالية التي تجريها الوحدة الاقتصادية خلال الفترة المحاسبية بهدف توفير معلومات مفيدة للمستخدمين من داخل او خارج المنشأة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 3
  // {
  //   numb: 3,
  //   question:"تعتبر البيانات المواد الخام التي يتم استخدامها كمدخلات لنظام المعلومات,وهي تعتبر غير مفيدة بحالتها وتحتاج لعمليات تشغيل ومعالجة حتي يتم تحويلها الي معلومات",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 4
  // {
  //   numb: 4,
  //   question:"يعتبر المستثمرين والمقرضين من اهم انواع المستخدمين الداخليين للمعلومات التي ينتجها نظام المعلومات المحاسبي",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 5
  // {
  //   numb: 5,
  //   question:"يتكون نظام المعلومات المحاسبي من ثلاث عناصر هي المدخلات,عمليات التشغيل,المخرجات",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 6
  // {
  //   numb: 6,
  //   question:"تلتزم الشركة بنشر اربعة قوائم هي قائمة المركز المالي,قائمة الدخل,قائمة التدفقات النقدية,قائمة التغير في حقوق الملكية بالاضافة الي الايضاحات المتممة للقوائم المالية",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 7
  // {
  //   numb: 7,
  //   question:"المحاسبة الادارية هي احد فروع المحاسبة وتهدف لتوفير معلومات لمناسبة للأدارة لمساعدتها في القيام بوظائف التخطيط والرقابة واتخاذ القرارات بهدف بقاء المنظمة ونموها",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 8
  // {
  //   numb: 8,
  //   question:"محاسبة التكاليف توفر معلومات لمتخذي القرارات من خارج الشركة بينما توفر المحاسبة المالية معلومات لمتخذي القرارات من داخل الشركة",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 9
  // {
  //   numb: 9,
  //   question:"تعتبر الاصول والالتزامات من عناصر قائمة المركز المالي , بينما تعتبر الايرادات والمصروفات من عناصر قائمة الدخل",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 10
  // {
  //   numb: 10,
  //   question:"تتكون قائمة المركز المالي من ثلاثة عناصر أساسية:الأصول , الالتزامات , الايرادات",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 11
  // {
  //   numb: 11,
  //   question:"تعتبر حسابات الاصول وحسابات الالتزامات من امثلة الحسابات الاسمية",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 12
  // {
  //   numb: 12,
  //   question:"يعتبر الملاك والادارة من اهم أنواع المستخدمين الداخليين للمعلومات التي ينتجها نظام المعلومات المحاسبي",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 13
  // {
  //   numb: 13,
  //   question:"تنقسم خصائص جودة المعلومات المحاسبية الي خصائص رئسية مثل الثبات القابلية للمقارنة , وخصائص أخري ثانوية مثل الموثوقية والملائمة.",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 14
  // {
  //   numb: 14,
  //   question:"تتحقق خاصية ملائمة المعلومات المحاسبية عن طريق توافر بعض الخصائص الفرعية مثل التعبير الصادق والحياد القابلية للتحقق",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 15
  // {
  //   numb: 15,
  //   question:"تتحقق خاصية موثوقية المعلومات المحاسبية عن طريق توافر بعض الخصائص الفرعية مثل التعبير الصادق والحياد والقابلية للتحقق",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 16
  // {
  //   numb: 16,
  //   question:"يقصد بملائمة المعلومات المحاسبية ان تكون خالية من الاخطاء الجوهرية",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 17
  // {
  //   numb: 17,
  //   question:"يقصد بالتعبير الصادق للمعلومات المحاسبية اعتماد هذه المعلومات علي قواعد قياس موضوعية يمكن التحقق منها بواسطة أدلة ومستندات",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 18
  // {
  //   numb: 18,
  //   question:"تكون المعلومات المحاسبية ذات قيمة رقابية اذا ساعدت في تحسين قدرة متخذ القرار علي التنبؤ بالنتائج المتوقعة في المستقبل",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 19
  // {
  //   numb: 19,
  //   question:"يوفر الثبات والاستمرار في استخدام نفس السياسات المحاسبية امكانية اجراء المقارنات بين نتائج الفترات المالية لنفس المنشأة",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 20
  // {
  //   numb: 20,
  //   question:"هدف النظام هو الذي يحدد طبيعة مكونات النظام واجراءات تحليله وتصميمه وتقييمه",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 21
  // {
  //   numb: 21,
  //   question:"تعتبر حماية الاموال الوحدة الاقتصادية وممتلكاتها والرقابة عليها احد أهداف نظام المعلومات المحاسبي",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 22
  // {
  //   numb: 22,
  //   question:"يمكن تصميم نظام محاسبي معياري يصلح للتطبيق في كافة الوحدات علي اختلاف أنواعها وانشتطها واحجامها",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 23
  // {
  //   numb: 23,
  //   question:"النظام قد يشمل في داخله عدد من الانظمة الفرعية المكونة له, كما يعتبر في نفس الوقت نظاما فرعيا من نظام اخر اكثر شمولا",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 24
  // {
  //   numb: 24,
  //   question:"فعالية النظام يقصد بها مدي تحقيق النظام للأهداف المحددة له",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 25
  // {
  //   numb: 25,
  //   question:"فعالية النظام يقصد بها كافة استغلال الموارد المتاحة للنظام, بمعني تحقيق اهداف النظام وتوفير المخرجات المطلوبة منه باستخدام أقل قدر ممكن من المدخلات",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 26
  // {
  //   numb: 26,
  //   question:"تقسيم النظم من حيث طبيعتها الي نظم مفتوحة ونظم مغلقة",
  //   answer: "خطأ",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 27
  // {
  //   numb: 27,
  //   question:"يمكن تقسيم النظم من حيث طبيعتها الي نظم طبيعية ونظم صناعية",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 28
  // {
  //   numb: 28,
  //   question:"يمكن تقسيم النظم من حيث علاقتها بالبيئة المحيطة الي نظم مفتوحة ونظم مغلقة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 29
  // {
  //   numb: 29,
  //   question:"يمكن تقسيم النظم من حيث تركيبها الي نظم معقدة ونظم بسيطة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  // // 30
  // {
  //   numb: 30,
  //   question:"النظم الطبيعية هي نظم تعمل بصورة تلقائية ولا دخل للأنسان في وجودها أو تشغيلها",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },

  //  // 31
  //  {
  //   numb: 31,
  //   question:"تعتبر الشركات والمصانع والمستشفيات والمدارس من امثلة النظم الطبيعة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 32
  //  {
  //   numb: 32,
  //   question:"النظم المفتوحة هي نظم تستمد من البيئة مدخلات محددة وتمدها بمخرجات متجانسة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 33
  //  {
  //   numb: 33,
  //   question:"النظم المغلقة هي نظم تستمد من البيئة مدخلات معينة وتمدها بمخرجات مختلفة غير متجانسة من فترة لأخري",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 34
  //  {
  //   numb: 34,
  //   question:"النظم المعقدة تتكون من عدد كبير من النظم الفرعية التي تتشابك العلاقات فيما بينها",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 35
  //  {
  //   numb: 35,
  //   question:"النظم البسيطة لا تشتمل علي نظم فرعية أو يكون عدد النظم الفرعية بها قليل نسبيا",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 36
  //  {
  //   numb: 36,
  //   question:"يصنف المدخل التقليدي نظم المعلومات الي نظم معلومات محسابية ونظم معلومات أدارية",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 37
  //  {
  //   numb: 37,
  //   question:"يختص نظام المعلومات المحاسبي بتشغيل بيانات الصفقات المالية مثل بيع وشراء البضاعة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 38
  //  {
  //   numb: 38,
  //   question:"يعتبر تسجيل البيانات صنف جديد في سجلات المخزون بالشركة ضمن الصفقات المالية التي يقوم نظام المعلومات المحاسبي بتوفير معلومات عنها",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 39
  //  {
  //   numb: 39,
  //   question:"وفقا للمدخل الحديث في تبويب نظم المعلومات , يعتبر نظام المعلومات المحاسبي بمكوناته نظاما فرعيا من نظم المعلومات الادارية",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 40
  //  {
  //   numb: 40,
  //   question:"تستخدم نظم دعم القرار في اتخاذ القرارات الروتينية المتكررة",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 41
  //  {
  //   numb: 41,
  //   question:"تستخدم نظم دعم القرار لأتخاذ القرارات شبه وغير الهيكلية التي تخدم الادارة الوسطي والعليا",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 42
  //  {
  //   numb: 42,
  //   question:"توفر نظم المعلومات الادارية المعلومات اللازمة لمساعدة الادارة في ممارسة وظائفها الاساسية مثل الانتاج , التسويق , الشراء , التخزين , ادارة الموارد البشرية , الادارة المالية",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 43
  //  {
  //   numb: 43,
  //   question:"يقوم دليل الحسابات بتويب الحسابات في مجموعة متجانسة علي أساس هرمي",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 44
  //  {
  //   numb:44,
  //   question:"وفقا للدليل المحاسبي يبدأ ترميز حسابات الاصول برقم 2 من اليسار الي اليمين",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 45
  //  {
  //   numb: 45,
  //   question:"وفقا للدليل المحاسبي يبدأ ترميز حسابات الاصول برقم 3 من اليسار الي اليمين",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 46
  //  {
  //   numb: 46,
  //   question:"دليل الحسابات أكثر أهمية في نظم المعلومات المحاسبية الالكترونية عنه في النظم اليدوية",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //  // 47
  //  {
  //   numb: 47,
  //   question:"",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
  //    // 48
  //    {
  //     numb: 48,
  //     question:"",
  //     answer: "صح",
  //     options: [
  //       "صح",
  //       "خطأ",
        
  //     ],
  //   },
  //      // 49
  //  {
  //   numb: 49,
  //   question:"",
  //   answer: "صح",
  //   options: [
  //     "صح",
  //     "خطأ",
      
  //   ],
  // },
     // 50
     {
      numb: 50,
      question:"تشمل دورة تطوير النظم اربعة مراحل هي تحليل وتصميم وتنفيذ وصيانة النظام",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 51,
      question:"تشمل مرحلة تصميم النظام تحديد نقاط القوة والضعف والمشاكل التي تواجه النظام",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 52,
      question:" تشمل مرحلة صيانة نظام وضع الاجراءات التي تضمن استمرار النظام وعدم تعرضه لمخاطر التوقف , او الاستخدام الخاطئ أو الدخول غبر المصرح به",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 53,
      question:"في نظم المعلومات الالكترونية يتم تخزين البيانات في شكل جداول تتكون من مجموعة من الصفوف تسمي حقول ومجموعة من الاعمدة تسمي سجلات",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 54,
      question:"من أهم مميزات قواعد البيانات المستقلة عدم توافر خاصية المشاركة في البيانات بين برامج النظم الفرعية وخاصية التكامل في البيانات بين أقسام المنشأة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 55,
      question:"تتميز قواعد البيانات المتكاملة بسهولة تصميمها وانخفاض تكلفتها مقارنة بقواعد البيانات المستقلة",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 56,
      question:"يعتمد مدخل النظم المتكاملة علي وجود قاعدة بيانات واحدة تخزن فيها كافة البيانات التي تخدم كافة التطبيقات التي تقوم بأنتاج المعلومات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 57,
      question:"يساعد تطبيق قواعد البيانات المتكاملة في منع الازدواج او التكرار في عملية التخزين أو تشغيل البيانات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  

    {
      numb: 58,
      question:"تتكون قواعد البيانات العلاقية من مكونين اساسيين هما الجداول المستخدمة في تخزين البيانات والاستعلامات المستخدمة في تشغيل ومعالجة البيانات وانتاج المعلومات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
  
    {
      numb: 59,
      question:"يعمل نظام أدارة قواعد البيانات علي الفصل بين البيانات وبين برامج التطبيقات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 60,
      question:"تنقسم نظم أدارة قواعد البيانات الي نوعين : نظم هرمية ونظم شبكية",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 61,
      question:"يعتبر الدليل المحاسبي من أمثلة الملفات التي ينطبق عليها الشكل الهرمي في حفظ الملفات بقواعد البيانات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 62,
      question:"الجداول الرئيسية هي الملفات التي تخزن فيها البيانات الدائمة التي لا تتغير من فترة تشغيل لأخري",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 63,
      question:"تعتبر البيانات الشخصية للعملاء والموردين مثل الاسم والعنوان من البيانات التي يتم تخزينها في ملفات حركة العمليات",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 64,
      question:"تعتمد البرامج المحاسبية الجاهزة عادة علي نظم ادارة قواعد البيانات العلاقية المستندة الي لغة SQL",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 65,
      question:"من أشهر برامج التطبيقات المحاسبية الجاهزة برنامج Quick Books وبرنامج Peach tree",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 66,
      question:"يعتبر برنامج Microsoft Office Accounting من برامج المحاسبة التي تصلح للأستخدام في المنشأت الصغيرة والمتوسطة الحجم مهما كانت طبيعة نشاطها",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
    {
      numb: 67,
      question:"تعتبر نظم تخطيط موارد المنشأة ERP من أنظمة المعلومات المعقدة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 68,
      question:"تستخدم نظم تخطيط موارد المنشأة قاعدة بيانات مركزية مرتبطة بمجموعة من التطبيقات الخاصة بكل وظائف المنشأة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 69,
      question:"ركزت نظم تخطيط موارد المنشأة التقليدية في بداية ظهورها علي تخطيط المواد الخام والرقابة علي المستوي التشغيلي",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 70,
      question:"يتكون هيكل نظم تخطيط موارد المنشأة من ثلاثة مستويات هي مستوي شبكة الاعمال ومستوي الموارد و مستوي التطبيقات",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },

    {
      numb: 71,
      question:"تعتبر التطبيقات المالية أهم أنواع التطبيقات المستخدمة في نظم تخطيط موارد المنشأة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 72,
      question:"تتميز نظم تخطيط موارد المنشأة بأنخفاض تكلفتها وارتفاع المخاطر المرتبطة بتطبيقها",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 73,
      question:"يساعد تطبيق نظم تخطيط موارد المنشأة علي تحقيق مزايا تنافسية ناتجة عن أنتاج منتجات وتقديم خدمات بتكلفة منخفضة بجانب تحسين الاتصال بالعملاء والموردين",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 74,
      question:"تتميز مخرجات نظم تخطيط مورد المنشأة من المعلومات والتقارير بدرجة عالية من الجودة والدقة بحيث يمكن الاعتماد عليها في اتخاذ القرارات",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb: 75,
      question:"يساعد تطبيق نظم تخطيط موارد المنشأة علي تخفيض تكاليف الاحتفاظ بالمخزون",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
    {
      numb:2,
      question:"القوائم المالية التي يتم نشرها للمستخدمين من خارج المنشأة تشمل:",
      answer: "ب و ج معا",
      options: [
        "الميزانية العمومية",
        "قائمة التدخل",
        "قائمة التدفقات النقدية",
        "ب و ج معا",
        
      ],
    },
    {
      numb:3,
      question:"تعتبر......من عناصر أو مكونات نظام المعلومات المحاسبي",
      answer: "جميع ماسبق",
      options: [
        "المدخلات والمخرجات",
        "عمليات التشغيل والمعالجة",
        "التغذية العكسية",
        "جميع ماسبق",
        
      ],
    },
    {
      numb:4,
      question:".......هي عبارة عن مجموعة من البيانات الخام التي لا توفر أي دلالة وبالتالي لا يمكن استخدامها بحالتها في اتخاذ أي قرار",
      answer: "المدخلات",
      options: [
        "المدخلات",
        "عملية التشغيل والمعالجة",
        "التغذية العكسية",
        "المخرجات",
        
      ],
    },
    {
      numb:5,
      question:"........هي عبارة عن العمليات اللازمة لتحويل المدخلات الي مخرجات أي تحويل البيانات الي معلومات مفيدة",
      answer: "عمليات التشغيل والمعالجة",
      options: [
        "المدخلات",
        "عمليات التشغيل والمعالجة",
        "التغذية العكسية",
        "المخرجات",
        
      ],
    },
    {
      numb:6,
      question:"تشمل الصفقات المالية التي تقوم بها المنشأة جميع العمليات الأتية ماعدا",
      answer:"تسجيل مورد جديد بسجلات المنشأة",
      options: [
        "بيع وشراء البضاعة",
        "تحصيل وسداد النقدية",
        "حركة المخزون السلعي لدي المنشأة",
        "تسجيل مورد جديد بسجلات المنشأة",
        
      ],
    },
    {
      numb:7,
      question:".......هي نظم معلومات تعتمد علي استخدام الحاسب لتوفير الدعم المناسب لتحسين وزيادة جودة القرارات الادارية وتتميز بدمجها بين التكنولوجيا المعلومات والنماذج الرياضية",
      answer:"نظم دعم القرار",
      options: [
        "نظم دعم القرار",
        "نظم المعلومات المحاسبية",
        "نظم المعلومات الادارية",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:8,
      question:"تحتاج أدارة المنشأة الي نظم دعم القرار عند أتخاذ القرارات الاتية ماعدا:",
      answer: "القرارات المتعلقة بالأنتاج والتسويق",
      options: [
        "قرارات تخصيص الموارد",
        "المفاضلة بين البدائل المتاحة",
        "القرارات المتعلقة بالأنتاج والتسويق",
        "قرارات التوسع أو الانكماش",
        
      ],
    },
    {
      numb:9,
      question:"من أهم المقومات المادية التي يجب توفيرها لتصميم نظام معلومات محاسبي مايلي:",
      answer: "جميع ماسبق",
      options: [
        "الدليل المحاسبي",
        "المستندات والسجلات",
        "القوائم والتقارير",
        "جميع ماسبق",
        
      ],
    },
    {
      numb:10,
      question:"نظام المعلومات المحاسبي هو مجموعة الاجراءات المرتبطة التي تعمل علي:",
      answer:"تجميع وتسجيل وتلخيص البيانات والمعلومات الخاصة بالعمليات",
      options: [
        "تجميع البيانات من المستندات فقط",
        "تفسير وتحليل البيانات المتعلقة بالعمليات المالية فقط",
        "تجميع وتسجيل وتلخيص البيانات والمعلومات الخاصة بالعمليات",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:11,
      question:"تنقسم النظم من حيث العلاقة بالبيئة المحيطة الي:",
      answer:"نظم مغلقة ومفتوحة",
      options: [
        "نظم طبيعية وصناعية",
        "نظم مغلقة ومفتوحة",
        "نظم معقدة وبسيطة",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:12,
      question:"يركز المدخل التقليدي لتبويب لنظم المعلومات علي النظر الي :",
      answer: "نوعية المدخلات",
      options: [
        "نوعية المدخلات",
        "نوعية الاحداث التي تواجه المنشأة",
        "كل ماسبق",
        "لا شئ مماسبق",
        
      ],
    },
  {
      numb:13,
      question:"يركز المدخل الحديث لتبويب لنظم المعلومات علي النظر الي :",
      answer:"نوعية الاحداث التي تواجه المنشأة",
      options: [
        "نوعية المدخلات",
        "نوعية الاحداث التي تواجه المنشأة",
        "كل ماسبق",
        "لا شئ مماسبق",
        
      ],
    },
  {
      numb:14,
      question:"من أمثلة القيود الداخلية المفروضة علي نظام المعلومات المحاسبي",
      answer:  "حجم النشاط والموارد والتكنولوجيا المتاحة",
      options: [
        "حجم النشاط والموارد والتكنولوجيا المتاحة",
        "القوانين واللوائح والتعليمات بالأجهزة الحكومية",
        "كل ماسبق",
        "لا شئ مماسبق",
        
      ],
    },
  {
      numb:15,
      question:"حتي يحقق نظام المعلومات المحاسبي أهدافه ووظائفه بنجاح يتطلب توافر مقومات",
      answer: "كل ماسبق",
      options: [
        "دليل الحسابات",
        "مستندات ودفاتر وسجلات",
        "قوائم وتقارير",
        "كل ماسبق",
        
      ],
    },
  {
      numb:16,
      question:".......هي عبارة عن قائمة تفصيلية تشمل كافة الحسابات الاجمالية والفرعية مبوبة في مجموعات متناسقة من نوع وطبيعة النشاط ويتم ترميزها بما يتلائم مع طبيعة الوحدة الاقتصادية",
      answer: "دليل الحسابات",
      options: [
        "قائمة المركز المالي",
        "دليل الحسابات",
        "قائمة الايرادات والمصروفات",
        "لا شئ مماسبق",
        
      ],
    },
  {
      numb:17,
      question:".......يعتبر هو الدليل الموضوعي المؤيد لصحة الصفقات التي يتم ابرامها ولا يمكن الأستغناء عنه في أنظمة التشغيل اليدوية والأنظمة الالكترونية",
      answer: "المستند",
      options: [
        "المستند",
        "قيد اليومية",
        "دليل الحسابات",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:18,
      question:"اكثر مقومات نظم المعلومات المحاسبية تأثرا بالتحول الرقمي هي:",
      answer:"الدفاتر والسجلات",
      options: [
        "التقارير",
        "المستندات",
        "الدفاتر والسجلات",
        "دليل الحسابات",
        
      ],
    },
    {
      numb:19,
      question:"من أهم الخصائص الأولية لجودة المعلومات المحاسبية",
      answer: "الملائمة",
      options: [
        "الثبات",
        "القابلية",
        "الملائمة",
        "الاتساق",
        
      ],
    },

    {
      numb:20,
      question:"يعتبر التعبير الصادق من خصائص جودة المعلومات ويقصد بها",
      answer: "امانة العرض وأن تكون خالية من الاخطاء",
      options: [
        "قابلية المعلومات المحاسبية للمقارنة",
        "امانة العرض وأن تكون خالية من الاخطاء",
        "ان تعبر المعلومات المحاسبية عن حقائق او احداث يمكن التثبت من صحتها",
        "عرض المعلومات بصورة موضوعية",
        
      ],
    },
    {
      numb:21,
      question:"امكانية الاعتماد علي المعلومات المحاسبية تشير الي",
      answer: "أ و ب معا",
      options: [
        "احدي الخصائص الاولية للمعلومات المحاسبية",
        "القابلية للتحقق والتعبير الصادق والحياد",
        "التكاليف والمنافع والاهمية النسبية للمعلومات",
        "أ و ب معا",
        
      ],
    },
    {
      numb:22,
      question:"القيمة التنبؤية والتغذية العكسية للمعلومات تعد:",
      answer: "ب و ج معا",
      options: [
        "احدي الخصائص الفرعية للمعلومات المحاسبية",
        "احدي الخصائص الاولية للمعلومات المحاسبية",
        "الركن الثاني لخاصية الملائمة لحاجة لمتخذي القرارات",
        "ب و ج معا",
        
      ],
    },
    {
      numb:23,
      question:"......من مرحلة دورة حياة تطوير النظام وفيها يتم تحديد نطاق القوة والضعف التي تواجه النظم القائمة",
      answer: "مرحلة تحليل النظام",
      options: [
        "مرحلة تنفيذ النظام",
        "مرحلة تصميم النظام",
        "مرحلة تحليل النظام",
        "كل ماسبق",
        
      ],
    },
  {
      numb:24,
      question:"........هي مرحلة وضع تصور لما يمكن أن يكون عليه عناصر ومقومات النظام",
      answer:"مرحلة تصميم",
      options: [
        "مرحلة تنفيذ",
        "مرحلة تصميم",
        "مرحلة تحليل",
        "كل ماسبق",
        
      ],
    },
    {
      numb:25,
      question:"في مرحلة صيانة النظام يتم وضع الاجراءات التي تضمن استمرار النظام وعدم تعرضه لمخاطر التوقف او الاستخدام الخاطئ حيث تشمل:",
      answer:"كل ماسبق صحيح",
      options: [
        "تأمين النظام",
        "تحديد الاشخاص المسؤولين عن قاعدة البيانات",
        "الصلاحية الممنوحه لكل شخص",
        "كل ماسبق صحيح",
        
      ],
    },
  {
      numb:26,
      question:"يظهر مدي العبء الذي يقع علي عاتق مصمم النظام المحاسبي من خلال:",
      answer:"مدي التباين بين احتياجات الاطراف الخارجية من المعلومات",
      options: [
        "التباين في احتياجات الاطراف الداخلية من المعلومات",
        "مدي الاتفاق بين احتياجات الاطراف الخارجية من المعلومات",
        "مدي التباين بين احتياجات الاطراف الخارجية من المعلومات",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:27,
      question:"تعتبر.......من اهم ادوات تحليل وتصميم النظم والتي توضح تسلسل العمليات المنطقية التي تتم داخل كل نظام فرعي وتستخدم رموز خاصة في اعدادها",
      answer: "خرائط تدفق النظم",
      options: [
        "اليوميات",
        "خرائط تدفق النظم",
        "دفاتر الاستاذ",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:28,
      question:"تعتبر.......من اهم المدخلات النظام الفرعي لحسابات العملاء والمتحصلات النقدية في ظل تشغيل الالكتروني للبيانات",
      answer: "الملف الرئيسي للعملاء وملف المتحصلات النقدية والتسويات",
      options: [
        "ملف العمليات الجارية والملف الرئيسي للعملاء",
        "ملف المتحصلات النقدية والتسويات وملف العمليات التجارية",
        "الملف الرئيسي للعملاء وملف المتحصلات النقدية والتسويات",
        "ملف فواتير البيع المحررة ويومية المبيعات",
        
      ],
    },
    {
      numb:29,
      question:"لا تعتبر....... من اهم المدخلات الرئيسية للنظام الفرعي لأدارة المخزون في ظل التشغيل الالكتروني للبيانات",
      answer: "أ و ج معا",
      options: [
        "ملف أوامر الشراء",
        "سجل عمليات المخزون",
        "الملف الرئيسي لعناصر المخزون",
        "أ و ج معا",
        
      ],
    },
    {
      numb:30,
      question:"تعتبر....... من بين المخرجات الرئيسية للنظام الفرعي لأدارة المخزون في ظل التشغيل الالكتروني للبيانات",
      answer: "لا شئ مماسبق",
      options: [
        "سجل عمليات المخزون وملف اوامر الشراء",
        "سجل عمليات المخزون الملف الرئيسي لعناصر المخزون",
        "الملف الرئيسي لعناصر المخزون وتقرير حالة المخزون",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:31,
      question:"تتضمن المخرجات للنظام الفرعي للأستاذ العام والتقارير المالية في ظل التشغيل الالكتروني للبيانات مجموعتين رئيستين من المخرجات هي........",
      answer: "تقارير نهاية الفترة وميزان المراجعة الشامل",
      options: [
        "اليوميات وقائمة الاستاذ العام",
        "تقارير نهاية الفترة وميزان المراجعة الشامل",
        "اليوميات وتقارير نهاية الفترة",
        "كل ماسبق",
        
      ],
    },
    {
      numb:32,
      question:"من بين اسباب الحاجة الي تعديل النظام المحاسبي الحالي أو تطويره مايلي:",
      answer: "سعي المنشأة الي تحقيق مزايا تنافسية",
      options: [
        "القدرات العالية للمحاسب علي تشغيل البيانات وانتاج المعلومات",
        "سعي المنشأة الي تحقيق مزايا تنافسية",
        "امكانية كبيرة علي تخزين البيانات في ظل التشغيل الالكتروني",
        "تخفيض حجم الدفاتر والسجلات والملفات واعداد العاملين",
        
      ],
    },
    {
      numb:33,
      question:"من أهم مزايا وفوائد استخدام خرائط التدفق في مجال تحليل النظم مايلي",
      answer: "المساعدة في تدريب العاملين وسرعة فهمهم للنظام الجديد عند تشغيله",
      options: [
        "التحديد السليم للأدارات أو الاشخاص المسؤولين عن العملية المعد عنها الخريطة",
        "المساعدة في تدريب العاملين وسرعة فهمهم للنظام الجديد عند تشغيله",
        "التحديد الجيد للأجراءات الخاصة بأعداد وتجهيز ومراجعة المستندات",
        "لا شئ مماسبق",
        
      ],
    },
    {
      numb:34,
      question:"من اعتبارات التصميم الجيد لخرائط تدفق المستندات مايلي:",
      answer: "الكشف عن نقاط الضعف وأوجه القصور في الدورة المستندية",
      options: [
        "الكشف عن نقاط الضعف وأوجه القصور في الدورة المستندية",
        "تقديم صورة واضحة لما يجب أن تكون عليه الاجراءات",
        "التحديد الجيد للأجراءات الخاصة بأعداد ومراجعة واستخدام كل مستند عبر الأدارات والاقسام",
        "كل ماسبق",
        
      ],
    },
    {
      numb:35,
      question:"تستخدم بعض الادوات مثل أسلوب بيرت وخرائط جانت في مرحلة.....من مراحل دورة حياة تطوير النظام",
      answer: "تنفيذ النظام",
      options: [
        "تحليل النظام",
        "تصميم النظام",
        "تنفيذ النظام",
        "صيانة النظام",
        
        
      ],
    },
    {
      numb:36,
      question:"تعتمد نظم أدارة قواعد البيانات.......علي تخزين البيانات في شكل جداول ويتم الربط بين هذه الجداول وفقا لعلاقات الارتباط المنطقية بين البيانات",
      answer: "العلاقية",
      options: [
        "الهرمية",
        "العلاقية",
        "الشبكية",
        "جميع ماسبق",
        
      ],
    },

    {
      numb:37,
      question:".......هي مجموعة من البرامج الجاهزة تعتمد علي قاعدة بيانات مركزية وتهدف لتحقيق التكامل الداخلي بين وظائف الشركة المختلفة والتكامل الخارجي مع العملاء والموردين",
      answer: "نظم تخطيط موارد المنشأة",
      options: [
        "نظم المعلومات المحاسبية",
        "نظم المعلومات الادارية",
        "نظم دعم القرار",
        "نظم تخطيط موارد المنشأة",
        
      ],
    },
    {
      numb:38,
      question:"يعتبر التكامل من أهم الخصائص المميزة لنظم تخطيط موارد المنشأة ويتمثل في.......",
      answer: "جميع ماسبق",
      options: [
        "تكامل البيانات",
        "تكامل الاجهزة والبرامج",
        "تكامل المعلومات",
        "جميع ماسبق",
        
      ],
    },
    {
      numb:39,
      question:"من أهم الدواف الفنية لتطبيق نظم تخطيط موارد المنشأة.......",
      answer: "جميع ماسبق",
      options: [
        "تخفيض الأخطاء والتكرار في ادخال البيانات",
        "تحقيق التكامل بين التطبيقات المختلفة",
        "تخفيض تكاليف تشغيل وصيانة النظم",
        "جميع ماسبق",
        
      ],
    },
  {
      numb:40,
      question:"من أهم الدوافع التشغيلية لتطبيق نظم تخطيط موارد المنشأة........",
      answer: "جميع ماسبق",
      options: [
        "تحسين كفاءة العمليات",
        "تخفيض النفقات التشغيلية والأدارية",
        "التخلص من التأخير والأخطاء في تنفيذ اوامر العملاء",
        "جميع ماسبق",

        
      ],
    },  
];


// Shuffle questions array
questions.sort(function () {
  return 0.5 - Math.random();
});

// Select the first 30 questions
 questions = questions.slice(0, 40);

