
// creating an array and passing the number, questions, options, and answers
let questions = [
  // SHEET(1)

  // 1
  {
    numb: 1,
    question: "امن المعلومات هو حماية المعلومات لمنع وصول الاشخاص الغير مسموح لهم الوصول للمعلومات",
    options: [
      "صح",
      "خطأ",
    
    ]
  },

// 2
  {
  numb: 2,
  question:"المعلومات او البيانات السرية الخاصة بالافراد او الشركات او المنظمات هي المعلومات المراد حمايتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 3
  {
  numb: 3,
  question:"امن الاتصالات طبقا لتعريف وكالة الامن القومي الامريكي هو المعايير المتخذه لمنع وصول المعلومات الي اي اشخاص غير مخونين عبر الاتصالات وذلك لضمان اصالة وصحة هذه الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb: 4,
  question:"يحتاج الامن الفيزيائي الي مراقبة باستخدام الكاميرات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 5
{
  numb: 5,
  question:"يشمل الامن الفيزيائي حماية المكونات المادية لأجهزة الاتصالات ",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 6
{
  numb: 6,
  question:"عند أختراق احد الاجهزة التي تحتوي علي بيانات هامه فيمكن اصدار اشاره مضاده للأشارات الغريبة داخل الجهاز",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 7
{
  numb: 7,
  question:"تقوم الاشارات المضادة بمحو الاشارات الغريبه او اضعافها بحيث ينعدم تأثيرها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 8
{
  numb: 8,
  question:"يعتبر اجهزة الانذار من السرقة والموجودة في الاماكن المختلفة مثال علي الامن الفيزيائي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 9
{
  numb: 9,
  question:"تعتبر انظمة توفير الطاقة المستخدمة في المنازل الذكية مثال علي الامن الفيزيائي و صيانة الاجهزة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 10
{
  numb: 10,
  question:"يمكن استخدام الاجهزة الذكية في تحقيق الامن الفيزيائي وامن المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 11
{
  numb: 11,
  question:"يعتبر(Smart Home) تطبيقا علي الامن الفيزيائي",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 1
{
  numb: 12,
  question:"من امثلة البيانات المراد حمايتها مايلي.......",
  answer:"كل ماسبق",
  options: [
    "حسابات العملاء في البنوك",
    "نتائج الطلاب",
    "البيانات العسكرية",
    "كل ماسبق",
  
  ]
},
// 2
{
  numb: 13,
  question:"تشمل النشاطات المحددة لأمن الاتصالات مايلي......",
  answer:"كل ماسبق",
  options: [
    "امن التشفير",
    "امن النقل",
    "امن الفيزيائي",
    "كل ماسبق",
  
  ]
},
// 3
{
  numb: 14,
  question:"تشمل النشاطات المحددة لأمن الاتصالات مايلي......",
  answer:"كل ماسبق",
  options: [
    "امن الشعاع",
    "امن الفيزيائي",
    "كل ماسبق",
    "لا شئ مماسبق",
  
  ]
},
// 4
{
  numb: 15,
  question:"يشمل الامن السحابي الحسابيه مايلي.......",
  answer:"كل ماسبق",
  options: [
    "امن النقل",
    "امن الفيزيائي",
    "امن التشفير",
    "كل ماسبق",
  
  ]
},
// 5
{
  numb: 16,
  question:"من انواع الامن الفيزيائي او الطرق المستخدمة في الامن الفيزيائي مايلي......",
  answer:"كل ماسبق",
  options: [
    "المراقبة بالكاميرات",
    "افراد الامن ",
    "حساسات الحريق",
    "كل ماسبق",
  
  ]
},
// 6
{
  numb: 17,
  question:"من الطرق المستخدمة في حماية الاشارات مايلي......",
  answer:"كل ماسبق",
  options: [
    "jamming",
    "Anti-jamming",
    "كل ماسبق",
    "لا شئ مماسبق",
  
  ]
},

// SHEET(2)
// 1
{
  numb: 18,
  question:"يعتبر التحقق من الهوية احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 2
{
  numb: 19,
  question:"تعتبر خاصية الكمال من احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 3
{
  numb: 20,
  question:"يعتبر التوفر احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb: 21,
  question:"تعتبر مسؤلية مكافحة الانكار احد خصائص امن الاتصالات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 5
{
  numb: 22,
  question:"السرية هي التأكد بأن المعلومات لم يتصل لأشخاص او اجهزة غير مخونين للحصول علي هذه المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 6
{
  numb: 23,
  question:"المقصود بالكمال هو وصول البيانات من المرسل الي المستقبل كما هي تماما دون اي فقد او تغيير",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 7
{
  numb: 24,
  question:"يعكس خاصية الكمال جوده نظم المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 8
{
  numb: 25,
  question:"تؤثر خاصية الكمال مدي صحة موثوقية البيانات داخل نظام المعلومات",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 9
{
  numb: 26,
  question:"يجب ان يكون هناك ضمان بان تحقيق الاتصال بين طرفين لا يؤثر سلبا علي الطرف الثالث",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 10
{
  numb: 27,
  question:"امن الحاسب هو المعايير والاجراءت التي تضمن سرية وكمال وتوفر مكونات أنظمة المعلومات بما في ذلك المكونات والبرمجيات والمعلومات والبيانات التي يتم معالجتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 1
{
  numb: 28,
  question:"من خصائص امن الاتصالات مايلي.......",
  answer:"السريه",
  options: [
    "السريه",
    "اجهزة الحاسب الالي",
    "الشبكات",
    "قواعد البيانات",
  
  ]
},
// 2
{
  numb: 29,
  question:"خصائص امن الاتصالات مايلي.....",
  answer:"كل ماسبق",
  options: [
    "مكافحة الانكار",
    "الكمال",
    "التوافر",
    "كل ماسبق",
  
  ]
},
// 3
{
  numb: 30,
  question:"السرية هي الحماية من......المعلومات",
  answer:"افشاء",
  options: [
    "التشفير",
    "افشاء",
    "المعالجة",
    "لاشئ مماسبق",
  
  ]
},
// 4
{
  numb: 31,
  question:"يعتبر.....التحقق من الهوية اجراء امني للتأكد من صلاحية",
  answer:"كل ماسبق",
  options: [
    "الاتصال",
    "المصدر",
    "الرساله",
    "كل ماسبق",
  
  ]
},
// 5
{
  numb: 32,
  question:".....هو وصول البيانات من المرسل الي المستقبل كما هي تماما دون فقد او تغيير",
  answer:"الكمال",
  options: [
    "الكمال",
    "السريه",
    "مكافحة الانكار",
    "التوفر",
  
  ]
},
// 6
{
  numb: 33,
  question:".......هو الوصول الموثوق الي البيانات والمعلومات عند الحاجة اليها من قبل الاشخاص المخونين لذلك",
  answer:"التوفر",
  options: [
    "التوفر",
    "الكمال",
    "التحقق من الهويه",
    "مكافحة الانكار",
  
  ]
},
// 7
{
  numb: 34,
  question:"....هو التأكيد بأن مرسل البيانات قد حصل علي أثبات بوصول البيانات الي المرسل اليه وبما ان المستقبل قد حصل اثبات لشخصية المرسل ممايمنع انكار اي من الطرفين بانه قد تعاملا مع هذه البيانات",
  answer:"مكافحة الانكار",
  options: [
    "السريه",
    "التوفر",
    "مكافحة الانكار",
    "لا شئ مماسبق",
  
  ]
},
// 8
{
  numb: 35,
  question:"يتضمن مفهوم امن انظمة المعلومات",
  answer:"كل ماسبق",
  options: [
    "السريه",
    "الكمال",
    "التحقق من الهوية",
    "كل ماسبق",
  
  ]
},
// 9
{
  numb: 36,
  question:"يتضمن مفهوم امن انظمة المعلومات",
  answer:"كل ماسبق",
  options: [
    "التوفر",
    "مكافحة الانكار",
    "كل ماسبق",
    "لا شئ مماسبق",
  
  ]
},
// 10
{
  numb: 37,
  question:"يشمل امن نظام المعلومات مايلي......",
  answer:"كل ماسبق",
  options: [
    "الاتصالات",
    "امن الحاسب",
    "امن شبكات الحاسب",
    "كل ماسبق",
  
  ]
},
// 11
{
  numb: 38,
  question:"من انظمة المعلومات هو......",
  answer:"information system security",
  options: [
    "information system security",
    "information smart security",
    "intelligent system security",
    "كل ماسبق",
  
  ]
},

//SHEET(3)

// 1
{
  numb: 39,
  question:"يجب ان تحدد المؤسسات بالتفصيل الموظفين الذين يحق لهم الوصول الي كل نوع من انواع  الخدمة التي تقدمها الانترنت",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 2
{
  numb: 40,
  question:"يجب علي الشركات تحديد صلاحيات كل موظف داخل الشركة وانشاء حساب خاص لكل واحد منهم",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 3
{
  numb: 41,
  question:"يجب تحديد المجالات التي ستتفق فيها اموال المؤسسة للحفاظ علي امن معلوماتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 4
{
  numb: 42,
  question:"قد يكون من المفيد ان تقوم الشركة بتوظيف مستشار من الحاسب الالي وذلك بضمان امن معلوماتها",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},
// 5
{
  numb:43,
  question:"من السياسات الامنية التي يجب ان تقوم الشركة هي وضع اجهزة التحقق من بصمة الشخص علي اجهزة البيانات المهمة",
  answer:"صح",
  options: [
    "صح",
    "خطأ",
  
  ]
},

// 7
{
  numb:44,
  question:"يجب ان تركز الشركات علي وجود سياسة امنية شاملة وتطوير السياسة الامنية الحالية بحيث تأخذ في الاعتبار الربط مع......",
  answer:"الانترنت",
  options: [
    "حول العالم",
    "الانترنت",
    "الحكومات",
    "لا شئ مماسبق",
  
  ]
},
// 8
{
  numb:45,
  question:"يجب تحديد الاجراءت التي ستقوم بها المؤسسة في الحالات حدوث.....للخطة الامنية الخاصة بها",
  answer:"اختراق",
  options: [
    "شراء",
    "انفاق",
    "اختراق",
    "كل ماسبق",
  
  ]
},
// 9
{
  numb:46,
  question:"يجب اجراء تقويم للعمليات الامنية علي فترات زمنية محددة",
  answer:"كل ماسبق",
  options: [
    "التحقق من المستخدم",
    "برامج الجدران النارية",
    "التشفير",
    "كل ماسبق",
  
  ]
},
// 10
{
  numb:47,
  question:"من السياسات الامنية التي تقوم بها الشركة مايلي.....",
  answer:"كل ماسبق",
  options: [
    "استخدام الجهاز الخاص بالشركة والانترنت فقط",
    "مسح حساب الخاص بالموظف منتهي العقد",
    "وضع حساسات المياه في كل اجهزة تخزين البيانات",
    "كل ماسبق",
  
  ]
},
// 11
{
  numb:48,
  question:"من السياسات الامنية التي تقوم بها الشركة مايلي....",
  answer:"كل ماسبق",
  options: [
    "عدم تبادل الرسائل الخاصة داخل الشركة",
    "تحديد صلاحيات كل مستخدم علي البيانات الموجودة في قاعدة البيانات",
    "الدخول للشركة عن طريق البطاقة الخاصة بكل موظف",
    "كل ماسبق",
  
  ]
},

// SHEET(4)




];

// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});



// Select the first 30 questions
questions = questions.slice(0, 30);

