// creating an array and passing the number, questions, options, and answers
let questions = [
  {
    numb: 1,
    question: "يعتير ....علي أنها ممارسة النشاط التجاري عبر أنظمة الكمبيوتر والشبكات .",
    answer:"التجارة الألكترونية",
    options: [
      "التجارة الألكترونية",
      "التجارة التسويقية",
      "التجارة الحرة",
      "لا شئ مماسبق",
    
    ]
  },
  {
    numb: 2,
    question: "ماهي أنواع التجارة الألكترونية ",
    answer:"جميع الأجابات صحيحة",
    options: [
      "تجارة الألكترونية بين الشركات والشركات",
      "تجارة الألكترونية بين الشركات",
      "تجارة الألكترونية بين الزبائن والزبائن",
      "جميع الأجابات صحيحة",
    
    ]
  },
  {
    numb: 3,
    question: "ماهي فوائد ومميزات التجارة الألكترونية",
    answer:"جميع الأجابات صحيحة",
    options: [
      "تسويق أكثر فعالية وأرباح كثيرة",
      "تخفيض مصاريف الشركات",
      "خفض الأسعار",
      "جميع الأجابات صحيحة",
    
    
    ]
  },
  {
    numb: 4,
    question: "هناك أسباب تجعل التجارة الألكترونية خيارا جذابا لرواد الأعمال ماهي.",
    answer:"جميع الأجابات صحيحة",
    options: [
      "أمتداد عالمي",
      "دائما مفتوح",
      "وفورات في التكاليف",
      "جميع الأجابات صحيحة",
    
    
    ]
  },
  {
    numb: 5,
    question: "تعد ... عملية إعداد وصيانة مواقع التجارة الألكترونية عبر الأنترنت أقل كلفة من أسواق.",
    answer:"تخفيض مصاريف الشركات",
    options: [
      "تسويق أكثر فعالية وأرباح كثيرة",
      "تخفيض مصاريف الشركات",
      "خفض الأسعار",
      "حرية الأختيار",
    
    
    ]
  },
  {
    numb: 6,
    question: "تأتي ...أيضا في شكل أدلة أوكتب ألكترونية .",
    answer:"المنتجات الرقمية",
    options: [
      "المنتجات الرقمية",
      "تجارة التجزئة للخدمات",
      "مخازن السلع المادية",
      "لا شئ مماسبق",
    ,
    
    ]
  },
  {
    numb: 7,
    question: "كل مما يلي من مميزات التجارة الألكترونية ماعدا ",
    answer:"دعم التجارة الخارجية",
    options: [
      "توفير الوقت والمجهود",
      "دعم التجارة الخارجية",
      "مشاهدة أراء الأخرين",
      "الحرية والدفع ببطاقات الأئتمان",
    ,
    
    ]
  },
  {
    numb: 8,
    question: "كل مما يلي من فوائد التجارة الألكترونية علي المستوي القومي ماعدا",
    answer:"توفير الوقت والمجهود",
    options: [
      "دعم التنمية الأقتصادية",
      "دعم التوظيف",
      "توفير الوقت والمجهود",
      "دعم القطاعات التكنولوجية",
    
    ]
  },
  {
    numb: 9,
    question: "كل ممايلي من عيوب التجارة الألكترونية ماعد",
    answer:"دعم التوظيف",
    options: [
      "النصب والأحتيال",
      "غياب حماية الخصوصية",
      "مافيا البنوك",
      "دعم التوظيف",
    
    
    ]
  },
  {
    numb: 10,
    question: "تعد .....من أشهر عيوب التجارة الألكترونية أو المخاطر التي من الممكن أن يتعرض لها أي شخص يتعامل بشكل مباشر مع مواقع التجارة الألكترونية",
    answer:"النصب والأحتيال",
    options: [
      "النصب والأحتيال",
      "غياب حماية الخصوصية",
      "مافيا البنوك",
      "دعم القطاعات التكنولوجيا",
    
    
    ]
  },
  {
    numb: 11,
    question: "يترتبط نمو التجارة الألكترونية بنمو تقنيات الحركات المالية",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ]
  },
  {
    numb: 12,
    question: "المشتري هو أحد طرفي العملية التجارة الألكترونية فقط",
    answer:"خطأ",
    options: [
      "صح",
      "خطأ",
    ]
  },
  {
    numb: 13,
    question: "معظم العملاء يفضلون أجراء معاملاتهم التجارية من منازلهم أو موقع عملهم",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 4
  {
    numb: 14,
    question: "تزود التجارة الألكترونية العملاء بالمعلومات الكاملة عن المنتجات",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 5
  {
    numb: 15,
    question: "تتمتع شركات التجارة الألكترونية بتكاليف تشغيل أكثر بكثير مقارنة بالمتاجر الفعلية",
    answer:"خطأ",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 6
  {
    numb: 16,
    question: "لا يرتبط مالك النشاط التجاري بأي موقع واحد عند تشغيل نشاطه التجاري",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 7
  {
    numb: 17,
    question: "من مزايا التجارة الألكترونية أنها غير مقيدة بأي مواعيد أو بزمان محدد",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 8
  {
    numb: 18,
    question: "لكل موقع لا يوجد قسم باراء العملاء لتقييم الخدمة",
    answer:"خطأ",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 9
  {
    numb: 19,
    question: "يمكنك توقع مايريده العميل عن طريق تاريخ سلوكه الشرائي بالعمليات السابقة",
    answer:"صح",
    options: [
      "صح",
      "خطأ",
    ]
  },
  // 10
  {
    numb: 20,
    question: "تعد غياب حماية الخصوصية من أخطر عيوب وسلبيات التسوق الألكتروني",
    answer:"صح",
    options: [
      "صح",
      "خطأ"
    ]
  },

    // 1
    {
      numb: 21,
      question: "يلعب .....دورا حيويا بشكل متزايد في تعزيز الأصالة وتجربة المستخدم والجاذبية الشاملة لمنصات التجارة الألكترونية",
      answer:"الواقع المعزز",
      options: [
        "الواقع المعزز",
        "الذكاء الأصطناعي",
        "البحث الصوتي",
        "تعزيز تجربة المستخدم",
      ]
    },
    // 2
    {
      numb: 22,
      question: "يتيح ..... للعملاء تصور المنتجات في سياقها المقصود",
      answer:"الواقع المعزز",
      options: [
        "الواقع المعزز",
        "الذكاء الأصطناعي",
        "البحث الصوتي",
        "تعزيز تجربة المستخدم",
      ]
    },
    // 3
    {
      numb: 23,
      question: "كل ممايلي من استخدامات الواقع المعزز ماعدا",
      answer:"التأثير البصري",
      options: [
        "التعليم",
        "الأعلان التسويق",
        "التصميم والعمارة",
        "التأثير البصري",
      ]
    },
    // 4
    {
      numb: 24,
      question: "كل ممايلي من استخدامات الواقع المعزز ماعدا",
      answer:"قيود المكان والزمان",
      options: [
        "الملاحظة المحسنة",
        "التفاعل",
        "قيود المكان والزمان",
        "تجربة الألعاب",
      ]
    },
    // 5
    {
      numb: 25,
      question: "كل ممايلي من عيوب الواقع المعزز ماعدا",
      answer:      "تجربة الألعاب",

      options: [
        "التأثير البصري",
        "الأمان والخصوصية",
        "الأعتماد علي التكنولوجيا",
        "تجربة الألعاب",
      ]
    },
    // 6
    {
      numb: 26,
      question: "يعد تبني.....وتحسينه أمر بالغ الأهمية في الحفاظ علي الميزة التنافسية والأستفادة من هذا النجاح المتنامي",
      answer:"البحث الصوتي",
      options: [
        "الواقع المعزز",
        "الذكاء الأصطناعي",
        "البحث الصوتي",
        "تعزيز تجربة المستخدم",
      ]
    },
    // 7
    {
      numb: 27,
      question: "يعد.....هو أحد أتجاهات الحديثة التي تشكل الصناعة",
      answer:"الذكاء الأصطناعي",

      options: [
        "الواقع المعزز",
        "الذكاء الأصطناعي",
        "البحث الصوتي",
        "تعزيز تجربة المستخدم",
      ]
    },
    // 8
    {
      numb: 28,
      question: "استخدام......لمساعدة تجار التجزئة في فهم المستهلكين علي مستوي أعمق",
      answer:"الذكاء الأصطناعي",
      options: [
        "الواقع المعزز",
        "الذكاء الأصطناعي",
        "البحث الصوتي",
        "تعزيز تجربة المستخدم",
      ]
    },
    // 9
    {
      numb: 29,
      question: ".....هو مجموعة من التقنيات والأنظمة التي تهدف الي أنشاء أنظمة أو برامج قادرة علي أداء مهام تتطلب تفكيرا و أتخاذ قرارات مشابهة لتلك التي يمكن أن يقوم بها الأنسان",
      answer:"الذكاء الأصطناعي",
      options: [
        "الواقع المعزز",
        "الذكاء الأصطناعي",
        "البحث الصوتي",
        "تعزيز تجربة المستخدم",
      ]
    },
    // 10
    {
      numb: 30,
      question: "كل ممايلي من أنواع الذكاء الأصطناعي ماعدا",
      answer:"الواقع المعزز",
      options: [
        "الذكاء الأصطناعي الضيق",
        "الذكاء الأصطناعي العام",
        "الذكاء الأصطناعي الفائق",
        "الواقع المعزز",
      ]
    },
    // 11
    {
      numb: 31,
      question: "يشير......الي نوع من الذكاء الأصطناعي الذي يتفوق بشكل كبير علي القدرات العقلية للبشر في جميع المجالات",
      answer:"الذكاء الأصطناعي الفائق",

      options: [
        "الذكاء الأصطناعي الضيق",
        "الذكاء الأصطناعي العام",
        "الذكاء الأصطناعي الفائق",
        "الواقع المعزز",
      ]
    },
    // 12
    {
      numb: 32,
      question: "يشير.....الي نوع من الذكاء الأصطناعي القادر علي تنفيذ مجموعة واسعة من المهام المشابه للذكاء البشري",
      answer:      "الذكاء الأصطناعي العام",

      options: [
        "الذكاء الأصطناعي الضيق",
        "الذكاء الأصطناعي العام",
        "الذكاء الأصطناعي الفائق",
        "الواقع المعزز",
      ]
    },
    // 13
    {
      numb: 33,
      question: "يشير.....الي نوع من الذكاء الأصطناعي المحدود,حيث يتم تصميم الأنظمة الذكاء الأصطناعي لأداء مهمة محددة بشكل متخصصة ودقيق",
      answer:      "الذكاء الأصطناعي الضيق",
      options: [
        "الذكاء الأصطناعي الضيق",
        "الذكاء الأصطناعي العام",
        "الذكاء الأصطناعي الفائق",
        "الواقع المعزز",
      ]
    },
    // 14
    {
      numb: 34,
      question: "كل ممايلي من الأدوات الذكاء الأصطناعي ماعدا",
      answer:      "كل ماسبق",
      options: [
        "الألعاب",
        "الصور",
        "النمذجة",
        "كل ماسبق",
      ]
    },
    // 15
    {
      numb: 35,
      question: "ماهي تحديات الذكاء الأصطناعي",
      answer:      "كل ماسبق",
      options: [
        "التدريب علي البيانات",
        "الشفافية والتفسير",
        "النمذجة",
        "كل ماسبق",
        
      ]
    },
    // 16
    {
      numb: 36,
      question: "ييعتير.....برنامجا يعتمد علي الذكاء الأصطناعي يستخدم للتفاعل مع العملاء عبر المحادثات النصية أو الصوتية",
      answer:      "الشات بوت",
      options: [
        "الشات بوت",
        "تحليل العواطف",
        "التوقعات والتنبؤات",
        "فهم النية",
      ]
    },
    // 17
    {
      numb: 37,
      question: "ماهي خوارزميات أستهداف العملاء و الأعلانات",
      answer:      "كل ماسبق",
      options: [
        "استهداف الجمهور",
        "استهداف الوسائط الأجتماعية",
        "تخصيص الأعلانات",
        "كل ماسبق",
      ]
    },
    // 18
    {
      numb: 38,
      question: "......هو مجال من الذكاء الأصطناعي يهتم بتطوير الخوارزميات التي تسمح للألات بالتعلم من البيانات دون أن يتم أعطائها التعليمات البرمجية المحددة لأداء مهمة معينة",
      answer:      "التعلم الألي",
      options: [
        "التعلم الألي",
        "التعلم العميق",
        "الشبكات العصبية",
        "التعلم الخاضع للأشراف",
      ]
    },
    // 19
    {
      numb: 39,
      question: "هو مجموعة فرعية من التعلم الألي تستخدم الشبكات العصبية الأصطناعية لتعلم الأنماط في البيانات",
      answer:        "التعلم العميق",
      options: [
        "التعلم الألي",
        "التعلم العميق",
        "الشبكات العصبية",
        "التعلم الخاضع للأشراف",
      ]
    },
    // 20
    {
      numb: 40,
      question: "تستخدم....هذه النماذج في مجال الذكاء الأصطناعي والتعلم الألي لمعالجة المعلومات وأتخاذ القرارات",
      answer:      "الشبكات العصبية",
      options: [
        "التعلم الألي",
        "التعلم العميق",
        "الشبكات العصبية",
        "التعلم الخاضع للأشراف",
      ]
    },
    // 21
    // {
    //   numb: 41,
    //   question: "",
    //   answer:"",
    //   options: [
    //     "",
    //     "",
    //     "",
    //     "",
    //   ]
    // },
    // // 22
    // {
    //   numb: 42,
    //   question: "",
    //   answer:"",
    //   options: [
    //     "",
    //     "",
    //     "",
    //     "",
    //   ]
    // },
    // // 23
    // {
    //   numb: 43,
    //   question: "",
    //   answer:"",
    //   options: [
    //     "",
    //     "",
    //     "",
    //     "",
    //   ]
    // },
    // // 24
    // {
    //   numb: 44,
    //   question: "",
    //   answer:"",
    //   options: [
    //     "",
    //     "",
    //     "",
    //     "",
    //   ]
    // },
    // // 25
    // {
    //   numb: 45,
    //   question: "",
    //   answer:"",
    //   options: [
    //     "",
    //     "",
    //     "",
    //     "",
    //   ]
    // },
    // {
    //   numb: 21,
    //   question: "",
    //   answer:"",
    //   options: [
    //     "",
    //     "",
    //     "",
    //     "",
    //   ]
    // },

  
  

];
// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});

// Select the first 30 questions
questions = questions.slice(0, 30);

