// // creating an array and passing the number, questions, options, and answers
// let questions = [
//   {
//     numb: 1,
//     question: "توفر المحاسبة الأدارية معلومات ملائمة لمساعدة الأدارة في اداء وظائف التخطيط والرقابة وأتخاذ القرارات",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },

//   {
//     numb: 2,
//     question: "توفر المحاسبة الأدارية معلومات أجمالية عن اداء الشركة لخدمة المستخدمين الخارجيين",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 3,
//     question: "يوجد ألزام قانوني علي الشركات بضرورة وجود نظام للمحاسبة المالية وكذالك نظام لمحاسبة التكاليف والمحاسبة الأدارية.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 4,
//     question: "يوجد ألزام قانوني علي الشركات بضرورة نشر المعلومات التي توفرها المحاسبة الأدارية",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 5,
//     question: "توفر المحاسبة الأدارية معلومات تاريخية ذات طبيعة مالية.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 6,
//     question: "يقوم التبويب الوظيفي بتقسيم عناصر التكاليف الي تكاليف مواد خام وتكاليف أجور وتكاليف صناعية غير مباشرة.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 7,
//     question: "تعتبر مصروفات البيع والتوزيع والدعاية والأعلان ضمن عناصر التكاليف الأنتاجية",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 8,
//     question: "تنقسم التكاليف من حيث علاقتها بوحدة المنتح الي تكاليف ثابتة ومتغيرة ومختلطة.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 9,
//     question: "تنقسم التكاليف من حيث علاقتها بحجم المنتج الي تكاليف مباشرة وغير مباشرة.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 10,
//     question: "التكاليف الثابتة لا تتغير في مجموعها مع تغير حجم الأنتاج ضمن المدي الأنتاجي الملائم",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 11,
//     question: "تتأثثر التكاليف المتغيرة بالتغير في حجم الأنتاج بالزيادة أو النقص وبالنفس النسبة.",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 12,
//     question: "التكاليف المختلطة تتغير في مجموعها مع التغير في حجم الأنتاج ولكن ليس بنفس النسبة.",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 13,
//     question: "التكاليف الصناعية اللأنتاج = التكلفة الأولية + تكلفة التحويل.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 14,
//     question: "كل التكاليف المباشرة تعتبر متغيرة , وكل الثابتة تعتبر تكاليف غير مباشرة.",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 15,
//     question: "تعتبر التكاليف التسويقية والتكاليف التمويلية والأدارية ضمن التكاليف الخاصة بالفترة.",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb:16,
//     question: "تعتبر التكاليف الثابتة من التكاليف الملائمة لأتخاذ القرارات",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 17,
//     question: "يشترط في التكاليف الملائمة أن تكون مرتبطة بالمستقبل وأن تختلف من بديل لأخر",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 18,
//     question: "التكاليف الثابتة تكون ثابتة في مجموعها ومتوسط تكلفة الوحدة منها متغير.",
//     answer:"صح",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },
//   {
//     numb: 19,
//     question: "التكاليف المتغيرة تكون متغيرة في مجموعها ومتوسط تكلفة الوحدة منها متغير أيضا.",
//     answer:"خطأ",
//     options: [
//       "صح",
//       "خطأ",
    
//     ]
//   },

//   {
//   numb: 21,
//   question: "عند نقطة التعادل يكون فائض المساهمة الكلي مساويا لأجمالي التكاليف الثابتة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },

// {
//   numb: 22,
//   question:"يفترض تحليل التعادل أن  حجم الأنتاج يساوي حجم المبيعات خلال الفترة", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 23,
//   question:"يفترض تحليل التعادل ثبات سعر البيع والتكلفة المتغيرة لوحدة المنتج خلال فترة التخطيط", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },


// {
//   numb: 24,
//   question:"عند خفض سعر بيع الوحدة تحقق الشركة نقطة التعادل عند حجم أكبر من المبيعات", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 25,
//   question:"عند زيادة التكلفة المتغيرة للوحدة تحقق الشركة نقطة التعادل عند حجم أكبر من المبيعات", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 26,
//   question:"عند زيادة حجم التكاليف الثابتة تحقق الشركة نقطة التعادل عند حجم أكبر من المبيعات", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 27,
//   question:"كلما زاد حجم الأنتاج والمبيعات عن حجم التعادل أدي ذالك الي زيادة أرباح الشركة", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 28,
//   question:"هامش الأمان هو عبارة عن الزيادة في الكمية أو القيمة المبيعات الفعلية عن كمية أو مبيعات التعادل", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 29,
//   question:"أرتفاع قيمة و نسبة هامش ألأمان معناه أرتفاع درجة المخاطر التي تتعرض لها الشركة", 
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 30,
//   question:"لزيادة هامش الأمان يجب علي الشركة زيادة مبيعاتها مع خفض حجم التعادل بقدر الأمكان", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 31,
//   question:"يمكن للشركة خفض حجم مبيعات التعادل عن طريق خفض التكاليف الثابتة والمتغيرة أو زيادة سعر بيع منتجاتها", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 32,
//   question:"أرتفاع التكاليف الثابتة يؤدي الي أرتفاع حجم التعادل وبالتالي أنخفاض هامش الأمان", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 33,
//   question:"يكون لدي الشركة درجة مرتفعة من الرفع التشغيلي اذا كانت تتصف بأرتفاع نسبة التكاليف الي أجمالي تكاليفها الكلية", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 34,
//   question:"في ظل أرتفاع التكاليف الثابتة لدي الشركة , فأن حدوث تغير بسيط في حجم وقيمة المبيعات يؤدي الي حدوث تغير كبير في صافي الدخل التشغيلي", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 35,
//   question:"أرتفاع التكاليف الثابتة يؤدي الي أرتفاع درجة الرفع التشغيلي وبالتالي أرتفاع درجة المخاطر التي تتعرض لها الشركة", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 36,
//   question:"أذا كانت درجة الرفع التشغيلي لأحد الشركات = 3 , فأن ذالك معناه أن التغير في أيراد مبيعاتها بنسبة 1% سوف يؤدي الي تغير في صافي الدخل التشغيلي للشركة بنسبة 3%.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 37,
//   question:"عند أتخاذ قرار المفاضلة بين الشراء والصنع , تعتبر التكاليف الصناعية المباشرة والتكاليف الصناعية الغير المباشرة المتغيرة تكاليف ملائمة لأتخاذ هذا القرار.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 38,
//   question:"تعد تكلفة شراء اصل قديم ملائمة لأتخاذ قرار أستبداله بأصل جديد.", 
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 39,
//   question:"تعتبر التكاليف الغارقة تكاليف ملائمة لأتخاذ القرارات.", 
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 40,
//   question:"التكلفة التفاضلية هي عبارة عن مقدار التغير في التكلفة نتيجة الأنتقال من بديل أخر.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 41,
//   question:"التكلفة الغارقة هي تكلفة تاريخية حدثت نتيجة قرارات أتخذت في الماضي وبالتالي لا تؤثر علي القرارت المتعلقة بالمستقبل.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 42,
//   question:"التكاليف الحدية هي التكاليف الأضافية الناتجة عن زيادة الأنتاج بوحدة واحدة.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 43,
//   question:"تكلفة الفرصة البديلة هي أقصي عائد مضحي به نتيجة أختيار أحد البدائل المتاحة وأستبعاد البدائل الأخري", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 44,
//   question:"التكاليف الصناعية الغير المباشرة الثابتة تعتبر تكاليف ملائمة لأتخاذ قرار المفاضلة بين الشراء أو الصنع.", 
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 45,
//   question:"تعتبر تكلفة الفرصة البديلة من التكاليف الملائمة لأتخاذ قرار المفاضلة بين الشراء أو الصنع", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 46,
//   question:"تعتبر الطاقة الأنتاجية المتاحة لدي المنشاة أحد العوامل الأساسية المؤثرة في قبول أو رفض الطلبيات الخاصة", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 47,
//   question:"المنتجات المشتركة هي المنتجات المختلفة التي يتم أنتاجها من مادة خام واحدة.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 48,
//   question:"التكاليف المشتركة قبل نقطة الأشتقاق تعتبر تكاليف ملائمة لأتخاذ قرار بيع المنتجات عند نقطة الأشتقاق أو أستكمال التشغيل الأضافي عليها", 
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 49,
//   question:"تعتبر تكلفة شراء الأصل الجديد تكلفة ملائمة لأتخاذ قرار أستبدال أصل قديم بأصل جديد.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 50,
//   question:"في ظل عدم وجود قيود علي الموارد  يتم أختيار التشكيلة المثلي من المنتجات التي تحقق أعلي فائض مساهمة كلي.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 51,
//   question:"في ظل وجود قيود علي الموارد يتم أختيار التشكيلة المثلي من المنتجات بناء علي معيار فائض المساهمة للوحدة من المورد النادر.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 52,
//   question:"تعتبر الوفرات في التكاليف المتغيرة نتيجة أستبدال أصل قديم بأصل جديد تكلفة تفاضلية متناقصة.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 53,
//   question:"تمثل الكمية الأقتصادية للطلب الحجم الأمثل لأمر الشراء الذي يترتب عليه تحمل المنشاة لأقل تكاليف مخزون ممكنة خلال الفترة..", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 54,
//   question:"تنخفض تكاليف اصدار أوامر الشراء مع الزيادة في حجم أمر الشراء.", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },

// {
//   numb: 55,
//   question:"تشمل تكاليف اصدار أوامر الشراء التكاليف النقل وتكاليف فحص وأستلام الوحدات المشتراه. ", 
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
//   ]
// },
// {
//   numb: 56,
//   question: "يعتبر المخزون الأمان وزمن الأنتظار  المخزون من العوامل الأساسية لتحديد نقطة أعادة الطلب.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 57,
//   question: " يؤدي زيادة مستوى مخزون الأمان إلى انخفاض تكاليف نفاذ المخزون",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 58,
//   question: "تكاليف نفاذ المخزون = أحتمال نفاذ المخزون &times; تكاليف المخزون ",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 59,
//   question: "تتميز نظم التشغيل اليدوية بأرتفاع نسبة التكاليف المتغيرة مقارنة بالتكاليف الثابتة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb:60,
//   question: "حجم التعادل في ظل نظام التشغيل الألي يكون أعلى من حجم التعادل في ظل نظام التشغيل اليدوي",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 61,
//   question: " تعتبر الموازنات التقديرية من أهم أدوات التخطيط والرقابة التي تستخدمها إدارة المنشأة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 62,
//   question: "يتم أعداد الموازنات التقديرية في المنشأت الصناعية والتجارية والخدمية , سواء كانت المنشأة مشروع فردي أو شركة خاصة أو جهة حكومية وسواء كانت تعمل في ظل نظام أشتراكي أو رأسمالي.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 63,
//   question: "تحتوي الموازنات التقديرية على معلومات تاريخية ذات طبيعة مالية",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 64,
//   question: "تنقسم الموازنات التقديرية طبقا لوحدة القياس المستخدمة في أعداداها الي موازنات ثابتة ومرنة.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 65,
//   question: "تعتبر موازنة المبيعات وموازنة الأنتاج من أمثلة الموازنات طويلة الأجل",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 66,
//   question: "تعتبر قائمة الدخل التقديرية أحد أنواع الموازنات الرأسمالية",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 67,
//   question: "عند أعداد موازنات منشأت الأعمال يتم تقدير الأيرادات أولا وفي ضوئها يتم تقدير النفقات , أما بالنسبة للموازنة العامة للدولة يتم تقدير النفقات أولا ثم يتم تدبير الأموال اللازمة لتغطية هذه النفقات.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 68,
//   question: " تتكون الموازنة الشاملة من موازنات العمليات الجارية باإلضافة إلى الموازنة الرأسمالية فقط",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 69,
//   question: "الموازنة الرأسمالية هي عبارة عن خطة الأنفاق الأستثماري للمنشأة لمدة سنة مالية",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 70,
//   question: " يتم إعداد موازنة التكاليف التمويلية والأدارية بناء على حجم الأنتاج المتوقع خلال فترات الموازنة",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// ];
// // Shuffle questions array
// questions.sort(function() {
//   return 0.5 - Math.random();
// });

// // Select the first 30 questions
// questions = questions.slice(0, 30);

