
// creating an array and passing the number, questions, options, and answers
let questions = [

{
  numb: 1,
  question:" ما هو التعريف الأنسب لتصميم برامج الحاسوب؟",
  answer:"عملية تحديد متطلبات النظام",
  options: [
    "عملية تحديد متطلبات النظام",
    "إنشاء واجهة المستخدم",
    " تطوير األجزاء الفرعية للبرنامج",
    "إعداد الجداول وقواعد البيانات",
  
  ]
},
{
  numb: 2,
  question:" أي من الخيارات التالية يشكل جز ًءا من مرحلة تخطيط تصميم برنامج",
  answer:"",
  options: [
    " كتابة الكود البرمجي",
    "اختيار لغة البرمجة المناسبة",
    "إجراء اختبارات الوحدات",
    "تصميم واجهة المستخدم ",
  
  ]
},
{
  numb: 3,
  question:"ماهو هدف مخطط تدفق البرامج(Flowchart)",
  answer:"",
  options: [
    " تحليل أداء البرنامج",
    "تصميم واجهة المستخدم",
    "تمثيل تسلسل الخطوات في البرنامج",
    " اختبار البرنامج ضد الهجمات اإللكترونية ",
  
  ]
},
{
  numb: 4,
  question:" أي مرحلة تأتي بعد كتابة الكود وقبل اختبار البرنامج؟",
  answer:"",
  options: [
    "التصحيح وإصالح األخطاء",
    "تصميم واجهة المستخدم",
    "توثيق البرنامج ",
    "تحديد متطلبات النظام ",
  
  ]
},
{
  numb: 5,
  question:"ماذا يعني مصطلح 'التجزئة(Decomposition)'في سياق تصميم البرمجيات",
  answer:"",
  options: [
    " تحويل البرنامج من  لغة واحدة إلى لغة أخرى",
    "تقسيم المشروع إلى أجزاء صغيرة قابلة للأدارة",
    " تحويل البرنامج من شكله الأصلي إلى شكل مبسط",
    " إضافة وحدات جديدة إلى البرنامج",
  
  ]
},
{
  numb: 6,
  question:"ماهو دور مخطط تدفق البيانات(DFD)في تصميم برامج الحاسوب",
  answer:"",
  options: [
    "تصميم واجهة المستخدم",
    " تحليل وتوثيق المتطلبات",
    " تمثيل تدفق البيانات بين المكونات",
    " كتابة الكود البرمجي",
  
  ]
},
{
  numb: 7,
  question:" ماذا يُقصد بمبدأ 'DRY' في تصميم البرمجيات؟",
  answer:"",
  options: [
    "'لا تكرر نفسك' -تجنب تكرار الكود",
    "'اكتب بسرعة وانته بسرعة' - تسريع عملية البرمجة",
    "'اعمل بجد ولا تتوقف' - تحقيق الأداء القصوي",
    "'اختصر الوقت والجهد' - استخدام أقصر مدة زمنية ممكنة",
  
  ]
},
{
  numb: 8,
  question:"ما هو الهدف من مرحلة اختبار الوحدات (Testing Unit)في تصميم البرمجيات؟",
  answer:"",
  options: [
    "ختبار التفاعل بين مكونات النظام",
    "اختبار النظام ككل قبل تسليمه",
    " اختبار كل مكون على حدة للتأكد من صحته",
    " اختبار البرنامج ضد هجمات القراصنة",
  
  ]
},
{
  numb: 9,
  question:"ما هو دور مخطط البرمجة (Pseudocode )في تصميم البرمجيات؟",
  answer:"",
  options: [
    "تصميم واجهة المستخدم",
    "تحديد متطلبات النظام ",
    "وصف خوارزميات البرنامج بلغة بسيطة ومفهومة",
    "كتابة الكود البرمجي",
  
  ]
},
{
  numb: 10,
  question:"ما هو مفهوم 'الأستمرارية' (Continity)في تصميم البرمجيات",
  answer:"",
  options: [
    " ضرورة استمرار عملية البرمجة دون توقف",
    "الحفاظ على استمرارية عمل النظام دون انقطاع ",
    " التأكد من استمرارية تشغيل النظام على مختلف األجهزة ",
    " تصميم واجهة مستخدم تسهم في تحسين استمرارية البرنامج",
  
  ]
},
{
  numb: 11,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},
{
  numb: 1,
  question:"",
  answer:"",
  options: [
    "",
    "",
    "",
    "",
  
  ]
},


];



// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});

// Select the first 30 questions
questions = questions.slice(0, 30);


