


// // creating an array and passing the number, questions, options, and answers
// let questions = [

// {
//   numb: 1,
//   question: "تعني سياسة التنويع ان تقوم المنظمات بأضافة منتج أو منتجات جديدة الي المنتج الحالي لها,او اضافة موديلات وأشكال جديدة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 2,
//   question: "تعني سياسة التنميط أنتاج وحدات ذات نوع وطراز وجودة معينة ومواصفات تم تحديدها مسبقا حيث يتم الأنتاج وفقا لمعايير أنتاجية موحدة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 3,
//   question: "يقصد بسياسة التنويع ان تتخصص المنظمة في أنتاج نوع واحد أو عدد محدود من أنواع السلع أو الخدمات المنتجة.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 4,
//   question: "تقتضي سياسة تصغير المنتجات زيادة أوزانها وتخفيض حجم الطاقة التي تسخدمها.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 5,
//   question: "يجب تقييم عائد المنتجات كل فترة زمنية للتعرف علي مدي مساهمة كل منتج في تحقيق أرباح المنظمة أو في تحميلها بالخسائر.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 6,
//   question: "يقصد بتقويم المنتجات تخفيض عدد وأنواع وأشكال السلع والخدمات التي تقوم المنظمة بأنتاجها.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 7,
//   question: "يقتصر دور سياسة أعادة المنتجات علي تحديد مساهمة كل منتج في تحقيق أرباح المنظمة أو في تحميلها بالخسائر.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 8,
//   question: "تعتبر سياسة التنويع وسياسة التبسيط وجهان لعملة واحدة.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 9,
//   question: "تعتبر سياسة تصغير المنتجات وسياسة تبسيط المنتجات وجهان لعملة واحدة.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 10,
//   question: "تتطلب سياسة تبسيط المنتجات تخفيض عدد وأنواع وأشكال السلع والخدمات التي تقوم المنظمات بأنتاجها.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 11,
//   question: "يعرف التنبؤ بالمبيعات بأنه القياس والتحديد الكمي-بالكميةأوالقيمة-لمنتجات المنظمة خلال فترة مستقبلية.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 12,
//   question: "تعتمد الأساليب الكمية في التنبؤ بالمبيعات علي البيانات التاريخية المتوفرة عن الظاهرة في أكتشاف نمط سلوكها والتنبؤ به في المستقبل. ",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 13,
//   question: "يعتبر أسلوب السلسلة الزمنية اتجاه عام من أبرز أساليب التنبؤ بالأنتاج في حالة الأنتاج المستمر.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 14,
//   question: "تعتمد الأساليب الوصفية في التنبؤ بالمبيعات علي الأستفادة من أراء وخبرات ذوي العلم والمعرفة في مجال الظاهرة المطلوب التنبؤ بها.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 15,
//   question: "يقتصر تحديد حجم الأنتاج في حالة أنتاج الطلبيات علي التكاليف الأجمالية للطلبية.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 16,
//   question: "يتم قبول أنتاج الطلبية حينما يتعادل الأيراد المتوقع من هذه الطلبية مع التكاليف المقدرة لتشغيلها.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 17,
//   question: "يعتبر الحجم الأقتصادي للدفعة الأنتاجية هو ذالك الحجم الذي تتعادل عنده كل من تكاليف الأعداد وتكاليف التخزين,وتكون التكاليف الأجمالية أكبر مايمكن.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 18,
//   question: "يقصد بتكلفة الأعداد التكلفة التي تتحملها المنظمة عند البدء في الانتاج,والتي تعتبر من التكاليف الثابتة بالنسبة لكل دفعة انتاجية ايا كان حجمها.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 19,
//   question: "تتزايد تكاليف التخزين بزيادة الدفعة الانتاجية لذا فهي تتسم بالتغير علي خلاف تكلفة الاعداد التي تتصف بالثبات.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 20,
//   question: "يؤثر في تحديد حجم الدفعة الأنتاجية نوعين من التكاليف وهما تكاليف الأعداد وتكاليف التخزين.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 21,
//   question: "يشير نظام الأنتاج الكبير الي انتاج المنتجات النمطية بكميات كبيرة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 22,
//   question: "تتميز نظم التركيز علي المنتج بأنتاج منتجات بكميات هائلة,وعلي درجة عالية من النمطية.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 23,
//   question: "كلما زادت عدد الوحدات المنتجة,كلما أنخفض تكلفة الوحدة الواحدة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },


// {
//   numb: 24,
//   question: "تتميز نظم الأنتاج حسب الطلب بالأنتاج بناء علي الكميات المطلوبة من العملاء وبالمواصفات التي يحددوها.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 25,
//   question: "تهدف نظم التركيز علي التخصيص الشامل الي أشباع رغبات خاصة بالعملاء, حيث يتم تلبية الحاجات الفريدة للعملاء بالكميات الكبيرة, وبتكاليف منخفضة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 26,
//   question: "يقتصر تصنيف أنواع نظم الأنتاج علي أساس تطورها التكنولوجي الي نظم الأنتاج اليدوية والألية.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 27,
//   question: "تنقسم أنواع نظم الأنتاج طبقا لنوع المنتج الي نظم التي تنتج السلع,والنظم التي تنتج خدمات.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 28,
//   question: "يمكن نقل السلع المادية الملموسة من مكان لأخر, ويمكن تحويل ملكيتها,ولكن لا يتزامن أنتاجها مع استهلاكا.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 29,
//   question: "تهتم النظم التي تنتج الخدمات بأنتاج المنتجات غير المادية وغير الملموسة,والتي لا يمكن  تحويل ملكيتها , الأ أن وقت أنتاجها يتزامن مع وقت أستهلاكها.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 30,
//   question: "يتم أنتاج منتج واحد ضخم ومعقد التركيب رغم قصر حياته في ظل نظم المشروع.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 31,
//   question: "تعكس الأنتاجية كفاء استخدام المدخلات من مختلف الموارد في تحقيق الأنتاج الكلي للمنظمة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 32,
//   question: "يقصد بالكفاء نسبة الأنتاج الفعلي(المخرجات الفعلي) الي انتاج المتوقع(الأنتاج المعياري).",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 33,
//   question: "يقصد بالأنتاجية أجمالي عدد الوحدات التي تنتجها المنظمة خلال فترة زمنية معينة, وسواء كان ذالك مقاسا في شكل وحدات,أو في شكل قيمة.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 34,
//   question: "اذا ركزت المنظمة علي قياس مخرجاتها بالكمية أو القيمة,فأن ذالك يطلق عليه الأنتاج وليس الأنتاجية.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 35,
//   question: "اذا حققت المنظمة كلا من الكفاءة والفعالية معا,فأنها بذالك تكون حققت الأنتاجية.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 36,
//   question: "تسعي ادارة الجودة الشاملة لخلق ثقافة متميزة لأداء العمل الصحيح بالشكل الصحيح لمقابلة احتياجات جميع العملاء سواء الداخليين أو الخارجيين.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 37,
//   question: "يعتبر تعبئة خبرات القوي العاملة بالمنظمة وتوجهها نحو رفع مستوي جودة المنتجات من مبادئ أدارة الجودة الشاملة.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 38,
//   question: "يجب النظر لعمليات الفحص باعتبارها تصيدا للأخطاء بغية معاقبة المسؤل عنها.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 39,
//   question: "تقتصر اساليب وطرق الفحص علي أسلوب الفحص الشامل لجميع الوحدات المنتجة.",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 40,
//   question: "يعتبر الفحص أعم وأشمل من العمليات التفتيش,ومع ذالك فأن نظام الفحص يعتبر مكملا لعمليات التفتيش.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// ];



// // Shuffle questions array
// questions.sort(function() {
//   return 0.5 - Math.random();
// });

// // Select the first 30 questions
// questions = questions.slice(0, 30);


