// creating an array and passing the number, questions, options, and answers
let questions = [

    // 1
    {
      numb: 1,
      question:"ادارة الموراد البشرية هي مجموعة من الممارسات والاجراءت التي تهدف الي ادارة العاملين داخل المنظمة بشكل فعال",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
        
      ],
    },
  
  
    // 2
    {
      numb: 2,
      question: "ادارة شئون العاملين اهم واشمل من ادارة الموارد البشرية",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 3
    {
      numb: 3,
      question: "تعمل ادارة الموارد البشرية بمعزل عن باقي الاقسام داخل المنظمة",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 4
    {
      numb: 4,
      question: "يقتصر دور ادارة الموارد البشرية علي الاختيار والتعيين والرقابة فقط",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 5
    {
      numb: 5,
      question: "تعمل ادارة الموارد البشرية علي دعم تحقيق اهداف المنظمة بكفاءة وفعالية من خلال توظيف الموظفين المناسبين وتطوير مهاراتهم وتحفيزهم",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 6
    {
      numb: 6,
      question: "تساهم ادارة الموارد البشرية في تعزيز الاداء العملي وزيادة انتاجية الموظفين",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 7
    {
      numb: 7,
      question: "تعمل ادارة شئون العاملين علي تعزيز العلاقات بين الموظفين وتحسين مناخ العمل في المنظمة",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 8
    {
      numb: 8,
      question: "تساهم ادارة الموارد البشرية في تحفيز الابتكار والابداع لدي الموظفين",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 9
    {
      numb: 9,
      question: "تساهم ادارة شئون العاملين في تعزيز التنافسية ونجاح المنظمة في السوق",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 10
    {
      numb: 10,
      question: "تعتبر ادارة الموارد البشرية عنصر حيوي لنجاح اي منظمة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 11
    {
      numb: 11,
      question: "تعتبر ادارة العليا حلقة الوصل بين الادارات المختلفة داخل المنظمة",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 12
    {
      numb: 12,
      question: "العوامل الديموغرافية والاتجاهات السوقية والتطورات التكنولوجيا تؤثر علي احتياجات الموارد البشرية للمنظمة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 13
    {
      numb: 13,
      question: "تحليل الاحتياجات البشرية الهدف منه هو ضمان توفير الكفاءات الموارد البشرية اللازمة لتحقيق اهداف المنظمة في المستقبل",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 14
    {
      numb: 14,
      question: "يجب ان تكون البرامج التدريبية متنوعة وموجهة نحو تحقيق اهداف المنظمة وتلبية احتياجات الموظفين",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 15
    {
      numb: 15,
      question: "تحليل وتطوير هيكل الوظائف يشمل تحديد المسميات الوظيفية والمهام المناسبة لكل وظيفة  بهدف ذلك الي تحسين كفاءة العمل وتحديد الاحتياجات الوظيفية المستقبلية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 16
    {
      numb: 16,
      question: "يجب ان تكون نظم المكافأت المزايا متوازنة وعادلة ومحفزة لتحقيق افضل النتائج",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 17
    {
      numb: 17,
      question: "تقييم اداءة تخطيط الموراد البشرية يلبي احتياجات المنظمة ويهدف ذلك الي تحديد نقاط القوة والضعف وتحسين العمليات المستقبلية",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 18
    {
      numb: 18,
      question: "يتم تحديد نقاط القوية التي تميز عمليات تخطيط الموارد البشرية وتسهم في تحقيق اهداف المنظمة بصرف النظر عن نقاط الضعف",
      answer: "خطأ",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 19
    {
      numb: 19,
      question: "تطوير استراتيجيات التوظيف والتعيين يمثل خطوة حاسمة في عملية ادارة الموارد البشرية, حيث يهدف جذب واختيار الموظفين الانسب لتلبية احتياجات المنظمة وتحقيق اهدافها بشكل فعال",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 20
    {
      numb: 20,
      question: "يعتبر تحليل الاستباقي للتطورات التكنولوجيا جزاء مهما من عملية تحليل الاحتياجات البشرية ويتضمن هذا التحليل دراسة التكنولوجيا الحالية المستقبلية التي قد تؤثر علي العمليات والوظائف داخل المنظمة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
    // 21
    {
      numb: 21,
      question: "يتطلب تصميم نظم المكافأت والمزايا القيام بعمليات تقييم دورية وتحليل لأدائها,وذلك لتحديد نقاط القوة والضعف وتحسين النظام بما يتوافق مع تطلعات الموظفين وأهداف المنظمة",
      answer: "صح",
      options: [
        "صح",
        "خطأ",
      ],
    },
   // 22
   {
    numb: 22,
    question: "لا يوجد فرق بين البدلات والمزايا الاضافية والحوافز والمكافأت",
    answer: "خطأ",
    options: [
      "صح",
      "خطأ",
    ],
  },
  
  // 1
  {
    numb: 23,
    question: "......تشير الي العمليات والممارسات التي تهدف الي ادارة العاملين في المنظمات الشركات بشكل فعال وفعالية يتضمن ذلك جميع النشاطات المتعلقة بتوظيف وتطوير وتحفيز وادارة والحفاظ علي العاملين في المنظمة",
    answer: "ادارة الموارد البشرية",
    options: [
      "الادارة المالية",
      "ادارة الانتاج والعمليات",
      "ادارة الجودة الشاملة",
      "ادارة الموارد البشرية",
    ],
  },
  // 2
  {
    numb: 24,
    question: "......عنصر يركز علي فهم احتياجات الموراد البشرية للمنظمة في المستقبل,يشمل دراسة العوامل الديموغرافية,والاتجاهات السوقية,والتطورات التكنولوجية التي قد تؤثر علي احتياجات الموارد البشرية",
    answer: "تحليل الاحتياجات البشرية",
    options: [
      "تصميم الوظائف",
      "تصميم نظم المكافأت والمزايا",
      "تحليل الاحتياجات البشرية",
      "تحليل البيانات وتقييم الاداء",
    ],
  },
  // 3
  {
    numb: 25,
    question: "يشمل تحديد متطلبات الوظائف المستقبلية وتطوير أساليب فعالة لجذب المواهب واختيارها وتوظيفها في المنظمة",
    answer: "تطوير استراتيجيات التوظيف والتعيين",
    options: [
      "الامتيازات والمكافأت الخاصة",
      "تطوير استراتيجيات التوظيف والتعيين",
      "ادارة الاداء والتقييم",
      "البدلات والمزايا الاضافية",
  
    ],
  },
  // 4
  {
    numb: 26,
    question: "......عنصر يهدف الي تطوير برامج تدريبية مخصصة تعمل علي تطوير مهارات وقدرات الموظفين وتعزيز ادائهم",
    answer: "تطوير برامج التدريب والتطوير",
    options: [
      "تطوير برامج التدريب والتطوير",
      "البدلات والمزايا الاضافية",
      "ادارة التعويضات الاستثنائية",
      "الحوافز والمكافأت",
    ],
  },
  // 5
  {
    numb: 27,
    question: "......يتطلب هذا العنصر تحيلا دقيقا لهيكل الوظائف داخل المنظمة,بما في ذلك تحديدات المسميات الوظيفية والمهام المناسبة لكل وظيفة",
    answer: "تحليل وتطوير هيكل الوظائف",
    options: [
      "الامتيازات والمكافأت الخاصة",
      "تطوير استراتيجيات التوظيف والتعيين",
      "ادارة الاداء والتقييم",
      "تحليل وتطوير هيكل الوظائف",
    ],
  },
  // 6
  {
    numb: 28,
    question: "يبدأ عملية جذب واختيار الموظفين بفهم متطلبات الوظيفة بدقة,ويتضمن ذلك تحديد المهام والمسؤوليات المطلوبة للوظيفة لأدائها بفاعلية.......هذا التحليل يساعد في تحديد نوع الشخص المناسب للوظيفة",
    answer: "تحليل الوظائف",
    options: [
      "تطوير استراتيجيات التوظيف والتعيين",
      "تقديم التغذية الراجعة والتوجيه",
      "ادارة الاداء والتقييم",
      "تحليل الوظائف",
    ],
  },
  // 7
  {
    numb: 29,
    question: "......هو عملية دراسة وتحليل المهام والواجبات التي تتضمنها وظيفة معينة في المنظمة",
    answer: "تحليل الوظائف",
    options: [
      "تحليل الوظائف",
      "الحوافز والمكافأت",
      "تحليل الاحتياجات البشرية",
      "تحليل البيانات وتقييم الاداء",
    ],
  },
  // 8
  {
    numb: 30,
    question: "يشير.......الي تشكيل هذه المهام والواجبات بطريقة تلبي احتياجات المنظمة والموظفين",
    answer: "تصميم الوظائف",
    options: [
      "تصميم الوظائف",
      "الحوافز والمكافأت",
      "تحليل الاحتياجات البشرية",
      "تحليل البيانات وتقييم الاداء",
    ],
  },
  // 9
  {
    numb: 31,
    question: "يتم تحديد الفجوات في الوظائف والمهارات المطلوبة لسد هذه الفجوات",
    answer: "تحديد الاحتياجات للتوظيف",
    options: [
      "تحليل البيانات وتقييم الاداء",
      "الامتيازات والمكافأت الخاصة",
      "تحديد الاحتياجات للتوظيف",
      "البدلات والمزايا الاضافية",
    ],
  },
  // 10
  {
    numb: 32,
    question: "اي مما يلي ليس من ضمن توظيف وتدريب العاملين",
    answer: "تصميم الوظائف",
    options: [
      "تصميم الوظائف",
      "اعداد الوظائف والاعلان عنها",
      "تقييم اداء الموظفين الجدد",
      "استقبال الطلبات واختيار المرشحين",
    ],
  },
  // 11
  {
    numb: 33,
    question: "اي مما يلي ليس من ضمن عملية تقييم الاداء",
    answer:"تحليل الوظائف",
    options: [
      "تحديد المعايير الاساسية للأداء",
      "تحليل الوظائف",
      "تقديم التغذية الراجعة والتوجيه",
      "اتخاذ القرارات الادارية",
    ],
  },
  // 12
  {
    numb: 34,
    question: "......يتم في هذا العنصر تحليل البيانات المجمعة وتقييم اداء كل موظف بناء علي المعايير المحدد مسبقا,ويهدف الي تحديد نقاط القوة والضعف والمجالات التي يمكن تحسين اداء الموظفين فيها",
    answer: "تحليل البيانات وتقييم الاداء",
    options: [
      "تحليل البيانات وتقييم الاداء",
      "الحوافز والمكافأت",
      "ادارة الاداء والتقييم",
      "تقديم التغذية الراجعة والتوجيه",
    ],
  },
  // 13
  {
    numb: 35,
    question: "......يتضمن هذا العنصر تقديم التغذية الراجعة للموظفين بشأن ادائهم,وتوجيههم لتحسين الاداء في المستقبل عبر أبداء الملاحظات البناءة وتوجيههم نحو الطرق الاكثر فعالية لتطوير ادائهم",
    answer: "تقديم التغذية الراجعة والتوجيه",
    options: [
      "البدلات والمزايا الاضافية",
      "تحليل الوظائف",
      "تحديد المعايير الاساسية للأداء",
      "تقديم التغذية الراجعة والتوجيه",
    ],
  },
  // 14
  {
    numb: 36,
    question: "......هذا العنصر يتضمن تقييم اداء الموظفين بأنتظام وتقديم التغذية الراجعة والتوجيه لتحسين الاداء.كما يتضمن اتخاذ القرارات المتعلقة بالترقيات والزيادات في الراتب استنادا الي اداء الموظفين",
    answer: "ادارة الاداء والتقييم",
    options: [
      "الحوافز والمكافأت",
      "الامتيازات والمكافأت الخاصة",
      "ادارة الاداء والتقييم",
      "ادارة التعويضات الاستثنائية",
    ],
  },
  // 15
  {
    numb: 37,
    question: "......هذا العنصر يتعامل مع التحديات الفردية للموظفين مثل زيادة الاجور,وتعديل الرواتب,ومعالجة الشكاوي المتعلقة بالتعويضات ويهدف هذا العمل الي ضمان العدالة والمساواة بين الموظفين وتحقيق توازن احتياجات الموظفين والمنظمة",
    answer: "ادارة التعويضات الاستثنائية",
    options: [
      "ادارة التعويضات الاستثنائية",
      "تحليل الاحتياجات البشرية",
      "تقديم التغذية الراجعة والتوجيه",
      "تحليل البيانات وتقييم الاداء",
    ],
  },
  // 16
  {
    numb: 38,
    question: ".......هذا العنصر يشمل تقديم الامتيازات والمكافأت الخاصة للموظفين الذين يسهمون بشكل بارز في نجاح المنظمة,مثل السفر بالطائرة الخاصة,والاقامة في الفنادق فاخرة,والمشاركة في برامج تدريبية مميزة",
    answer: "الامتيازات والمكافأت الخاصة",
    options: [
      "الامتيازات والمكافأت الخاصة",
      "تقديم التغذية الراجعة والتوجيه",
      "البدلات المزايا الاضافية",
      "تطوير استراتيجيات التوظيف والتعيين",
    ],
  },
  // 17
  {
    numb: 39,
    question: "......هذا العنصر يشير الي تقديم بدلات ومزايا اضافية للموظفين بجانب الاجور والرواتب الاساسية مثل بدلات السكن,النقل,وتأمين الصحة والتامين علي الحياة,تهدف هذه الميزة الي تحسين رفاهية الموظفين وزيادة رضاهم عن العميل",
    answer: "البدلات والمزايا الاضافية",
    options: [
      "ادارة الاداء والتقييم",
      "تطوير استراتيجيات التوظيف والتعيين",
      "الحوافز والمكافأت",
      "البدلات والمزايا الاضافية",
    ],
  },
  // 18
  {
    numb: 40,
    question: ".......هذا العنصر يتعلق بتقديم برامج تحفيزية ومكافأت مالية او غير مالية للموظفين كمكافأة عن اداء متميز او تحقيق أهداف معينة بهدف ذلك الي تعزيز الاداء وتحفيز الموظفين لتحقيق الاهداف المنظمة",
    answer: "الحوافز والمكافأت",
    options: [
      "تقديم التغذية الراجعة والتوجيه",
      "الحوافز والمكافأت",
      "تطوير استرتيجيات التوظيف والتعيين",
      "البدلات والمزايا الاضافية",
    ],
  },
  
    
  ];
  
  
  // Shuffle questions array
  questions.sort(function () {
    return 0.5 - Math.random();
  });
  
  // Select the first 30 questions
  // questions = questions.slice(0, 30);
  