
// creating an array and passing the number, questions, options, and answers
let questions = [

{
  numb: 1,
  question:" ما هو التعريف الأنسب لتصميم برامج الحاسوب؟",
  answer:"عملية تحديد متطلبات النظام",
  options: [
    "عملية تحديد متطلبات النظام",
    "إنشاء واجهة المستخدم",
    " تطوير الأجزاء الفرعية للبرنامج",
    "إعداد الجداول وقواعد البيانات",
  
  ]
},
{
  numb: 2,
  question:" أي من الخيارات التالية يشكل جزءا من مرحلة تخطيط تصميم برنامج",
  answer:"اختيار لغة البرمجة المناسبة",
  options: [
    " كتابة الكود البرمجي",
    "اختيار لغة البرمجة المناسبة",
    "إجراء اختبارات الوحدات",
    "تصميم واجهة المستخدم ",
  
  ]
},
{
  numb: 3,
  question:"ماهو هدف مخطط تدفق البرامج(Flowchart)",
  answer:"تمثيل تسلسل الخطوات في البرنامج",
  options: [
    " تحليل أداء البرنامج",
    "تصميم واجهة المستخدم",
    "تمثيل تسلسل الخطوات في البرنامج",
    " اختبار البرنامج ضد الهجمات اإللكترونية ",
  
  ]
},
{
  numb: 4,
  question:" أي مرحلة تأتي بعد كتابة الكود وقبل اختبار البرنامج؟",
  answer:"التصحيح وأصلاح الأخطاء",
  options: [
    "التصحيح وأصلاح الأخطاء",
    "تصميم واجهة المستخدم",
    "توثيق البرنامج ",
    "تحديد متطلبات النظام ",
  
  ]
},
{
  numb: 5,
  question:"ماذا يعني مصطلح 'التجزئة(Decomposition)'في سياق تصميم البرمجيات",
  answer:"تقسيم المشروع إلى أجزاء صغيرة قابلة للأدارة",
  options: [
    " تحويل البرنامج من  لغة واحدة إلى لغة أخرى",
    "تقسيم المشروع إلى أجزاء صغيرة قابلة للأدارة",
    " تحويل البرنامج من شكله الأصلي إلى شكل مبسط",
    " إضافة وحدات جديدة إلى البرنامج",
  
  ]
},
{
  numb: 6,
  question:"ماهو دور مخطط تدفق البيانات(DFD)في تصميم برامج الحاسوب",
  answer:" تمثيل تدفق البيانات بين المكونات",
  options: [
    "تصميم واجهة المستخدم",
    " تحليل وتوثيق المتطلبات",
    " تمثيل تدفق البيانات بين المكونات",
    " كتابة الكود البرمجي",
  
  ]
},
{
  numb: 7,
  question:" ماذا يقصد بمبدأ 'DRY' في تصميم البرمجيات؟",
  answer:"'لا تكرر نفسك' -تجنب تكرار الكود",
  options: [
    "'لا تكرر نفسك' -تجنب تكرار الكود",
    "'اكتب بسرعة وانته بسرعة' - تسريع عملية البرمجة",
    "'اعمل بجد ولا تتوقف' - تحقيق الأداء القصوي",
    "'اختصر الوقت والجهد' - استخدام أقصر مدة زمنية ممكنة",
  
  ]
},
{
  numb: 8,
  question:"ما هو الهدف من مرحلة اختبار الوحدات (Testing Unit)في تصميم البرمجيات؟",
  answer:" اختبار كل مكون على حدة للتأكد من صحته",
  options: [
    "ختبار التفاعل بين مكونات النظام",
    "اختبار النظام ككل قبل تسليمه",
    " اختبار كل مكون على حدة للتأكد من صحته",
    " اختبار البرنامج ضد هجمات القراصنة",
  
  ]
},
{
  numb: 9,
  question:"ما هو دور مخطط البرمجة (Pseudocode )في تصميم البرمجيات؟",
  answer:"وصف خوارزميات البرنامج بلغة بسيطة ومفهومة",
  options: [
    "تصميم واجهة المستخدم",
    "تحديد متطلبات النظام ",
    "وصف خوارزميات البرنامج بلغة بسيطة ومفهومة",
    "كتابة الكود البرمجي",
  
  ]
},
{
  numb: 10,
  question:"ما هو مفهوم 'الأستمرارية' (Continity)في تصميم البرمجيات",
  answer:"الحفاظ على استمرارية عمل النظام دون انقطاع ",
  options: [
    " ضرورة استمرار عملية البرمجة دون توقف",
    "الحفاظ على استمرارية عمل النظام دون انقطاع ",
    " التأكد من استمرارية تشغيل النظام على مختلف الأجهزة ",
    " تصميم واجهة مستخدم تسهم في تحسين استمرارية البرنامج",
  
  ]
},
{
  numb: 11,
  question:" ما هي المبادئ الأساسية لتصميم واجهة المستخدم الجيدة؟",
  answer:"تقليل عدد الخطوات المطلوبة الأتمام المهام",
  options: [
    " تعقيد الواجهة لزيادة الخصوصية",
    "تقليل عدد الخطوات المطلوبة الأتمام المهام",
    "زيادة عدد الألوان والصور لجعل الواجهة جذابة",
    "تجنب استخدام الرموز والرسوم البيانية",
  
  ]
},
{
  numb: 12,
  question:"ماذا يعني بمبدأ 'تقسيم العمل (Divide and Conquer)في تصميم البرمجيات'",
  answer:"تقسيم المشروع الكبير إلى مهام أصغر قابلة الأدارة",
  options: [
    "تقسيم الفريق إلى مجموعات صغيرة لزيادة الأنتاجية",
    "تقسيم المشروع الكبير إلى مهام أصغر قابلة الأدارة",
    "تقسيم الوقت بين البرمجة و الأختبار بنسب متساوية",
    "تقسيم المهام البرمجية إلى عمليات صغيرة لزيادة الأداء ",
  
  ]
},
{
  numb: 13,
  question:"ما هي أهمية توثيق البرمجيات؟",
  answer:"توفير تسجيل لعملية تطوير البرمجيات وتفاصيلها",
  options: [
    "تقليل حاجة المستخدمين للتدريب علي البرنامج",
    "ضمان أن المطورين فقط يمكنهم فهم الكود",
    "توفير تسجيل لعملية تطوير البرمجيات وتفاصيلها",
    "تحقيق التواصل مع المستخدمين دون الحاجة للتوثيق",
  
  ]
},
{
  numb: 14,
  question:"ماهو دور مخطط الكائنات (class Diagram) في تصميم البرمجيات",
  answer:"تمثيل العلاقات والهيكل البياني للكائنات المستخدمة في البرنامج",
  options: [
    "تحديد تسلسل  العمليات في البرنامج",
    "توثيق الأخطاء و المشكلات في البرنامج",
    "تمثيل العلاقات والهيكل البياني للكائنات المستخدمة في البرنامج",
    "تحليل الأداء والأمان في البرنامج",
  
  ]
},
{
  numb: 15,
  question:"ماهي أحد أسباب أعتماد مفهوم 'الوراثة'(inheritance)في برمجة الكائنات",
  answer:"تسهيل إنشاء كائنات جديدة دون الحاجة لبرمجة جديدة ",
  options: [
    " تجنب استخدام الكائنات الموروثة لتقليل الصراعات",
    "تسهيل إنشاء كائنات جديدة دون الحاجة لبرمجة جديدة ",
    " زيادة مساحة الذاكرة المستخدمة لتخزين الكائنات",
    "تقليل سرعة تنفيذ البرامج بسبب زيادة التعقيد",
  
  ]
},
{
  numb: 16,
  question:"ماهو دور مخطط تدفق البيانات (DFD) في تصميم برامج الحاسوب",
  answer:"تمثيل تدفق البيانات بين المكونات",
  options: [
    "تصميم واجهة المستخدم",
    "تحليل وتوثيق المتطلبات",
    "تمثيل تدفق البيانات بين المكونات",
    "كتابة الكود البرمجي",
  
  ]
},
{
  numb: 17,
  question:" ماذا يُقصد بمبدأ 'DRY' في تصميم البرمجيات؟",
  answer:  "'لا تكرر نفسك' -تجنب تكرار الكود",
  options: [
    "'لا تكرر نفسك' -تجنب تكرار الكود",
    "'اكتب بسرعة وانته بسرعة' - تسريع عملية البرمجة",
    "'اعمل بجد ولا تتوقف' - تحقيق الأداء القصوي",
    "'اختصر الوقت والجهد' - استخدام أقصر مدة زمنية ممكنة",
  
  ]
},
{
  numb: 18,
  question:"ما هو الهدف من مرحلة اختبار الوحدات (Testing Unit)في تصميم البرمجيات؟",
  answer:" اختبار كل مكون على حدة للتأكد من صحته",
  options: [
    "ختبار التفاعل بين مكونات النظام",
    "اختبار النظام ككل قبل تسليمه",
    " اختبار كل مكون على حدة للتأكد من صحته",
    " اختبار البرنامج ضد هجمات القراصنة",
  
  ]
},
{
  numb: 19,
  question:"ما هو دور مخطط البرمجة (Pseudocode)في تصميم البرمجيات؟",
  answer:"وصف خوارزميات البرنامج بلغة بسيطة ومفهومة",
  options: [
    "تصميم واجهة المستخدم",
    "تحديد متطلبات النظام ",
    "وصف خوارزميات البرنامج بلغة بسيطة ومفهومة",
    "كتابة الكود البرمجي",
  
  ]
},
{
  numb: 20,
  question:"ما هو مفهوم 'الأستمرارية' (Continity)في تصميم البرمجيات",
  answer:"الحفاظ على استمرارية عمل النظام دون انقطاع ",
  options: [
    " ضرورة استمرار عملية البرمجة دون توقف",
    "الحفاظ على استمرارية عمل النظام دون انقطاع ",
    " التأكد من استمرارية تشغيل النظام على مختلف الأجهزة ",
    " تصميم واجهة مستخدم تسهم في تحسين استمرارية البرنامج",
  
  ]
},
{
  numb: 21,
  question:" ما هي المبادئ الأساسية لتصميم واجهة المستخدم الجيدة؟",
  answer:"تقليل عدد الخطوات المطلوبة الأتمام المهام",
  options: [
    " تعقيد الواجهة لزيادة الخصوصية",
    "تقليل عدد الخطوات المطلوبة الأتمام المهام",
    "زيادة عدد الألوان والصور لجعل الواجهة جذابة",
    "تجنب استخدام الرموز والرسوم البيانية",
  
  ]
},
{
  numb: 22,
  question:"ماذا يعني بمبدأ 'تقسيم العمل (Divide and Conquer)في تصميم البرمجيات'",
  answer:"تقسيم المشروع الكبير إلى مهام أصغر قابلة الأدارة",
  options: [
    "تقسيم الفريق إلى مجموعات صغيرة لزيادة الأنتاجية",
    "تقسيم المشروع الكبير إلى مهام أصغر قابلة الأدارة",
    "تقسيم الوقت بين البرمجة و الأختبار بنسب متساوية",
    "تقسيم المهام البرمجية إلى عمليات صغيرة لزيادة الأداء ",
  
  ]
},
{
  numb: 23,
  question:"ما هي أهمية توثيق البرمجيات؟",
  answer:"توفير تسجيل لعملية تطوير البرمجيات وتفاصيلها",
  options: [
    "تقليل حاجة المستخدمين للتدريب علي البرنامج",
    "ضمان أن المطورين فقط يمكنهم فهم الكود",
    "توفير تسجيل لعملية تطوير البرمجيات وتفاصيلها",
    "تحقيق التواصل مع المستخدمين دون الحاجة للتوثيق",
  
  ]
},
{
  numb: 24,
  question:"ماهو دور مخطط الكائنات (class Diagram) في تصميم البرمجيات",
  answer:    "تمثيل العلاقات والهيكل البياني للكائنات المستخدمة في البرنامج",
  options: [
    "تحديد تسلسل العمليات في البرنامج",
    "توثيق الأخطاءوالمشكلات في البرنامج",
    "تمثيل العلاقات والهيكل البياني للكائنات المستخدمة في البرنامج",
    "تحليل الأداء والأمان في البرنامج",
  
  ]
},
{
  numb: 25,
  question:"ماهي أحد فوائد استخدام نمط 'المصنع'(factory pattern)في تصميم البرمجيات",
  answer:    "تمكين إنشاء كائنات بدون الحاجة للكشف عن تفاصيل الأنشاء",
  options: [
    "زيادة تعقيد الكود لزيادة الأداء",
    "تمكين إنشاء كائنات بدون الحاجة للكشف عن تفاصيل الأنشاء",
    "تقليل عدد الكلاسات في البرنامج",
    "تحسين واجهة المستخدم",
  
  ]
},
{
  numb: 26,
  question:"ماهو مفهوم'التحليل الهيكلي'(Structural Analysis) في تصميم البرمجيات",
  answer:    "تحليل التفاعلات بين مكونات البرنامج والعناصر الخارجية",
  options: [
    " تحليل البيانات المخزنة في قواعد البيانات",
    " تحليل ترتيب الأحداث في البرنامج",
    "تحليل التفاعلات بين مكونات البرنامج والعناصر الخارجية",
    " تحليل متطلبات النظام",
  
  ]
},
{
  numb: 27,
  question:"ماهو مفهوم 'المراجعة النظرية'(Code Review) في تصميم البرمجيات",
  answer:    "مراجعة الكود البرمجي من قبل زملاء المطورين للتحقق من الجودة و الأمان",
  options: [
    " البحث عن أخطاء البرمجة بواسطة البرمجيات الأليه",
    "مراجعة الكود البرمجي من قبل زملاء المطورين للتحقق من الجودة و الأمان",
    " تجميع الأكواد المختلفة في ملف واحد لسهولة الأدارة",
    "استخدام أكواد جاهزة من مصادر مفتوحة بدلا من البرمجة من الصفر",
  
  ]
},
{
  numb: 28,
  question:"ماهو مفهوم 'التصميم التفاعلي' (interactive Design) في تصميم البرمجيات",
  answer:    " تصميم واجهة تستجيب لألحداث والتفاعلات من المستخدمين",
  options: [
    " تصميم واجهة لا تتفاعل مع المستخدم",
    "تصميم واجهة تفاعلية تسمح للمستخدم بإدخال واستعراض البيانات",
    " تصميم واجهة تستجيب لألحداث والتفاعلات من المستخدمين",
    "تصميم واجهة مليئة بالألوان والصور ",
  
  ]
},
{
  numb: 29,
  question:"ماهو مفهوم 'التخزين المؤقت' (Caching) في تصميم البرمجيات",
  answer:    "حفظ نسخة من البيانات في ذاكرة مؤقتة لتسريع الوصول إليها",
  options: [
    "حذف البيانات من قاعدة البيانات بشكل دوري",
    "حفظ نسخة من البيانات في ذاكرة مؤقتة لتسريع الوصول إليها",
    " تخزين جميع البيانات في ملف واحد ",
    "تخزين البيانات الحساسة بشكل آمن في البرمجية",
  
  ]
},
{
  numb: 30,
  question:"ماهو مبدأ 'التكامل المستمر' (Continuous integration) في تصميم البرمجيات",
  answer:    "دمج تعديلات البرمجة بشكل متكرر واختبارها بشكل أوتوماتيكي",
  options: [
    "تكامل مصادر البرمجة بشكل مستمر دون اختبار",
    "دمج تعديلات البرمجة بشكل متكرر واختبارها بشكل أوتوماتيكي",
    "عدم دمج الأكواد حتى انتهاء مرحلة التطوير",
    "تكامل البرمجة مع المؤسسات الأخري",
  
  ]
},
{
  numb: 31,
  question:"ماهو مفهوم 'النمط المعماري' (Architectural pettern) في تصميم البرمجيات",
  answer:    "نمط تقني يحدد ترتيب وتفاعل المكونات في البرنامج ",
  options: [
    "تحليل نمطية البيانات في البرنامج",
    "نمط بصري يستخدم لتصميم واجهة المستخدم",
    "نمط تقني يحدد ترتيب وتفاعل المكونات في البرنامج ",
    "استخدام أنماط هندسية لتصميم البرمجيات",
  
  ]
},
{
  numb: 32,
  question:"ماهي أحد فوائد أستخدام مبدأ '(Don't Repeat Yourself)' DRY في تصميم البرمجيات",
  answer:    " تبسيط الكود وتقليل الأخطاء من خلال تجنب التكرار",
  options: [
    "تكرار الأكواد لزيادة الأمان",
    " تبسيط الكود وتقليل الأخطاء من خلال تجنب التكرار",
    "زيادة التعقيد من خلال استخدام أكواد متشابهة ",
    "تحسين أداء البرمجيات دون النظر للجودة",
  
  ]
},
{
  numb: 33,
  question:"ماهي أحد أسس مفهوم 'التفرع' (Branching) في نظم التحكم بالأصدارات (Version Control Systems)",
  answer:    "إنشاء نسخ من الأكواد لتجريب التعديلات دون التأثير على النسخة الرئيسية",
  options: [
    "تقسيم البرمجيات إلى فروع مستقلة للمستخدمين المختلفين ",
    " تخزين الأكواد في ملف واحد لسهولة الوصول إليها",
    "تحسين الأمان بتخزين الأكواد بشكل مشفر",
    "إنشاء نسخ من الأكواد لتجريب التعديلات دون التأثير على النسخة الرئيسية",
  
  ]
},
{
  numb: 34,
  question:"ماهي أهمية تعريف المشكلة بشكل واضح قبل البدء في حلها",
  answer:    " ضمان استيعاب جميع التفاصيل واالحتياجات",
  options: [
    " تجنب البدء في العمل",
    " تحسين التواصل بين أفراد الفريق",
    "تجنب الأخطاء أثناء التنفيذ",
    " ضمان استيعاب جميع التفاصيل واالحتياجات",
  
  ]
},
{
  numb: 35,
  question:"ماهو دور مرحلة 'تحليل المشكلة' في عملية حل المشكلات",
  answer:    "فهم وتحليل المشكلة وتحديد متطلبات الحل",
  options: [
    "تنفيذ الخطوات البرمجية اللزمة",
    " تحديد المصطلحات التقنية المستخدمة",
    "فهم وتحليل المشكلة وتحديد متطلبات الحل",
    "توثيق الحل بالتفاصيل التقنية",
  
  ]
},
{
  numb: 36,
  question:"ماهو مفهوم 'تقسيم المشكلة الي أجزاء' في سياق حل المشكلات",
  answer:    "تقسيم المشكلة الكبيرة إلى أجزاء أصغر يمكن تحليلها بشكل منفصل ",
  options: [
    "تجزئة المشكلة الي مشاكل أكثر تعقيدا",
    "تقسيم المشكلة الكبيرة إلى أجزاء أصغر يمكن تحليلها بشكل منفصل ",
    " تقسيم المشكلة إلى عوامل غير مترابطة",
    "تقسيم المشكلة فقط للبرمجة بلغا ت مختلفة",
  
  ]
},
{
  numb: 37,
  question:"ماهي أحد فوائد أستخدام تقنية 'الرسم البياني للمشكلة' (problem Diagram) في حل المشكلات",
  answer:    "تمثيل بياني للمشكلة يسهم في فهمها وتحليلها",
  options: [
    "تقليل الوقت المستغرق في حل المشكلات",
    "تمثيل بياني للمشكلة يسهم في فهمها وتحليلها",
    "اجراء اختبارات على الحلول المقترحة",
    "إجراء التعديلات على الحل بشكل سريع",
  
  ]
},
{
  numb: 38,
  question:"ماهو دور مفهوم 'الخوارزمية' (Algorithm) في حل المشكلات",
  answer:    "توصيف خطوات تنفيذ الحل بطريقة مرتبة ودقيقة",
  options: [
    "تصميم واجهة المستخدم للبرمجيات",
    "تحليل مشكلة بشكل تفصيلي ",
    "توصيف خطوات تنفيذ الحل بطريقة مرتبة ودقيقة",
    "تحديد التقنيات المناسبة للحل",
  
  ]
},
{
  numb: 39,
  question:"ماهو دور مفهوم 'التجربة والخطأ' (Trial and Error) في حل المشكلات",
  answer:    "تجريب مجموعة من الحلول المختلفة حتى يتم العثور على الحال المناسب",
  options: [
    "استخدام أول حلا يظهر",
    "تحديد المشكلة بدقة",
    "تجريب مجموعة من الحلول المختلفة حتى يتم العثور على الحال المناسب",
    "تجنب تقنيات البرمجة",
  
  ]
},
{
  numb: 40,
  question:"ماهي خطوات مفهوم 'التصميم' (Design) في عملية حل المشكلات",
  answer:    "تقسيم المشكلة إلى أجزاء وتصميم حلول مختلفة لها",
  options: [
    "تحديد المشكلة والبدء في كتابة الكود البرمجي",
    "تقسيم المشكلة إلى أجزاء وتصميم حلول مختلفة لها",
    "تجربة الحلول المختلفة بشكل عشوائي ",
    "توثيق الحل بدون التأكد من صحته",
  
  ]
},
{
  numb: 41,
  question:"ماهو مفهوم 'التحليل الزمني' (Time Complexity) في سياق حل المشكلات",
  answer:    " تقدير الوقت الذي يستغرقه حل المشكلة",
  options: [
    " تقدير الوقت الذي يستغرقه حل المشكلة",
    "تحديد الأخطاء في الحلول المقترحة",
    "توثيق الوقت الذي تمضيه المشكلة في الحل",
    "تحديد أكثر الحلول تكلفة",
  
  ]
},
{
  numb: 42,
  question:"ماهو دور مفهوم 'التحليل العملي' (Empirical Analysis) في سياق حل المشكلات",
  answer:    "تقدير النتائج المتوقعة من استخدام الحلول المختلفة",
  options: [
    " توثيق العمليات التي يجب اتباعها",
    "تحديد الحل الذي يستند إلى الخبرة فقط",
    "تقدير النتائج المتوقعة من استخدام الحلول المختلفة",
    "تحديد تقنيات البرمجة المناسبة",
  
  ]
},
{
  numb: 43,
  question:"ما هي أهمية مفهوم 'التقييم' (Assessment) في حل المشكلات",
  answer:    " تقدير فاعلية الحل في حل المشكلة المعينة ",
  options: [
    " التأكد من عدم وجود مشكلات في الحل",
    "تحسين أداء الحل ",
    " تقدير فاعلية الحل في حل المشكلة المعينة ",
    "تحديد األمور الفنية فقط دون النظر للجودة",
  
  ]
},
{
  numb: 44,
  question:"ماهي خطوات مفهوم 'التحليل الوظيفي' (functional Analysis) في عملية حل المشكلات",
  answer:    "تحليل الوظائف والمتطلبات المطلوب توفيرها بالحل ",
  options: [
    "تحليل الأخطاء في الحل المقترح",
    "تحليل الوظائف والمتطلبات المطلوب توفيرها بالحل ",
    "تجريب الحلول المختلفة وتقييمها",
    "تحليل الكود البرمجي بحثا عن أخطاء",
  
  ]
},
{
  numb: 45,
  question:"ماهو مفهوم 'تقييم الكفاءة' (Efficiency Evluation) في سياق حل المشكلات",
  answer:    "تحديد الحل الأكثر كفاءة من حيث استهلاك الموارد والوقت",
  options: [
    "قياس جودة الكود البرمجي",
    "تحديد الحل الأكثر كفاءة من حيث استهلاك الموارد والوقت",
    "تحليل التوازن بين التكلفة والفعالية",
    "قياس جودة الكود البرمجي",
  
  ]
},
{
  numb: 46,
  question:"ماهو مفهوم 'الأستمرارية (persistence) في حل المشكلات'",
  answer:    "الأستمرار في تطوير الحل بعد حل المشكلة الأساسية",
  options: [
    "لتواصل المستمر مع الفريق خلال عملية حل المشكلة",
    "الأستمرار في محاولة حل المشكلة بشكل مستمر حتى النجاح",
    "الأستمرار في تطوير الحل بعد حل المشكلة الأساسية",
    "االأستمرار في استخدام الحل المؤقت حتى تجد حلا نهائيًا",
  
  ]
},
{
  numb: 47,
  question:"ماهو مفهوم 'الأختبار والتحقق' (Testing and verification) في حل المشكلات",
  answer:    " التحقق من صحة الحل من خلال اختبارات متعددة",
  options: [
    "اختبار الحلول المختلفة بشكل مفصل",
    " التحقق من صحة الحل من خلال اختبارات متعددة",
    " استخدام تقنيات التجربة والخطأ للتحقق من الحل ",
    "توثيق الحل بشكل تفصيلي",
  
  ]
},
{
  numb: 48,
  question:"ماهي أهمية مفهوم 'التجميع والتركيب' (Assembly and integration) في حل المشكلات",
  answer:    " تجميع الأكواد المختلفة إلى برنامج واحد",
  options: [
    "تحليل وتجميع البيانات المستخدمة في الحل",
    " تجميع الأكواد المختلفة إلى برنامج واحد",
    "تجميع أفكار مختلفة للحصول على حل نهائي",
    " تجميع الحلول المختلفة لتطوير نموذج نهائي",
  
  ]
},
{
  numb: 49,
  question:"ماهو مفهوم 'التحسين' (Optimization) في سياق حل المشكلات",
  answer:    "تحسين الحل من خلال تطويره ليكون أكثر كفاءة وفاعلية",
  options: [
    "تجنب الحلول الضعيفة",
    "تحسين الحل من خلال تطويره ليكون أكثر كفاءة وفاعلية",
    "تحسين الحل بتطوير واجهة المستخدم فقط ",
    "تحسين الحل بزيادة التعقيد والتفاصيل ",
  
  ]
},
{
  numb: 50,
  question:"ماهو دور مفهوم 'الأبتكار' (inovayion) في حل المشكلات",
  answer:    "تجربة حلول جديدة ومبتكرة للمشكلة",
  options: [
    "استخدام نفس الحلول المعروفة دائما",
    "تجربة حلول جديدة ومبتكرة للمشكلة",
    "تقليل التفكير الأبداعي واستخدام الحلول التقليدية",
    "الأعتماد على الحلول القديمة دون تطويرها",
  
  ]
},


];



// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});

// Select the first 30 questions
questions = questions.slice(0, 30);


