 


// // creating an array and passing the number, questions, options, and answers
// let questions = [
//   {
//   numb: 1,
//   question: "ادى ظهور انظمة الذكاء الأصطناعي وعصر المعلومات الي إعادة النظر الي اعمال",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },

// {
//   numb: 2,
//   question: "ادى ظهور نظام المعلومات المبني علي الحاسب الألي الي إعادة هيكله الأقسام داخل المؤسسات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 3,
//   question: "يعتبر تطوير المؤسسات بصورة فعالة ورشيدة علي توفير المعلومات بالدقة والسرعه والشكل المطلوب",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 4,
//   question: " تعتبر المعلومات هي الركيزة الأساسية لأتخاذ القرارات الرشيدة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 5,
//   question: "تعتبر المعلومات مورد من موارد الأستراتيجية التي لا يمكن الأستغناء عنها داخل المؤسسة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 6,
//   question: "يتم تخزين المعلومات في الملفات داخل قواعد البيانات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 7,
//   question: "كل ملف في قاعدة البيانات يحتوي علي جدول واحد او مجموعه من الجداول ",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 8,
//   question: " اصبحت المعلومات هي العصب المحرك الي نشاط يقوم به الفرد",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 9,
//   question: "تعتبر المعلومات التي تشكل الميزة التنافسية معلومات استراتيجية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 10,
//   question: "المعلومات التي تمثل ميزة تنافسية معلومات خاصه غير عامه",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 11,
//   question: "تعتبر علاقة المعلومات بتطور الحاسب الألي علاقة عكسية",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 12,
//   question: "تعتبر المعلومات هي المورد الأستراتيجي في مجتمع اقتصاد المعلومات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 13,
//   question: "سمي موظف المعلومات في العصر السابق بموظفي الأرشيف",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 14,
//   question: "تشتمل معلومات الوسائط المتعددة علي عنصريين مختلفين او اكثر ",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 15,
//   question: "يجب ان تكون المعلومات جاهزة في الوقت المناسب لأتخاذ قرارات رشيدة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 16,
//   question: "يمكن تصنيف البيانات قبل تجميعها",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 17,
//   question: "المعلومات = البيانات + المعني",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 18,
//   question: "المعرفه = المعلومات المختزنه + القدرة علي استعمال المعلومات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 19,
//   question: "البيانات تعكس الحقائق اما المعلومات عبارة عن تدفق البيانات والمعرفه هي المخزون الذي يمكن تمثيله بالقاعدة المعرفه",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 20,
//   question: "يتم التنبوء بالمعلومات المستقبلية من خلال دراسة المعلومات الحالية والسابقة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 21,
//   question: "الشبكات العصبية الصناعية هي محاكاة لما يحدث في عقل الأنسان",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 22,
//   question: "يتكون المخ البشري من عدد كبير جدا من الخلايا العصبية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 23,
//   question: "تتكون الشبكات العصبية الصناعية من عدد من الخلايا العصبية الصناعية وهذا العدد يتوقف علي طبيعة ونوع المشكلة التي ستقوم الشبكه بحلها",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 24,
//   question: " يمكن تمثيل الخلايا العصبية الصناعية اما باستخدام الدوائر الألكترونية او عن طريق عمل محاكاه لها بستخدام لغات الحاسب الألي",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 25,
//   question: "عند تصميم الشبكات العصبية باستخدام الدوائرالألكترونية يجب استخدام اقل عدد ممكن من الخلايا العصبية الصناعية لحل المشكله وذالك للتوفير في في مكونات الدوائر المستخدمة وايضا لوفير في كمية الطاقة المستهلكة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb:26,
//   question: "عند تمثيل الشبكات العصبية باستخدام لغات الحاسب الألي فيجب استخدام اقل عدد ممكن من الخلايا العصبية الصناعية وذلك لتقليل في وقت تنفيذ البرامج",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb:27,
//   question: "عند تنفيذ اي خوارزم بالدوائر الألكترونية فإن ذلك يكون اسرع من عمل محاكاه لهذه الخورزميات بستخدام لغات الحاسب الألي",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 28,
//   question: "البيانات التي سيتم التنبوء بها بيانات مستقبلية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 29,
//   question: "تستخدم الشبكات العصبية في اجراء عمليات تشخيص الأمراض",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 30,
//   question: "معني Learning Supervised هو وجود مقياس يحدد مدى الوصول الي قيمه المخرجات المطلوبة من عدمه",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 31,
//   question: "تتكون الخلية العصبية من مجموعه من االوزان بالأضافه الي داله غير خطية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 32,
//   question: "المعادلة الأتية تمثل مجموع حاصل ضرب المدخلات في الأوزان z=I1w1+I2w2......+INWN",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 32,
//   question:"تستخدم القياسات الحيوية في التعرف علي الأشخاص",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
  
//   ]
// },
// {
//   numb: 33,
//   question:"يقوم نظام المعلومات المبني علي الحاسب الألي بإمداد متخذ القرار بالمعلومات اللزمة في .... ",
//   answer:"كل ما سبق",
//   options: [
//     "معلومات موجزة",
//     "معلومات تفصيلية في شكل تقارير",
//     "كل ما سبق",
//     "لا شئ مما سبق",
//   ]
// },
// {
//   numb: 34,
//   question:"مكونات نظام المعلومات المبني علي الحاسب الألي",
//   answer:"كل ما سبق",
//   options: [
//     "الهارد ويير",
//     "السوفت ويير",
//     "قاعدة البيانات",
//     "كل ما سبق",
//   ]
// },

// {
//   numb: 35,
//   question:"مكونات نظام المعلومات المبني علي الحاسب الألي",
//   answer:"كل ما سبق",
//   options: [
//     "المبرمجين",
//     "الحاسوب",
//     " شبكة التواصل",
//     "كل ما سبق",
//   ]
// },

// {
//   numb: 36,
//   question:"يتم الحصو ل علي المعلومات من خلال ......البيانات",
//   answer:"كل ما سبق",
//   options: [
//     "تشغيل",
//     "معالجة",
//     " شبكة التواصل",
//     "كل ما سبق",
//   ]
// },
// {
//   numb: 37,
//   question:" يتم الحصو ل علي المعلومات من خلال ......البيانات",
//   answer:"كل ما سبق",
//   options: [
//     "تشغيل",
//     "معالجة",
//     "ترتيب وتصنيف",
//     "كل ما سبق",
  
//   ]
// },
// {
//   numb: 38,
//   question:"تمثل المعلومات الميزة ......التي تتمتع بها اي مؤسسة اوشركة",
//   answer:"تنافسية",
//   options: [
//     "افتراضية",
//     "تماثلية",
//     "تناظرية",
//     "تنافسية",
  
//   ]
// },
// {
//   numb: 36,
//   question:"المعلومات التقليدية عبارة عن.",
//   answer:"كل ما سبق",
//   options: [
//     "حروف",
//     "أرقام",
//     "كل ما سبق",
//     "علامات خاصة",
  
//   ]
// },
// {
//   numb: 37,
//   question:"اقتصاد المعلومات هو ........",
//   answer:"كل ما سبق",
//   options: [
//     "تقليل التكاليف مما يدل علي سهولة الحصول عليها ",
//     "سهولة المعالجة معها في وقت قصير",
//     "كل ما سبق",
//     "سهولة الحصول عليها",
  
//   ]
// },
// {
//   numb: 38,
//   question:"تشمل المعلومات الحديثة علي",
//   answer:"كل ما سبق",
//   options: [
//     "ملفات الصوت",
//     "ملفات الصور",
//     "كل ما سبق",
//     "ملفات الفيديو",
  
//   ]
// },
// {
//   numb: 39,
//   question:" تعتبر المعلومات موردا من موارد المنشأه مثل ...... ",
//   answer:"كل ما سبق",
//   options: [
//     "رأس المال",
//     "الموارد البشرية",
//     "كل ما سبق",
//     "العنصر البشري",
  
//   ]
// },
// {
//   numb: 40,
//   question:" يتم جمع البيانات من مختلف المصادر مثل .",
//   answer:"كل ما سبق",
//   options: [
//     "القرارات الحكومية",
//     "المنافسين",
//     "كل ما سبق",
//     "الأدارات والوحدات",
  
//   ]
// },
// {
//   numb: 41,
//   question:"يتم جمع البينات من مختلف المصادر مثلا .",
//   answer:"كل ما سبق",
//   options: [
//     "العملاء",
//     "الموردين",
//     "كل ما سبق",
//     "لاشئ مماسبق",
  
//   ]
// },
// {
//   numb: 42,
//   question:"يتم تخزين واسترجاع المعلومات لتوزيعها علي .",
//   answer:"كل ما سبق",
//   options: [
//     "الموظفين",
//     "العملاء",
//     "كل ما سبق",
//     "متخذي القرار",
  
//   ]
// },
// {
//   numb: 43,
//   question:"عيوب النظام اليدوي .",
//   answer:"كل ما سبق",
//   options: [
//     "صعوبة تخزين واسترجاع البيانات",
//     "البطئ في الحصول علي المعلومات",
//     "كل ما سبق",
//     "امكانيات حدوث أخطاء وصعوبة أكتشافها",
  
//   ]
// },
// {
//   numb: 44,
//   question:"عيوب نظام المعلومات اليدوي .",
//   answer:"كل ما سبق",
//   options: [
//     "امكانية حدوث تزوير",
//     "امكانية حدوث فقد للمعلومات المختزنة",
//     "كل ما سبق",
//     "امكانية حدوث أخطاء وصعوبة اكتشافها",
  
//   ]
// },
// {
//   numb: 45,
//   question:"من مميزات النظام المعلومات المبني علي الحاسب الألي......",
//   answer:"كل ما سبق",
//   options: [
//     "سهولة التحقق من صحه المعلومة واختبارها",
//     "السرعه في تخزين واسترجاع البيانات",
//     "كل ما سبق",
//     "سهولة أكتشاف  الأخطاء",
  
//   ]
// },
// {
//   numb: 46,
//   question:" يعتمد نظام المعلومات اليدوي علي ......",
//   answer:"كل ما سبق",
//   options: [
//     "اوراق",
//     "سجلات",
//     "كل ما سبق",
//     "دفاتر",
  
//   ]
// },
// {
//   numb: 47,
//   question:"مميزات نظام المعلومات المبني علي الحاسب الألي.",
//   answer:"كل ما سبق",
//   options: [
//     "امكانية عمل نسخ احتياطية للبيانات",
//     "توفير درجة امان عالية",
//     "كل ما سبق",
//     "صعوبة تزوير البيانات المختزنه",
  
//   ]
// },
// {
//   numb: 48,
//   question:"من عيوب نظام المعلومات المبني علي الحاسب الألي .",
//   answer:"كل ما سبق",
//   options: [
//     "التكلفة المادية المطلوبة لعمل نظام",
//     "الأحتياج الي وقت لإلنتقال من نظام المعلومات اليدوي الي نظام المعلومات الحاسب الألي",
//     "كل ما سبق",
//     "تحتاج الي وقت لتدريب الموظفين",
  
//   ]
// },
// {
//   numb: 49,
//   question:"المعلومات = .",
//   answer:" البيانات + المعني",
//   options: [
//     " البيانات – المعني",
//     " البيانات + المعني",
//     " البيانات * المعني",
//     " البيانات / المعني",
  
//   ]
// },
// {
//   numb: 50,
//   question:"المعرفة = .....",
//   answer:" المعلومات المختزنة + القدرة علي استعمال المعلومات",
//   options: [
//     "المعلومات المختزنة – القدرة علي استعمال المعلومات",
//     " المعلومات المختزنة + القدرة علي استعمال المعلومات",
//     "المعلومات المختزنة × القدرة علي استعمال المعلومات",
//     "المعلومات المختزنة ÷ القدرة علي استعمال المعلومات",
  
//   ]
// },
// {
//   numb: 51,
//   question:"يمكن تصنيف المعلومات وفقا للزمن كالأتي .",
//   answer:"كل ما سبق",
//   options: [
//     "معلومات تاريخية",
//     "معلومات مسنقبلية",
//     "كل ما سبق",
//     "معلومات حالية",
  
//   ]
// },
// {
//   numb: 52,
//   question:"يمكن استخدام الشبكات العصبية الصناعية لأجراء عمليات التنبوء عن طريق تعليمها علي البيانات .......",
//   answer:"تاريخية / حالية ",
//   options: [
//     "تاريخية / حالية ",
//     "مستقبلية",
//     "كل ما سبق",
//     "لا شئ مماسبق",
  
//   ]
// },
// {
//   numb: 53,
//   question:"من انواع التعلم .",
//   answer:"كل ما سبق",
//   options: [
//     "Supervised Learning",
//     "Unsupervised Learning",
//     "كل ما سبق",
//     "لا شئ مماسبق",
  
//   ]
// },
// {
//   numb: 54,
//   question:"تستخدم الشبكات العصبيه في .......",
//   answer:"كل ما سبق",
//   options: [
//     "التعرف علي الأشخاص",
//     " عمليات التنبوء",
//     "كل ما سبق",
//     "التعرف علي العيوب في المنتجات",
  
//   ]
// },

// {
//   numb: 55,
//   question:" من طرق التقليدية المستخدمة للتعرف علي الأشخاص..... ",
//   answer:"البطاقات",
//   options: [
//     "البطاقات",
//     "بصمة الأصبع",
//     "كل ما سبق",
//     "بصمة الوجه",
  
//   ]
// },
// {
//   numb: 56,
//   question:"من الطرق الحديثة المستخدمة للتعرف علي الأشخاص.",
//   answer:"كل ما سبق",
//   options: [
//   "بصمة الصوت",
//     "بصمة الأصبع",
//     "كل ما سبق",
//     "بصمة الوجه",
  
//   ]
// },
// {
//   numb: 57,
//   question:"من انواع القياسات الحيوية ......",
//   answer:"كل ما سبق",
//   options: [
//     "بصمة الأذن",
//     "بصمة الكف",
//     "بصمة الأسنان",
//     "كل ما سبق",
  
//   ]
// },
// {
//   numb: 58,
//   question:" من انواع القياسات الحيوية .",
//   answer:"كل ما سبق",
//   options: [
//     "بصمه شبكه العين",
//     "بصمة الظل",
//     "كل ما سبق",
//     "بصمة وراثية",
  
//   ]
// },
// {
//   numb: 59,
//   question:"يوجد نوعان من الشبكات العصبية هما.",
//   answer:"كل ما سبق",
//   options: [
//     "Feed forward",
//     "feed back",
//     "كل ما سبق",
//     "لا شيء مما سبق",
  
//   ]
// },
// {
//   numb: 60,
//   question:"من انواع الدوال الغير خطية.",
//   answer:"كل ما سبق",
//   options: [
//     "الداله الأسية",
//     "الدالة اللوغارتمية",
//     "كل ما سبق",
//     "الدوال المثلثية",
  
//   ]
// },
// {
//   numb: 61,
//   question:"يمكن ان تأخذ قيم اوزان الشبكات العصبية ارقام موجبة او سالبة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 62,
//   question:"تتوقف قيم اوزان الشبكات العصبيه علي طريقة التعلم المستخدمة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 63,
//   question:"في شبكات forward Feed يكون مسار البيانات في اتجاه واحد",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 64,
//   question:"في شبكات back feed يكون مسار البيانات في اتجاه معين في بعض الوقت ثم يتحول ويتغير في الأتجاه العكس",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 65,
//   question:"يمكن استخدام شبكات التغذية العكسية(feed back) للعمل كذاكرة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 66,
//   question:"تسمي استخدام شبكات feed forward شبكات التغذية الأمامية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 67,
//   question:"تسمي شبكات feed back شبكات التغذية العكسية.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 68,
//   question:"يمكن دمج انواع الشبكات العصبية المختلفة ذات التغذية الأمامية والعكسية لتحسين كفاءة الشبكة في بعض التطبيقات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 69,
//   question:"تتغير قيم اوزان الشبكات العصبية اثناء عملية التعلم",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 70,
//   question:"تستخدم شبكات التغذية العكسية لنوع التعلم Learning unSupervised",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 71,
//   question:"تستخدم شبكات التغذية الأمامية لنوع التعلم Learning Supervised",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 72,
//   question:"تستخدم التعلم العميق لتحسين كفاءة الشبكات العصبية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 73,
//   question:"شبكات الأستشعار عن بعد تعتمد علي الحساسات (Sensors)",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 74,
//   question:"يقوم الميكروفون بأستقبال الأشارات الصوتية وتحويلها الي اشارات كهربائية تناظرية(Analog)",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 75,
//   question:"يقوم كارت الصوت في جهاز الحاسب الألي بتحويل الأشارات التناظرية القادمة من الميكروفون الي الأشارات الرقمية (0,1)حتي يستطيع جهاز الكمبيوتر فهمها",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 76,
//   question:"تعتبر السمعات حساسه (Sensor)للتيارالكهربي او الأشارات الكهربئية المعبرة عن الصوت حيث تقوم بتحويل الأشارات الكهربئية التناظرية الي صوت ",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 77,
//   question:"يقوم كارت الصوت بتحويل الأشارات الرقمية المعبرة عن الصوت الخارج من جهاز الكمبيوتر الي اشارات تناظرية تمر الي السماعات حتي يستطيع الأنسان فهمها او التعرف عليها",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 78,
//   question:"يمكن تصوير مشاهد الفيديو بأستخدام كاميرات الموبيل",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 79,
//   question:"تتشابه كروت الصوت مع كروت الشبكات من حيث كيفيه التعامل مع الأشارات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 79,
//   question:"تتشابه كروت الصوت مع كروت الشبكات من حيث كيفيه التعامل مع الأشارات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 79,
//   question:"تتشابه كروت الصوت مع كروت الشبكات من حيث كيفيه التعامل مع الأشارات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 80,
//   question:"يوجد اختلاف كبير بين مصباح الليد الموفر للطاقه وحساس الليد الموجود في الريموت",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 81,
//   question:"يمكن ادخال اشارات الفيديو الي كمبيوتر مباشرة عن طريق كارت الفيديو أو USB",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 82,
//   question:"استخدم كابلات الألياف البصرية افضل من استخدام كابلات الأسلاك النحاسية.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 83,
//   question:"فائدة السبلتر (Spliter)يقوم بفصل اشاره الأنترنت عن اشارة التليفون.",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 84,
//   question:"تعتمد فكرة الألياف البصرية علي استخدام الضوء في ارسال واستقبال البيانات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 85,
//   question:"يتم عزل كابلات الألياف البصرية عن العالم الخارجي عزال تاما .",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 86,
//   question:"تكون مقاومه كابلات الألياف البصرية للشوشرة عالية جدا",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 87,
//   question:"مقاومة اسلاك الألياف البصرية للشوشرة اعلي من مقاومة اسلاك النحاس  للشوشرة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
  
//   ]
// },
// {
//   numb: 88,
//   question:"انواع الكابلات المستخدمة في شبكات الحاسب .",
//   answer:"كل ماسبق",
//   options: [
//     "كابلات نحاسية",
//     "اسلاك ملتفه مزدوجة",
//     "اسلاك الياف بصرية",
//     "كل ماسبق",
    
  
//   ]
// },
// {
//   numb: 89,
//   question:"ينعكس الضوء في كابلات الألياف البصرية علي الواح من .",
//   answer:"زجاج",
//   options: [
//     "خشب",
//     "زجاج",
//     "كل ماسبق",
//     "لا شئ مماسبق",
    
  
//   ]
// },
// {
//   numb: 90,
//   question:" من امثلة الطاقة النظيفة.",
//   answer:"كل ماسبق",
//   options: [
//     "طاقة الشمسية",
//     "طاقة الرياح",
//     "الطاقة النووية",
//     "كل ماسبق",
    
  
//   ]
// },
// {
//   numb: 91,
//   question:"عند ارسال البيانات من جهاز الكمبيوتر الي جهاز اخر عن طريق استخدام  كابلات الألياف البصرية فإن ذلك يتطلب وجود ....عند جهاز المرسل.",
//   answer:"الصمام المشع للضوء (Light emitting diode)",
//   options: [
//     "الصمام الضوئي",
//     "الصمام المشع للضوء (Light emitting diode)",
//     "المكثفات",
//     "المقاومات",
    
  
//   ]
// },
// {
//   numb: 92,
//   question:"عند استقبال الضوء كابلات الألياف البصرية يتم استخدام جهاز ...لتحويل الضوء الي اشارة كهربئية يفهمها جهاز الكمبيوتر .",
//   answer:"الصمام الضوئي",
//   options: [
//     "الصمام الضوئي",
//     "الصمام المشع للضوء",
//     "المكثفات",
//     "المقاومات",
    
  
//   ]
// },
// {
//   numb: 93,
//   question:"تعتبر اجهزة أنذار الحريق مثالا علي الحساسات الحرارية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 94,
//   question:"تعتبر اجهزة التكاليف مثالا علي الحساسيات الحرارية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 95,
//   question:"تعتبر حساسات فرق الجهد دون الحاجة لمصدر للتيار الكهربي لأنها تحول الطاقة الضوئية الي طاقة كهربائية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 96,
//   question:"مجموع التيارات الداخلة يساوي مجموع التيارات الخارجة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 97,
//   question:"عند توصيل المقاومات علي التوالي فأن شدة التيار الكهربائي المار في كل مقاومة يكون ثابت",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 98,
//   question:"الحساسات عبارة عن مكونات الكترونية تقوم بتوصيل ونقل الكميات الفيزيائية الي كميات كهربائية",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 99,
//   question:"تقوم الحساسات ببث الأشارات الكهربائية الي اماكن اخري",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 100,
//   question:"يمكن استخدام الترانزستور كامفتاح في الدائرة",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 101,
//   question:"الصمام الثنائي له ثلاثه اطراف",
//   answer:"خطأ",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 102,
//   question:"في الترانزستور تكون قيمة التيار المار في الباعث مساويا لقيمة التيار المار في القاعدة + قيمة التيار المار في المجمع",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 103,
//   question:"تحتوي الدوائر المتكاملة علي الألأف أو الملايين من الترانزستورات",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 104,
//   question:"يستخدم الترانزستور لتمثيل القيم الرقمية (0,1)",
//   answer:"صح",
//   options: [
//     "صح",
//     "خطأ",
    
    
  
//   ]
// },
// {
//   numb: 105,
//   question:"من أنواع الحساسات",
//   answer:"كل ماسبق",
//   options: [
//     "حساسات الضغط",
//     "حساسات الرطوبة",
//     "حساسات السرعة",
//     "كل ماسبق",

//   ]
// },
// {
//   numb: 106,
//   question:"من أنواع الحساسات",
//   answer:"كل ماسبق",
//   options: [
//     "حساسات الصوت",
//     "حساسات الضوء والأشعة",
//     "حساسات حرارية",
//     "كل ماسبق",

//   ]
// },
// {
//   numb: 107,
//   question:"تعتبر اجهزة التبريد مثالا علي الحساسات",
//   answer:"الحرارية",
//   options: [
//     "الضوء",
//     "الأشعة",
//     "الحرارية",
//     "كل ماسبق",

//   ]
// },
// {
//   numb: 108,
//   question:"اذا كان قيمة التيار الكهربائي المار في المقاومة هو m/a 5 وقيمة المقاومة k5 فأن الفرق الجهد المتولد = ........",
//   answer:"25v",
//   options: [
//     "v20",
//     "40v",
//     "25v",
//     "لا شئ ماسبق",

//   ]
// },
// {
//   numb: 109,
//   question:"اذا كان فرق الجهد النقطة الثانية (v2) = v20 وقيمة المقاومة 10k وشدة التيار mA10 فأن فرق الجهد الثاني (v1) = ........",
//   answer:"120v",
//   options: [
//     "100v",
//     "120v",
//     "160A",
//     "200A",

//   ]
// },
// {
//   numb: 110,
//   question:"تستخدم....... لتخزين الطاقة",
//   answer:"المكثفات",
//   options: [
//     "المكثفات",
//     "المقاومات",
//     "الترانزستور",
//     "كل ماسبق",

//   ]
// },
// {
//   numb: 111,
//   question:"تستخدم....... لتخزين الطاقة",
//   answer:"الملفات",
//   options: [
//     "الملفات",
//     "المقاومات",
//     "الترانزستور",
//     "كل ماسبق",

//   ]
// },
// {
//   numb: 112,
//   question:"تستخدم..... في تكبير التيار الكهربائي",
//   answer:"الترانزستور",
//   options: [
//     "الملفات",
//     "المقاومات",
//     "الترانزستور",
//     "كل ماسبق",

//   ]
// },
// {
//   numb: 113,
//   question:"عند أطراف الترانزستور........",
//   answer:"3",
//   options: [
//     "2",
//     "3",
//     "4",
//     "5",

//   ]
// },

// ];



// // Shuffle questions array
// questions.sort(function() {
//   return 0.5 - Math.random();
// });

// // Select the first 30 questions
// questions = questions.slice(0, 30);

