


// creating an array and passing the number, questions, options, and answers
let questions = [
  {
    numb: 1,
    question: "من مكونات اطراف العقد لوثيقة التامين المؤمن له",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 2,
    question: "عقد التامين هو وثيقة بين شركة التامين والمؤمن له",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 3,
    question: "عقد التامين هو وثيقة بين شركة التامين والمؤمن له",
    answer: "",
    options: ["صح", "خطأ"],
  },
  {
    numb: 4,
    question:
      "لتكوين وثيقة التأمين لابد من توافر المتعاقد (المؤمن له) والمؤمن عليه والمستفيدين والمؤمن (شركة التأمين)",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 5,
    question:
      "المستفيد  او المستفيدين وهو الشخص الذي يستحق مبلغ التامين في حالة وفاة المؤمن عليه",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 6,
    question: "عملية التامين تسهل من فرص الحصول علي القرض من البنوك",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 7,
    question: "من اهم فوائد التامين الحفاظ على المدخرات",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 8,
    question:
      "عملية التأمين تكون بمثابة عملية استثمار مريحة ومضمونة مثل غيرها من أنواع الأستثمار",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 9,
    question:
      "لا يلتزم التأمين الطبي بتغطية النفقات الطبية الاساسية مثل الكشوفات والادوية للحصول علي رعاية افضل",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 10,
    question:
      "من اهم فوائد التأمين الطبي تحمل جزء كبير من تكلفة الكثير من التحاليل الطبية",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 11,
    question: "التأمين لمدي الحياة هو تأمين علي الحياة يظل ساريا حتي استحقاق الوثيقة وفي اي وقت تحدث فيه الوفاء وبدون تحديد المدة التي يجب ان تحدث خلالها الوفاة",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 12,
    question: "عقد التأمين مدي الحياة المؤجل هو عقد بمقتضاه يدفع مبلغ التأمين عند وفاة المؤمن عليه الي المستفيد بشرط ان تحدث الوفاة بعد انتهاء مدة معلومة من تاريخ التعاقد",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 13,
    question: "التأمين لمدي الحياة لا يقدم حماية تأمينية فقط مثل التأمين المؤقت وانما يحوي عنصر ادخاريا لا يستهان به يتيح للمؤمن له حق الأقتراض بضمان الوثيقة",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 14,
    question: " فان شراء التامين لمدي الحياة يقتصر نفعه علي خلق الشعور بالأطمئنان للأسرة فقط",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 15,
    question: "انواع عقود التامين في حال الحياة عقد التامين راس المال المؤجل",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 16,
    question: " تعتبر عقود المعاشات من ضمن عقود التامين في حال الحياة",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 17,
    question: "عقد دفعة معاش الحياة المؤجل المؤقت وهو اتفاق بين المؤمن والمستأمن يتعهد المؤمن بأن يدفع للمستأمن دفع دورية خلال مدة محدودة متفق عليها في العقد طالما كان المؤمن عليه حيا خلال مدة الدفع",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 18,
    question: "وثائق التأمين المختلطة او المركبة هي تلك العقود التي تحتوي علي اكثر من نوع من انواع عقود التأمين علي الحياة",
    answer: "صح",
    options: ["صح", "خطأ"],
  },
  {
    numb: 19,
    question: "عقد التأمين المختلط المضاعف يتعهد فيه المؤمن ان يدفع للمستأمن نصف مبلغ التأمين المتفق عليه اذا بقي علي قيد الحياة",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 20,
    question: " من عقود التامين المختلطة عقد التامين مدي الحياة المؤجل",
    answer: "خطأ",
    options: ["صح", "خطأ"],
  },
  {
    numb: 21,
    question: "حماية الأفراد من الخسائر المادية في حالة وقوع اي ضرر علي السيارة يعتبر من فوائد :",
    answer: "التامين علي السيارات",
    options: ["غير ذلك", "التامين علي السيارات" , "التامين الطبي"],
  },
  {
    numb: 22,
    question: "التأمين ضد السرقة وعمليات السطو يعتبر من اهم فوائد :",
    answer: "التامين علي الممتلكات",
    options: ["التامين علي السيارات", "التامين علي الممتلكات" , "غير ذلك"],
  },
  {
    numb: 23,
    question: "يعتبر التعويض عن انفجار الغاز المستعمل لأغراض المنزلية والتجارية في المحالت من اهم فوائد :",
    answer: "التامين ضد الحرائق",
    options: ["التامين ضد الحرائق", "التامين علي الممتلكات" , "غير ذلك"],
  },
  {
    numb: 24,
    question: "من انواع فوائد التامين :",
    answer: "كل ما سبق",
    options: ["التامين الطبي", "التامين علي السيارات" , "كل ما سبق"],
  },
  {
    numb: 25,
    question: "من انواع عقود التامين علي الحياة :",
    answer: "كل ما سبق",
    options: ["عقود التامين حال الوفاة", "عقود التامين حال الحياة" , "كل ما سبق"],
  },
  {
    numb: 26,
    question: "تلك العقود التي تتضمن دفع مبلغ معين للمستفيد في حالة وفاة المؤمن عليه تكون :",
    answer: "غير ذلك",
    options: ["عقود التامين حال الحياة", "عقود التامين المختلطة" , "غير ذلك"],
  },
  {
    numb: 27,
    question: "من انواع عقود التامين حال الوفاة :",
    answer: "عقود التامين علي الحياة المؤقتة",
    options: ["عقود التامين المختلطة", "عقود التامين علي الحياة المؤقتة" , "غير ذلك"],
  },
  {
    numb: 28,
    question: "هناك ثالث عوامل يتم الأخذ بها في التامين علي الحياة المؤقت :",
    answer: " مبلغ التامين",
    options: ["مبلغ التامين", " وثيقة التامين" , "غير ذلك"],
  },
  {
    numb: 29,
    question: "عقد بمقتضاه يدفع المؤمن مبلغ التأمين الي المستفيد او المستفيدين عند وفاة المؤمن عليه خلال مدة محدودة في العقد تبدء بعد انقضاء مدة تأجيل محددة يكون عبارة عن عقد التأمين علي الحياة:",
    answer: "المؤقت المؤجل",
    options: ["المؤقت المؤجل", "المختلط" , "غير ذلك"],
  },
{
    numb: 30,
    question: "دفعة معاش مدة الحياة عاجلة عادية عبارة عن القسط الوحيد الصافي لدفعة معاش علي حياة شخص عمره س سنة ومبلغ الدفعة بالجنية الواحد يدفع للمؤمن عليه في ......كل سنة بدء من تاريخ التعاقد",
    answer: "نهاية",
    options: ["بداية", "نهاية" , "غير ذلك"],
  },
  
  {
    numb: 31,
    question:"من انواع عقود التامين مدي الحياة عقود:",
    answer: "دفعة المعاشات",
    options: ["دفعة المعاشات", "التامين المختلط" , "كل ما سبق"],
  },

];

// Shuffle questions array
questions.sort(function() {
  return 0.5 - Math.random();
});
س


// Select the first 30 questions
questions = questions.slice(0, 30);
